[
  {
    "name": "Hồng Bàng \u0026 Văn Lang",
    "description": "Thời kỳ Hồng Bàng theo truyền thuyết và dã sử cho rằng bắt đầu từ năm 2879 TCN, là niên đại của Kinh Dương Vương, với quốc hiệu Xích Quỷ. Lãnh thổ của quốc gia dưới thời Kinh Dương vương rộng lớn, phía bắc tới sông Dương Tử (cả vùng hồ Động Đình), phía nam tới nước Hồ Tôn (Chiêm Thành), phía đông là Đông Hải (một phần của Thái Bình Dương), phía tây là Ba Thục (Tứ Xuyên, Trung Hoa ngày nay). Về sau người Việt chỉ thấy có ở miền Bắc Việt Nam ngày nay, có thể một phần do sự lấn áp của các tộc người Hoa Hạ từ phương Bắc. Có ít nhất 18 đời Hùng Vương cai trị trong thời đại Hồng Bàng, cho đến năm 258 TCN. Các thông tin về các đời vua Hùng dựa nhiều trên các truyền thuyết. Cũng có nhiều bằng chứng khảo cổ học như trống đồng Đông Sơn được tìm thấy ở miền bắc Việt Nam có cùng niên đại với thời kỳ Hồng Bàng, thể hiện một nền văn hóa đồ đồng rất phát triển (văn hoá Đông Sơn)."
  },
  {
    "name": "Âu Lạc \u0026 Nam Việt",
    "description": "Theo hai bộ sử ký Đại Việt sử ký toàn thư (viết ở thế kỷ 15) và Đại Việt sử lược (viết ở thế kỷ 13), thì nhà nước Âu Lạc được Thục Phán (thủ lĩnh bộ tộc Âu Việt) thành lập vào năm 258 TCN sau khi đánh bại vị vua Hùng cuối cùng của nước Văn Lang, ông lên ngôi và lấy niên hiệu là An Dương Vương. An Dương Vương sát nhập lãnh thổ của Văn Lang và lãnh thổ của bộ tộc mình (Âu Việt) và hình thành nên một nhà nước mới là Âu Lạc (kết hợp giữa người Âu Việt và người Lạc Việt) Lãnh thổ Âu Lạc gồm lãnh cũ của bộ tộc Âu Việt ở phía bắc, mà ngày nay là một phần phía nam tỉnh Quảng Tây (Trung Quốc) và lãnh thổ của Văn Lang ở miền bắc Việt Nam. Âu Lạc có ranh giới phía bắc là sông Tả Giang (Quảng Tây) đến phía nam là dãy núi Hoành Sơn ở Hà Tĩnh hiện nay."
  },
  {
    "name": "Bắc thuộc lần I",
    "description": "Thời kỳ Bắc thuộc lần thứ nhất trong lịch sử Việt Nam kéo dài từ năm 218 TCN hoặc 179 TCN hoặc 111 TCN đến năm 39, dưới sự cai trị của phong kiến Trung Quốc."
  },
  {
    "name": "Trưng Nữ Vương",
    "description": "Hai Bà Trưng (40 - 43) là thời kỳ xen giữa Bắc thuộc lần 1 và Bắc thuộc lần 2 trong lịch sử Việt Nam. Đây là tên gọi chung của hai chị em Trưng Trắc và Trưng Nhị, là anh hùng dân tộc của người Việt, những thủ lĩnh khởi binh chống lại nhà Đông Hán của Trung Quốc, lập ra một quốc gia với kinh đô tại Mê Linh và tự phong là Nữ vương."
  },
  {
    "name": "Bắc thuộc lần II",
    "description": "Thời kỳ Bắc thuộc lần thứ hai trong lịch sử Việt Nam kéo dài từ năm 43 đến năm 543. Thời kỳ này bắt đầu khi Mã Viện theo lệnh Hán Quang Vũ Đế nhà Đông Hán đánh chiếm lại bộ Giao Chỉ từ tay Trưng Vương, kéo dài đến khi Lý Bí khởi binh đánh đuổi thứ sử[1] nhà Lương là Tiêu Tư năm 542 rồi lập ra nước Vạn Xuân năm 544. Thời kỳ Bắc thuộc lần thứ 2 kéo dài khoảng 500 năm."
  },
  {
    "name": "Nhà Lý \u0026 Nhà Triệu",
    "description": "Nhà Tiền Lý (544-602) là một triều đại trong lịch sử Việt Nam, gắn liền với quốc hiệu Vạn Xuân. Nhà Tiền Lý kéo dài 58 năm, tổng cộng 3 đời vua, trong đó có 2 vua họ Lý và 1 vua họ Triệu cũng được tính gộp vào nhà Tiền Lý, tương tự như Dương Tam Kha trong nhà Ngô sau đó."
  },
  {
    "name": "Bắc thuộc lần III",
    "description": "Thời kỳ Bắc thuộc lần thứ ba trong lịch sử Việt Nam kéo dài từ năm 602 đến năm 905. Thời kỳ này bắt đầu khi Tùy Văn Đế sai Lưu Phương đánh chiếm nước Vạn Xuân, bức hàng Hậu Lý Nam Đế, kéo dài cho đến khi Khúc Thừa Dụ tiến vào Đại La, giành quyền cai quản toàn bộ Tĩnh Hải quân năm 905 - thời Đường Ai Đế, ông vua bù nhìn trong tay quyền thần Chu Ôn."
  },
  {
    "name": "Thời kỳ xây nền tự chủ",
    "description": "Tự chủ là thời kỳ đầu khôi phục lại nền độc lập của Việt Nam đầu thế kỷ 10 sau hơn 1000 năm Bắc thuộc. Thời kỳ này người Việt đã tự cai trị lãnh thổ nhưng chưa xưng làm vua, và chưa đặt quốc hiệu. Bề ngoài, Việt Nam vẫn là một phần lãnh thổ của \"thiên triều\" phương bắc ở trung nguyên với tên gọi \"Tĩnh Hải quân\" và người đứng đầu chỉ nối tiếp nhau làm chức Tiết độ sứ như một quan cai trị của Trung Quốc trước đây. Thời kỳ tự chủ bắt đầu từ khi họ Khúc nổi dậy nắm quyền thay các Tiết độ sứ người Trung Quốc (905) và kết thúc khi Ngô Quyền tiêu diệt Kiều Công Tiễn và đánh thắng quân Nam Hán, lập ra nhà Ngô (938)."
  },
  {
    "name": "Nhà Ngô",
    "description": "Nhà Ngô 26 năm (939-965), kinh đô Cổ Loa (Đông Anh, Hà Nội) Năm 938, Ngô Quyền tập hợp lực lượng từ Ái châu ra đánh Kiều Công Tiễn. Công Tiễn sai sứ sang nước Nam Hán xin quân cứu viện. Vua Nam Hán là Lưu Nghiễm cho con là Vạn vương Hoằng Tháo đem quân sang cứu, tự mình đóng quân làm thanh viện. Ngô Quyền hạ thành Đại La, giết Công Tiễn rồi bày trận trên sông Bạch Đằng đón quân Nam Hán. Tháng 11 năm 938, quân Hoằng Tháo bị Ngô Quyền đánh tan trong trận Bạch Đằng. Hoằng Tháo bị giết chết. Năm 939, Ngô Quyền lên ngôi, tức là Tiền Ngô Vương, đóng đô ở Cổ Loa, lập Dương thị làm hoàng hậu."
  },
  {
    "name": "Nhà Đinh",
    "description": "Nhà Đinh (968-980) là triều đại phong kiến trong lịch sử Việt Nam bắt đầu năm 968, sau khi Đinh Tiên Hoàng dẹp xong loạn 12 sứ quân thống nhất đất nước và kết thúc năm 980 khi con của Đinh Tiên Hoàng là Đinh Phế Đế nhường cho Lê Hoàn. Nhà Đinh là triều đại mở đầu chế độ phong kiến tập quyền và thời kỳ tự chủ với một chế độ đứng đầu bởi một Hoàng đế của nước Việt Nam. Vương triều nhà Đinh đã mở nền chính thống cho thời đại phong kiến độc lập nên trong các bộ chính sử kể từ Đại Việt sử ký toàn thư thế kỷ XV, Đại Việt sử ký tiền biên thế kỷ XVIII đến Khâm định Việt sử thông giám cương mục thế kỷ XIX; triều đại này đều được các tác giả lấy làm mốc mở đầu phần Bản kỷ hoặc Chính biên. Tiếp đến, việc xưng đế hiệu Đại Thắng Minh Hoàng đế của Đinh Tiên Hoàng mang ý thức lớn về sự tự tôn của nước Việt, có hàm ý so sánh với các Hoàng đế Trung Hoa."
  },
  {
    "name": "Nhà Tiền Lê",
    "description": "Nhà Tiền Lê, kinh đô Hoa Lư (29 năm, 980 - 1009) Nhà Tiền Lê bắt đầu khi Đinh Phế Đế nhường ngôi cho Lê Hoàn vào năm 980, trải qua ba đời quân chủ và chấm dứt khi Lê Long Đĩnh qua đời. Quốc hiệu vẫn là Đại Cồ Việt. Triều đại này được kế tục bởi nhà Lý, được sáng lập bởi Lý Công Uẩn."
  },
  {
    "name": "Nhà Lý",
    "description": "Nhà Lý (1010-1225), quốc hiệu Đại Cồ Việt, kinh đô Hoa Lư. Năm 1010 dời đô về Thăng Long. Từ 1054 đổi quốc hiệu là Đại Việt Nhà Lý bắt đầu khi Lý Công Uẩn lên ngôi vào tháng 10 âm lịch năm 1009, sau khi giành được quyền lực từ tay nhà Tiền Lê. Trong thời đại này, lần đầu tiên nhà Lý đã giữ vững được chính quyền một cách lâu dài đến hơn 200 năm, khác với các vương triều cũ trước đó chỉ tồn tại hơn vài chục năm. Vào năm 1054, Lý Thánh Tông đã đổi quốc hiệu từ Đại Cồ Việt thành Đại Việt, mở ra kỷ nguyên Đại Việt rực rỡ trong lịch sử Việt Nam. Trong nước, mặc dù các vị Hoàng đế đều sùng bái Phật giáo nhưng ảnh hưởng của Nho giáo cũng rất cao với việc mở các trường đại học đầu tiên là Văn miếu (1070) và Quốc tử giám (1076) và các khoa thi để chọn người hiền tài không có nguồn gốc xuất thân là quý tộc ra giúp nước."
  },
  {
    "name": "Nhà Trần",
    "description": "Nhà Trần 175 năm (1225 - 1400), quốc hiệu Đại Việt, kinh đô Thăng Long Nhà Trần là triều đại quân chủ chuyên chế trong lịch sử Việt Nam, bắt đầu khi Trần Cảnh lên ngôi vào năm 1225, sau khi được Lý Chiêu Hoàng truyền ngôi. Trong giai đoạn nắm giữ quyền lực, nhà Trần vẫn đóng đô ở Thăng Long - kinh đô triều cũ, tiếp tục mở rộng và phát triển sự hưng thịnh có từ đời nhà Lý. Dưới triều Trần, lực lượng quân đội đặc biệt được chú trọng phát triển đủ sức đánh dẹp các cuộc nội loạn và đương đầu với quân đội các nước xung quanh. Chính sách chia thực ấp cho các thân tộc trong họ, mỗi thế lực trong dòng tộc đều có quân đội tinh nhuệ là nền tản lớn khiến quân đội nhà Trần tiêu diệt được cuộc xâm phạm của quân đội Nhà Nguyên, Đế quốc Mông Cổ qua 3 lần vào năm 1258, 1285 và 1287. Thời gian này xuất hiện một danh tướng kiệt xuất là Hưng Đạo đại vương Trần Quốc Tuấn; người có vai trò quan trọng trong chiến thắng vào năm 1285 và 1287."
  },
  {
    "name": "Nhà Hồ",
    "description": "Nhà Hồ (1400-1407): quốc hiệu Đại Ngu, kinh đô Tây Đô (Thanh Hóa) Nhà Hồ bắt đầu khi Hồ Quý Ly lên ngôi năm 1400 sau khi giành được quyền lực từ tay nhà Trần và chấm dứt khi Hồ Hán Thương bị quân Minh bắt vào năm 1407 – tổng cộng là 7 năm. Quốc hiệu Đại Việt đã đổi thành Đại Ngu năm 1400."
  },
  {
    "name": "Nhà Hậu Trần",
    "description": "Nhà Hậu Trần (1407 - 1413) do Giản Định đế - Trần Ngỗi thành lập tháng 10 âm lịch năm 1407 tại Ninh Bình sau khi nhà nước Đại Ngu của nhà Hồ bị quân đội nhà Minh xâm chiếm và tiêu diệt. Trong thời kỳ này, nước Đại Ngu bị nhà Minh đổi tên trở lại thành Giao Chỉ. Do quân mới lập, Giản Định đế phải chạy vào Nghệ An, viên Đại tri châu Hóa châu là Đặng Tất giết quan nhà Minh, dẫn quân từ Hóa châu ra theo phò, nhà Hậu Trần làm chủ từ Nghệ An vào Thăng Hoa. Năm 1408, quân Hậu Trần tiến quân ra Bắc, đánh bại quân Minh ở trận Bô Cô, bao vây các thành. Năm 1409, Giản Định đế giết 2 tướng Đặng Tất, Nguyễn Cảnh Chân, khiến cho 2 người con của họ là Đặng Dung và Nguyễn Cảnh Dị bất mãn, kéo quân mình trở về Nghệ An lập Trần Quý Khoáng lên làm Trùng Quang đế. Trùng Quang đế sai Nguyễn Súy bắt được Giản Định đế tôn làm Thượng hoàng, chia quân đánh quân Minh. Quân Minh sau khi được tăng viện liền tiến hành chiến tranh, quân nhà Hậu Trần sau những chiến thắng ban đầu, dần thất thế, phải lui về Nam và thất bại hoàn toàn vào năm 1414."
  },
  {
    "name": "Bắc thuộc lần IV",
    "description": "Sau khi chiếm được Đại Việt, quân Minh chia nước ta thành quận huyện để cai trị. Chúng bắt nhân dân ta làm tôi tớ, thuế má lao dịch nặng nề, cuộc sống vô cùng cực khổ. Ngày Mậu Thân, tháng Giêng năm Mậu Tuất (7/2/1418), Lê Lợi phất cờ khởi nghĩa ở hương Lam Sơn, huyện Lương Giang, trấn Thanh Hoá. Có quân sư Nguyễn Trãi dâng sách Bình Ngô nhằm thu phục lòng người, cháu nội của quan Tư đồ Trần Nguyên Đán là Trần Nguyên Hãn và nhiều nhân tài, hào kiệt các nơi tham gia. Ngày 3/1/1428, nghĩa quân hoàn toàn thắng lợi, Lê Lợi lên ngôi Hoàng đế, lập nên triều đại nhà Lê. Sử gọi là Hậu Lê để phân biệt với Tiền Lê 980-1009 do Lê Hoàn sáng lập."
  },
  {
    "name": "Nhà Hậu Lê",
    "description": "Nhà Hậu Lê (1427-1789) do Lê Thái Tổ lập ra, được phân biệt với nhà Tiền Lê (980-1009) do Lê Đại Hành lập ra cuối thế kỷ 10. Nhà Hậu Lê gồm có 2 giai đoạn: - Nhà Lê sơ (1428-1527): kéo dài 100 năm, bắt đầu từ khi khởi nghĩa Lam Sơn thắng lợi, Lê Lợi gạt bỏ vua bù nhìn Trần Cảo, tự làm vua, lập ra triều đại mới và kết thúc khi quyền thần Mạc Đăng Dung phế bỏ vua Lê Cung Hoàng lập ra nhà Mạc. - Nhà Lê trung hưng(1533-1789): kéo dài 256 năm, bắt đầu từ khi Thượng tướng quân Nguyễn Kim lập tông thất Lê Duy Ninh lên ngôi, tức Lê Trang Tông tại Ai Lao để khôi phục nhà Hậu Lê; kết thúc khi Lê Chiêu Thống chạy sang lưu vong tại Trung Quốc dưới thời Thanh Cao Tông. Cách gọi nhà Hậu Lê bao gồm cả hai giai đoạn Lê sơ và Lê trung hưng. Đặc biệt, thời Lê Trung hưng tuy kéo dài nhưng các Hoàng đế nhà Lê mất thực quyền, chỉ tồn tại trên danh nghĩa. Thời kỳ đầu gọi là Nam Bắc triều, nhà Lê và nhà Mạc chia đôi nước Đại Việt."
  },
  {
    "name": "Nam Bắc Triều",
    "description": "Mạc Đăng Dung, sau khi dẹp được các bè phái trong cung đình, đã ép vua Lê Cung Hoàng nhà Hậu Lê nhường ngôi tháng 6 năm 1527 và chấm dứt khi vua Mạc Mậu Hợp bị quân đội Lê-Trịnh do Trịnh Tùng chỉ huy đánh bại vào cuối năm 1592– tổng cộng thời gian tồn tại chính thức của triều đại là gần 66 năm. Tuy nhiên, giai đoạn sau đó hậu duệ nhà Mạc như Mạc Kính Cung, Mạc Kính Khoan, Mạc Kính Vũ vẫn còn tiếp tục chống lại nhà Hậu Lê thời kỳ trung hưng đến tận năm 1677 tại khu vực Cao Bằng. Thời kỳ 1533-1592 trong lịch sử Việt Nam còn được gọi là thời kỳ Nam-Bắc triều, do chính quyền nhà Mạc chỉ thực sự có quyền lực từ địa phận Ninh Bình ngày nay trở ra, còn từ Thanh Hóa trở vào là thế lực lấy danh nghĩa gây dựng lại nhà Lê từ năm 1533."
  },
  {
    "name": "Trịnh Nguyễn Phân Tranh",
    "description": "Trịnh-Nguyễn phân tranh là thời kỳ phân chia giữa chế độ \"vua Lê chúa Trịnh\" ở phía Bắc sông Gianh (sử gọi là Đàng Ngoài) và chúa Nguyễn cai trị ở miền Nam (Đàng Trong), mở đầu khi Trịnh Tráng đem quân đánh Nguyễn Phúc Nguyên năm 1627 và kết thúc vào cuối thế kỷ 18 khi nhà Tây Sơn đánh đổ cả chúa Nguyễn lẫn chúa Trịnh. Ban đầu, cả thế lực họ Trịnh và họ Nguyễn đều mang khẩu hiệu \"phù Lê diệt Mạc\" để lấy lòng thiên hạ và thề trung thành với triều Hậu Lê. Sau khi nhà Mạc đã bị đánh đổ, trên danh nghĩa, cả Chúa Trịnh và Chúa Nguyễn đều là bề tôi của nhà Hậu Lê, cả Đàng Trong lẫn Đàng Ngoài đều là lãnh thổ của nhà Lê. Nhưng trên thực tế thì khác, cả hai đều tạo thế lực cát cứ cho riêng mình, vua nhà Hậu Lê đã không còn thực quyền nên không chặn được sự phân tranh giữa hai họ Trịnh - Nguyễn. Nước Đại Việt trong giai đoạn này bị chia cách hơn 150 năm."
  },
  {
    "name": "Nhà Tây Sơn",
    "description": "Nhà Tây Sơn (1778 - 1802), được thành lập trong bối cảnh tranh chấp quyền lực cuối thời Lê Trung Hưng. Theo cách gọi của phần lớn sử gia thì \"nhà Tây Sơn\" được dùng để gọi triều đại của anh em Nguyễn Nhạc, Nguyễn Lữ và Nguyễn Huệ để phân biệt với nhà Nguyễn của Nguyễn Ánh (vì cùng họ Nguyễn). Một trong những công tích lớn nhất của nhà Tây Sơn trong lịch sử dân tộc là đã tiến đến rất gần công cuộc thống nhất và đồng thời mở rộng lãnh thổ đất nước sau hàng trăm năm Việt Nam bị chia cắt bởi các cuộc tranh giành quyền lực giữa các thế lực lớn Mạc-Trịnh-Nguyễn kể từ khi nhà Lê sơ bị sụp đổ. Tuy nhiên việc vua Quang Trung (Nguyễn Huệ) đột ngột qua đời khi còn khá trẻ đã khiến ưu thế của Tây Sơn chuyển vào tay Nguyễn Ánh, một hậu duệ của Chúa Nguyễn cũng sinh trưởng trên đất Đàng Trong trong thế kỷ 18 với nhiều biến động lớn của lịch sử. Triều đại Tây Sơn tồn tại khoảng 24 năm thì sụp đổ sau khi chúa Nguyễn Ánh tiến hành một cuộc chiến tranh toàn diện để tiêu diệt nhà Tây Sơn và thành lập nhà Nguyễn."
  },
  {
    "name": "Nhà Nguyễn",
    "description": "Nhà Nguyễn (1802 - 1945) được thành lập sau khi vua Gia Long lên ngôi năm 1802, là triều đại cuối cùng trong lịch sử Việt Nam. Năm 1802 đến năm 1804 sử dụng quốc hiệu Nam Việt, năm 1804 đến năm 1839 sử dụng quốc hiệu Việt Nam, Đại Việt Nam, năm 1839, vua Minh Mạng đổi quốc hiệu là Đại Nam. Triều Nguyễn là một triều đại đánh dấu nhiều thăng trầm của lịch sử, đặc biệt là cuộc xâm lược của người Pháp giữa thế kỷ 19. Triều Nguyễn được coi là trải qua hai giai đoạn chính: - Giai đoạn thứ nhất (1802-1858) là giai đoạn độc lập, các vua nhà Nguyễn nắm toàn quyền quản lý đất nước, trải qua 4 đời vua, Gia Long, Minh Mạng, Thiệu Trị, Tự Đức. - Giai đoạn thứ hai, (1858-1945) là giai đoạn bị Pháp xâm lăng và đô hộ, kể từ khi quân Pháp đánh Đà Nẵng và kết thúc sau khi hoàng đế Bảo Đại thoái vị vào năm 1945."
  },
  {
    "name": "Pháp Thuộc",
    "description": "Pháp thuộc là một giai đoạn trong lịch sử Việt Nam kéo dài 61 năm, bắt đầu từ 1884 khi Pháp ép triều đình Huế chấp nhận sự bảo hộ của Pháp cho đến 1945 khi Pháp mất quyền cai trị ở Đông Dương. Tuy nhiên, nhiều tài liệu khác cho rằng thời kỳ Pháp thuộc cần được tính từ năm 1867 (tức là kéo dài gần 80 năm), khi Nam Kỳ Lục tỉnh bị nhà Nguyễn cắt nhượng cho Pháp, trở thành lãnh thổ đầu tiên Pháp chiếm được trong quá trình Pháp xâm lược Đại Nam. Trong thời kỳ này Việt Nam bị chia cắt thành 3 xứ riêng biệt với ba cơ cấu hành chính riêng: xứ thuộc địa Nam Kỳ và hai xứ bảo hộ Bắc và Trung Kỳ. Cao Miên (Campuchia), Ai Lao cũng chịu sự cai trị của Pháp, và nhượng địa Quảng Châu Loan tiếp theo bị gom vào Liên bang Đông Dương. Tháng 9 năm 1945, Pháp đem quân trở lại tấn công Việt Nam, nhưng người Việt Nam phản kháng quyết liệt và Pháp đã bị thất bại sau 9 năm chiến tranh. Pháp buộc phải công nhận nền độc lập của Việt Nam (cũng như Lào và Campuchia), chính thức chấm dứt thời kỳ Pháp thuộc, đồng thời kéo theo sự sụp đổ hệ thống thuộc địa của Pháp và các nước thực dân khác trên khắp thế giới vào thập niên 1950 - 1960."
  },
  {
    "name": "Việt Nam Dân Chủ Cộng Hoà",
    "description": "Ngày 3/2/1930, Đảng cộng sản Đông Dương ra đời. Dưới sự lãnh đạo của lãnh tụ Nguyễn Ái Quốc, dân tộc ta đã khởi nghĩa làm cuộc Cách mạng tháng Tám (19-8-1945) thành công, đánh đổ đế quốc Pháp và phát xít Nhật. Ngày 2/9/1945, Chủ tịch Hồ Chí Minh đọc Tuyên ngôn độc lập tại Quảng trường Ba Đình (lịch sử gọi đây là bản tuyên ngôn độc lập lần thứ 3 của Tổ quốc ta) lập nên nước Việt Nam dân chủ cộng hoà với thủ đô là thành phố Hà Nội, mở đầu một kỷ nguyên mới trong lịch sử dân tộc ta."
  },
  {
    "name": "Cộng hoà xã hội chủ nghĩa Việt Nam",
    "description": "Ngày 2/7/1976, nước Việt Nam thống nhất chính thức có tên Cộng hoà xã hội chủ nghĩa Việt Nam, thủ đô là thành phố Hà Nội."
  }
]