{"name":"vua Hùng thành lập quốc gia Văn Lang","time":"Thế kỉ VII TCN","description":"Nhà nước Văn Lang được cai trị bởi các Hùng Vương. Nhà nước Văn Lang đóng đô ở thành phố Việt Trì tỉnh Phú Thọ có tên là thành Phong Châu"}
{"name":"An Dương Vương thôn tính Văn Lang, thành lập quốc gia Âu Lạc","time":"207 TCN","description":"một nhân vật có thật tên là Thục Phán (An Dương Vương) năm 257 TCN. Nhà nước này đã thống nhất 2 bộ tộc Âu Việt - Lạc Việt (Sử gọi là Văn Lang) lại với nhau và đã bảo vệ đất nước thành công trước cuộc xâm lược của nhà Tần"}
{"name":"Chiến tranh Tần-Việt","time":"218 TCN - 207 TCN","description":"Vào năm Tần Thủy Hoàng thứ hai mươi tám (219 TCN), Tần Thủy Hoàng lấy Đồ Thư làm tướng quân và đưa 500.000 quân chia thành năm đạo quân. Theo ghi chép của các biên niên sử địa phương ở Hồ Nam và các nơi khác, quân đội Tần sử dụng trong cuộc chiến này chủ yếu là quân Tần diệt Sở , nhưng để thích ứng với cuộc chiến phía nam, không dưới 100.000 trong số 500.000 quân. quân do nước Sở ban đầu. Quân Tần được chia thành năm lộ trình và tiến xuống từ sườn núi phía Nam . Tuyến đầu tiên tập trung tại Yugan (nay là tỉnh Giang Tây ), tấn công các khu vực Đông Âu và Mân Việt (chủ yếu ở Phúc Kiến ngày nay ), và thành lập quận Minzhong sau khi bị chiếm . Tuyến thứ hai được canh giữ ở Nam Việt (nay là thành phố Nam Cương, tỉnh Giang Tây ), tạo thành một xu hướng áp bức đối với Mân Việt và Nam Việt. Con đường thứ ba đi qua Trường Sa ngày nay, tiếp theo là cưỡi Thiên Lăng và chiếm Phiên Ngung ở Nam Việt. Tuyến thứ tư đóng tại núi Jiuyi (nay là phía nam huyện Ninh Viễn , tỉnh Hồ Nam ), và tuyến thứ năm đóng tại Yuechengling gần Tancheng (nay là phía tây nam của Jingzhou Miao và Dong Autonomous County , Hunan Province ) , sẵn sàng cùng nhau tấn công Xiou . Hai tuyến đường phía tây nhất của nó lần đầu tiên đánh bại sự kháng cự của Tây Âu và giết chết Tây Âu Yiyu Song. Năm thứ hai, quân Tần đã xâm nhập hoàn toàn vào nội địa Nam Việt, và ba quận Nam Hải, Quế Lâm và Tương Quân được đặt làm cơ sở cho việc thành lập thành phố Nam Vũ ở cửa sông Châu Giang, phía bắc. của Quảng Tây, và ngã ba của Việt Nam và Quảng Tây. Đầu quân Tần, Đường Tư Đồ và Đường Chiêu Nghi, tổng cộng 200.000 con ngựa, là những người đầu tiên tấn công. Phần lớn binh lính của quân Tần là từ phía bắc, và phần lớn là từ Thiểm Tây , Sơn Tây và Hà Nam . Khoảng 218 năm trước, quân Tần gặp phải sự kháng cự ngoan cố từ Tây Âu ở Quảng Tây, sau khi thủ lĩnh tộc Tây Âu là Dịch Hu Tống chết, người Tây Âu đã chạy trốn vào rừng để tiếp tục kháng chiến và cắt đứt đường lương thực của quân Tần.  ghi chép rằng Tây Âu  tấn công Tần vào ban đêm, đập tan nó, giết chết Yutu Sui, chôn xác và đổ máu hàng vạn , buộc quân Tần ở một nơi vô dụng, sau đó không phải rút lui , vì vậy ba năm không tháo giáp, giãn nỏ, để tù không chuyển lương. Sau khi Đồ Thư chết, phó tướng của ông là Triệu Đà lên thay. Quân Tần tổn thất khoảng 300.000 người, 200.000 người còn lại rút về phía đông Lĩnh Nam . Quân Tần phái thêm bọn tội phạm canh giữ biên giới, 500.000 người lưu vong di cư bị Tần phái đến Nam Việt lưu lạc linh tinh. Vì nhiều người từ đồng bằng miền Trung đến Lĩnh Nam không có vợ nên Triệu Đà yêu cầu Tần Thủy Hoàng phái 3 vạn cung nữ xuống phía nam, nhưng Tần Thủy Hoàng chỉ phái 15 ngàn người. Vì vậy, nhiều người trong số họ đã lấy phụ nữ Việt Nam làm vợ. Dưới sự bảo trợ của Triệu Đà, nhà Tần bắt đầu giảm bớt mối quan hệ giữa người Việt và những người cai trị của họ. Với sự mở rộng quy mô của các cuộc hôn nhân, số người từ phương Bắc vào trấn giữ biên giới cũng ngày một nhiều hơn."}
{"name":"Triệu Đà xâm lược nước Âu Lạc, sáp nhập vào quốc gia Nam Việt","time":"179 TCN","description":"Triệu Đà là võ tướng theo lệnh Tần Thủy Hoàng dẫn quân xuống chinh phạt miền Nam (khi đó là lãnh thổ của các bộ tộc Bách Việt). Ông chiếm được các vùng nay là Quảng Đông, Quảng Tây. Triệu Đà cũng xin Tần Thủy Hoàng di dân 50 vạn người từ Trung Hoa đến vùng này nhằm đồng hóa người bản địa theo văn hóa Trung Quốc (ngày nay gọi là chính sách "Hán hóa"). Năm 210 TCN, Nhà Tần ở Trung Hoa diệt vong, nhận thấy triều đình trung ương đã sụp đổ, Triệu Đà bèn tách ra cát cứ, xưng Đế và lập nên nước Nam Việt và cai trị suốt giai đoạn 207-137 TCN[1]. Năm 179 TCN, Nam Việt xâm chiếm thành công nước Âu Lạc của An Dương Vương"}
{"name":"khởi nghĩa Hai Bà Trưng, Trưng Trắc thành lập quốc gia Lĩnh Nam, kinh đô đặt tại Mê Linh","time":"40","description":"Trong số các Lạc tướng có ý chống lại sự thống trị của nhà Hán, nổi lên nhà Trưng Trắc ở Mê Linh, Phong Châu và nhà Thi Sách ở Chu Diên. Theo Đại Việt sử lược, Trưng Trắc và em gái là Trưng Nhị có cá tính mạnh mẽ, không chịu ràng buộc theo pháp luật mà Tô Định áp đặt[5]. Địa bàn mà Trưng Trắc quản giữ khá rộng lớn, giữa dãy Ba Vì và Tam Đảo tức là trung tâm quốc gia Văn Lang của vua Hùng trước đây, lọt vào giữa 3 khúc sông: khuỷu sông Đà, sông Hồng và sông Đáy. Còn địa bàn của Thi Sách liền kề với Mê Linh, cách nhau con sông Đáy, nằm trong châu thổ hữu ngạn sông Hồng và tả ngạn sông Đáy.[6][7]. Trưng Trắc kết hôn với Thi Sách, hai nhà đồng lòng tập hợp lực lượng chống lại sự cai trị của nhà Hán và đã tập hợp được sự ủng hộ của khá nhiều thủ lĩnh địa phương khác. Trước khí thế chống đối của các thủ lĩnh người Việt, Tô Định đã giết Thi Sách để hy vọng dập tắt sớm ý định chống đối[8]. Thù chồng bị giết càng khiến Trưng Trắc hành động gấp rút trong việc khởi binh chống nhà Hán. Ngày mồng 4 tháng 9[16] năm Kỷ Hợi (39), Trưng Trắc và Trưng Nhị tập hợp các tướng lĩnh cùng nhau làm Hội thề ở bãi đá Tràng Sa, cửa sông Hát (huyện Phúc Thọ, Hà Nội) thuộc huyện Mê Linh thời đó. Sau một thời gian chuẩn bị, tháng 2 năm 40, Trưng Trắc cùng Trưng Nhị chính thức phát động khởi nghĩa chống lại nhà Đông Hán. Cuộc khởi nghĩa được sự hưởng ứng của nhiều đội quân và nhân dân các nơi thuộc Âu Lạc và Nam Việt cũ.[20][21] Quân Hai Bà đánh hãm trị sở Luy Lâu. Quân Hai Bà trước tiên tấn công đô úy trị quận Giao Chỉ ở Mê Linh. Chiếm được nơi đây, Hai Bà Trưng tiến đánh huyện Tây Vu, chiếm thành Cổ Loa. Trên đà thắng lợi, từ Cổ Loa, Hai Bà Trưng mang quân vượt sông Hoàng, sông Đuống đánh trị sở Giao Chỉ ở Luy Lâu bên bờ sông Dâu (lãng Lũng Khê, Thuận Thành, Bắc Ninh). Quân khởi nghĩa tấn công quá nhanh khiến Tô Định không kịp trở tay. Trước thế mạnh của quân Hai Bà, các viên quan cầm đầu không trở tay kịp và không dám chống cự, bỏ chạy về phương Bắc. Thái thú Giao Chỉ là Tô Định hoảng hốt cũng tháo chạy. Để thoát thân, Tô Định phải cạo tóc, cạo râu, trà trộn vào loạn quân, vứt bỏ ấn tín mà chạy. Tương truyền người Việt đương thời vẫn có tục lệ phổ biến là cạo tóc, nên Tô Định làm như vậy để bắt chước cho khỏi bị phát hiện trên đường trốn. Khởi nghĩa thắng lợi, Trưng Trắc lên ngôi vua,Trưng Nhị làm Phó Vương. Thần tích gọi là Mê Linh Nhị Thánh"}
{"name":"Chiến tranh Lĩnh Nam - Đông Hán","time":"42 - 43","description":"Vua Hán phong tướng Mã Viện đã 58 tuổi làm Phục ba tướng quân, Lưu Long làm Phó tướng, Đoàn Chí làm Lâu Thuyền tướng quân sang đánh đất Giao Chỉ[1]. Quân Hán bao gồm 8.000 quân lấy từ các quân Trường Sa, Quế Dương, Linh Lăng, 12.000 quân lấy ở bộ Giao Chỉ. Quân Mã Viện chia thành 2 đạo thủy bộ dự tính hội quân ở Hợp Phố để tiến đánh. Tuy nhiên khi đến Hợp Phố thì Đoàn Chí chết vì bệnh nên Mã Viện thống suất toàn quân tiến theo ven biển, ngược sông Bạch Đằng tới sông Lục Đầu rồi vào đất Giao Chỉ, đi thẳng tới Lãng Bạc. Quân Hán tiến đến Long Biên, Tây Vu và Lãng Bạc ở phía đông Cổ Loa. Hai Bà Trưng từ Mê Linh qua Cổ Loa xuống Lãng Bạc đón đánh quân Hán. Tại đây, hai bên đã giao chiến dữ dội. Quân Hán không hợp thủy thổ phương Nam, nhiều người bị chết, trong đó có Bình Lục hầu Hàn Vũ. Sau trận Lãng Bạc, Trưng Vương phải thu quân về giữ Cổ Loa một thời gian rồi phải lui về Mê Linh, sau đó chạy sang Cấm Khê. Tại Cấm Khê, quân của Hai Bà tiếp tục bị đánh bại. Quân Hán chém hơn nghìn người, bắt hàng hơn 2 vạn quân khởi nghĩa.[6] Theo truyền thuyết dân gian Việt Nam thì hai bà chạy đến sông Hát thì nhảy xuống sông tự sát.[3] Còn theo các sách Thống chí và Hậu Hán thư thì hai bà đều bị chém.[6] Theo sách Hậu Hán thư phần Lưu Long truyện thì Lưu Long đuổi theo bắt được Trưng Nhị còn trong Mã Viện truyện thì cho biết quân Mã Viện khi truy sát quân nổi dậy tới Cấm Khê đã chém được cả Trưng Trắc lẫn Trưng Nhị và đem đầu về Lạc Dương.[1][7] Sau khi chiến thắng, Mã Viện cho lui quân về Luy Lâu để thu phục quận thành và nghỉ ngơi. Thời điểm Hai Bà mất được xác định chưa thống nhất. Hán thư ghi sự kiện diễn ra tháng 4 âm lịch, tức là tháng 5 dương lịch năm 43. Theo truyền thuyết dân gian Việt Nam, Hai Bà tự vẫn vào ngày 8 tháng 3, nên về sau lấy ngày này làm ngày hội Hát Môn"}
{"name":"Khởi nghĩa Chu Đạt","time":"156–160","description":"Cuộc khởi nghĩa Chu Đạt diễn ra từ năm 156 đến năm 160. Năm 156, Chu Đạt, người huyện Cư Phong, Cửu Chân (nay là xã Phú Hào-Thọ Phú, huyện Triệu Sơn, Thanh Hóa), nổi dậy chống chính quyền đô hộ nhà Đông Hán. Chu Đạt chiêu mộ dân binh vây đánh huyện sở Cư Phong (vùng đất các huyện Nông Cống, Quảng Xương, Tĩnh Gia, Như Xuân, Như Thanh thuộc tỉnh Thanh Hóa ngày nay) giết chết huyện lệnh, giải phóng toàn bộ quận Cửu Chân rồi tấn công quận trị Tư Phố giết chết thái thú Nghê Thức nhà Đông Hán. Cuộc khởi nghĩa tập hợp lực lượng có tới 5.000 người, quản trị Cửu Chân được 4 năm từ năm 156 đến năm 160. Năm 158, vua Đông Hán cử đô úy Ngụy Lãng đem quân đàn áp, buộc Chu Đạt phải lui vào Nhật Nam (Quảng Bình, Quảng Trị, Thừa Thiên). Tại đây thanh thế nghĩa quân mạnh lên, lực lượng lên tới hàng vạn người, hoạt động đến mùa thu 160 thì bị thứ sử Hạ Phương dập tắt. Chu Đạt mất tại đây."}
{"name":"Khởi nghĩa Lương Long","time":"178–181","description":"Khởi nghĩa Lương Long (178-181) do Lương Long (梁龍) người Giao Chỉ lãnh đạo nhân dân các quận Giao Chỉ, Cửu Chân, Nhật Nam, Hợp Phố chống lại chính quyền đô hộ nhà Đông Hán. Lực lượng nghĩa quân lên tới hàng vạn người, liên kết với người Ô Hử 烏滸 (tổ tiên của người Tày ở biên giới Việt-Trung và người Choang ở Quảng Tây hiện nay) cùng Thái thú quận Nam Hải là Khổng Chi nên thanh thế rất mạnh, nổi dậy đánh chiếm được các quận huyện và nhiều vùng đất từ Giao Chỉ đến Hợp Phố và từ Cửu Chân đến Nhật Nam. Thứ sử Giao Châu là Chu Ngung phải đóng cổng thành cố thủ và xin viện binh. Mùa hè năm 181, Đông Hán vương cử Huyện lệnh Lan Lăng là Chu Tuấn mang 5000 quân sang đánh dẹp, cuộc khởi nghĩa bị dập tắt."}
{"name":"Khu Liên khởi nghĩa, tách quận Nhật Nam thành lập quốc gia Lâm Ấp","time":"192","description":"Từ nửa cuối thế kỷ 2, phần lãnh thổ cực nam Giao Chỉ trở nên khó trị, dân cư bản địa liên tục nổi lên chống lại chính sách cai trị hà khắc của chính quyền đô hộ. Tượng Lâm trở thành nơi tranh chấp thường xuyên giữa nhà Hán và dân địa phương. Năm 137-138, Khu Liên ở Tượng Lâm (Quảng Nam), chống Đông Hán. Nhân dân quận Giao Chỉ, Cửu Chân, hưởng ứng nổi dậy đốt thành giết trưởng lại. Năm 190, người Tượng Lâm nổi lên giết thứ sử Chu Phù và chiếm huyện thành. Năm 192, dân Tượng Lâm giết huyện lệnh (huyện trưởng) để đưa Khu Liên lên cai trị. Khu Liên cắt một phần lãnh thổ cực nam của quận Nhật Nam - huyện Tượng Lâm để thành lập vương quốc riêng: Lâm Ấp"}
{"name":"Khởi nghĩa Bà Triệu","time":"246 - 248","description":"Bà Triệu sinh ngày 2 tháng 10 năm Bính Ngọ (8 tháng 11 năm 226)[1] tại miền núi Quan Yên (hay Quân Yên), quận Cửu Chân, nay thuộc làng Quan Yên (hay còn gọi là Yên Thôn), xã Định Tiến, huyện Yên Định, tỉnh Thanh Hóa. Mùa xuân năm Mậu Thìn (248), thấy quan lại nhà Đông Ngô (Trung Quốc) tàn ác, dân khổ sở, Bà Triệu bèn bàn với anh việc khởi binh chống lại. Từ hai căn cứ núi vùng Nưa và Yên Định, hai anh em bà dẫn quân đánh chiếm huyện trị Tư Phố[4] nằm ở vị trí hữu ngạn sông Mã. Đây là căn cứ quân sự lớn của quan quân nhà Đông Ngô trên đất Cửu Chân. Thừa thắng, lực lượng nghĩa quân chuyển hướng xuống hoạt động ở vùng đồng bằng con sông này. Đang lúc ấy, Triệu Quốc Đạt lâm bệnh qua đời.[5] Các nghĩa binh thấy bà làm tướng có can đảm, bèn tôn lên làm chủ. Bà đã phối hợp với ba anh em họ Lý ở Bồ Điền đánh chiếm các vùng đất còn lại ở phía Bắc Thanh Hóa ngày nay, đồng thời xây dựng tuyến phòng thủ từ vùng căn cứ Bồ Điền đến cửa biển Thần Phù (Nga Sơn, Thanh Hoá) để ngăn chặn viện binh của giặc Ngô theo đường biển tấn công từ phía Bắc. Khi ra trận, Bà Triệu mặc áo giáp vàng, đi guốc ngà, cài trâm vàng, cưỡi voi trắng một ngà[6] và được tôn là Nhụy Kiều tướng quân. Quân Bà đi đến đâu cũng được dân chúng hưởng ứng, khiến quân thù khiếp sợ. Theo truyền thuyết, để mua chuộc, giặc đã phong cho Bà Triệu đến chức Lệ Hải Bà Vương (nữ vương xinh đẹp của vùng ven biển), còn bí mật sai tay chân thân tín tới gặp và hứa sẽ cấp cho Bà thật nhiều tiền bạc, nhưng Bà cũng chẳng chút tơ hào. Được tin cuộc khởi nghĩa lan nhanh,[7] vua Ngô là Tôn Quyền liền phái tướng Lục Dận (cháu của Lục Tốn), sang làm Thứ sử Giao Châu, An Nam hiệu úy, đem theo 8.000 quân sang đàn áp cuộc khởi nghĩa. Đến nơi, tướng Lục Dận liền dùng của cải mua chuộc một số lãnh tụ địa phương để làm suy yếu và chia rẽ lực lượng nghĩa quân. Theo Trần Trọng Kim trong Việt Nam sử lược, bà chống đỡ với quân Đông Ngô được năm, sáu tháng thì thua. Bà Triệu đã tuẫn tiết trên núi Tùng (xã Triệu Lộc, huyện Hậu Lộc, Thanh Hóa) vào năm Mậu Thìn (248), lúc mới 23 tuổi."}
{"name":"khởi nghĩa Lý Bí","time":"541","description":"Lý Bí sinh ngày 12 tháng 9 năm Quý Mùi (17 tháng 10 năm 503). Từ nhỏ, Lý Bí đã tỏ ra là một cậu bé thông minh, sớm hiểu biết. Khi Lý Bí năm tuổi thì cha mất, bảy tuổi thì mẹ qua đời. Ông đến ở với chú ruột. Một hôm, có một vị Pháp tổ thiền sư đi ngang qua, trông thấy Lý Bí khôi ngô, tuấn tú liền xin Lý Bí đem về chùa nuôi dạy. Sau hơn 10 năm rèn sách chuyên cần, Lý Bí trở thành người học rộng, hiểu sâu. Nhờ có tài văn võ kiêm toàn, Lý Bí được tôn lên làm thủ lĩnh địa phương. Được nhiều người hưởng ứng, lực lượng của Lý Bí lớn mạnh. Tù trưởng ở Chu Diên (Hải Dương) là Triệu Túc cùng con là Triệu Quang Phục phục tài đức của ông nên đã đem quân nhập với đạo quân của ông. Tinh Thiều, một người giỏi từ chương, từng đến kinh đô nhà Lương xin được chọn làm quan, nhưng chỉ được cho chức gác cổng thành nên bỏ về Giao Châu theo Lý Bí. Ngoài ra trong lực lượng của Lý Bí còn có một võ tướng là Phạm Tu đã ngoài 60 tuổi. Thần phả còn ghi nhận thêm các tướng theo giúp Lý Bí là Trịnh Đô, Tam Cô, Lý Công Tuấn hay còn gọi là Đào Công Tuấn. Lý Bí liên kết với các châu lân cận cùng chống lại Tiêu Tư. Cuối năm 541, Lý Bí chính thức khởi binh chống nhà Lương, khí thế rất mạnh. Theo sách Lương thư của Trung Quốc, Tiêu Tư liệu thế không chống nổi quân Lý Bí, phải sai người mang của cải đến đút lót cho Lý Bí để được tha chạy thoát về Quảng Châu[15]. Quân của Lý Bí đánh chiếm lấy thành Long Biên. Tuy Tiêu Tư đã bỏ chạy nhưng Lý Bí chỉ mới kiểm soát được vùng Bắc Bộ Việt Nam hiện nay, các châu phía nam vẫn còn trong tay nhà Lương. Tháng 4 năm 542, Lương Vũ Đế sai Thứ sử Việt châu là Trần Hầu, Thứ sử La châu là Ninh Cự, Thứ sử An châu là Úy Trí, Thứ sử Ái châu là Nguyễn Hán cùng hợp binh đánh Lý Bí. Nhưng Lý Bí đã chủ động ra quân đánh trước, phá tan lực lượng quân Lương ở phía nam, làm chủ toàn bộ Giao Châu."}
{"name":"Lý Bí thành lập quốc gia Vạn Xuân","time":"544","description":"Năm 544, tháng giêng, Lý Bí tự xưng là Nam Việt Đế, lên ngôi, đặt niên hiệu là Thiên Đức (đức trời), lập trăm quan, đặt tên nước là Vạn Xuân thể hiện mong muốn rằng xã tắc truyền đến muôn đời. Ông đóng đô ở vùng cửa sông Tô Lịch (Hà Nội), dựng điện Vạn Thọ làm nơi triều hội, thành lập triều đình với hai ban văn, võ và lấy Triệu Túc làm Thái phó, Tinh Thiều đứng đầu ban văn, Phạm Tu đứng đầu ban võ"}
{"name":"Chiến tranh Tiền Lý – Lương","time":"545-550","description":"Năm Giáp Tý 544, Lý Bí lên ngôi sau khi đánh đuổi thành công ách đô hộ nhà Lương.Năm 545, tháng 5, nhà Lương cho Dương Phiêu (hay Dương Thiệu) làm thứ sử Giao Châu, Trần Bá Tiên[1] làm tư mã, đem quân xâm lấn. Trần Bá Tiên đem quân đi trước. Khi quân của Bá Tiên đến Giao Châu, Lý Nam Đế đem 3 vạn quân ra chống cự, bị thua ở Chu Diên, lại thua ở cửa sông Tô Lịch, tướng Tinh Thiều, Phạm Tu, Triệu Túc tử trận. Ông chạy về thành Gia Ninh (xã Gia Ninh, huyện Vĩnh Lạc tỉnh Vĩnh Phúc cũ ngày nay thuộc xã Thanh Đình, thành phố Việt Trì, tỉnh Phú Thọ.). Quân Lương đuổi theo vây đánh. Tháng giêng năm 546, Trần Bá Tiên đánh lấy được thành Gia Ninh. Lý Nam Đế chạy vào đất người Lạo ở Tân Xương. Quân Lương đóng ở cửa sông Gia Ninh. Sau một thời gian tập hợp và củng cố lực lượng, tháng 8, ông đem 2 vạn quân từ trong đất Lạo ra đóng ở hồ Điển Triệt (xã Tứ Yên, huyện Lập Thạch, tỉnh Phú Thọ), đóng nhiều thuyền đậu chật cả mặt hồ. Quân Lương sợ, cứ đóng lại ở cửa hồ không dám tiến vào. Đêm hôm ấy nước sông lên mạnh, dâng cao 7 thước, tràn đổ vào hồ. Trần Bá Tiên nhân đó đem quân theo dòng nước tiến trước vào. Quân Vạn Xuân không phòng bị, vì thế tan vỡ. Năm 548, Lý Nam Đế mất ở động Khuất Lạo, ông giao ủy quyền cho Triệu Quang Phục là con của quan thái thú Triệu Túc (Tiền Lý).Triệu Quang Phục tự xưng là Triệu Việt Vương,kêu gọi người dân một lần nữa đứng lên Chống Lương.Năm 547, tháng giêng, Quang Phục đã hành động trước ông lui về giữ đầm Dạ Trạch (bãi Màn Trò, huyện Khoái Châu, tỉnh Hưng Yên). Đầm này rộng, cỏ cây um tùm, bụi rậm che kín, ở giữa có nền đất cao có thể ở được, bốn mặt bùn lầy, người ngựa khó đi, chỉ có thể dùng thuyền độc mộc nhỏ chống sào đi lướt trên cỏ nước mới có thể vào được. Nếu không quen biết đường đi thì lạc không biết là đâu, lỡ rơi xuống nước liền bị rắn độc cắn chết. Quang Phục thuộc rõ đường đi lối lại, đem hơn 2 vạn người vào đóng ở nền đất trong đầm. Ông dùng chiến thuật du kích, ban ngày tuyệt không để khói lửa và dấu người, ban đêm dùng thuyền độc mộc đem quân ra đánh doanh trại của quân Bá Tiên cướp hết lương thực vũ khí, giết và bắt sống rất nhiều, lấy được lương thực để làm kế cầm cự lâu dài. Bá Tiên không đánh được. nhà Lương có loạn,Bá Tiên phải về (sau này Trần Bá Tiên cướp ngôi vua của nhà Lương năm 557),Bá Tiên cho Dương Sàn ở lại. Thế là Quang Phục nghe tin cho quân vây đánh. Dương Sàn bất ngờ, chống cự không nổi nên bị giết chết, các tướng Nhà Lương cũng lần lượt bị bại trận.Quân Lương tan vỡ chạy về Bắc[4]. Cuối năm 550, Triệu Quang Phục lên ngôi vua thống nhất đất nước."}
{"name":"Chiến tranh Tùy–Vạn Xuân","time":"602","description":"Năm 601, Lý Phật Tử bị triệu sang Trung Hoa chầu Tùy Văn Đế.[1] Tuy nhiên, ông đã trì hoãn việc tham dự và cuối cùng đã nổi loạn vào năm 602, mặc dù ông đã công nhận chính quyền nhà Tùy vào năm 595.[1] Ông tập trung lực lượng quân sự của mình tại thành Cổ Loa và Long Biên.[1] Năm 602, tướng Lưu Phương lãnh đạo quân đội nhà Tùy trong cuộc xâm lược vào Tiền Lý. Quân đội nhà Tùy khởi hành từ Vân Nam vào lãnh thổ nhà Tiền Lý.[1] Tuy nhiên, quân đội nhà Tiền Lý không được chuẩn bị để chống đỡ họ, bởi vì họ không ngờ rằng quân đội nhà Tùy sẽ đi theo con đường xâm lược này.[1] Cuối cùng, Lý Phật Tử đã đầu hàng lực lượng nhà Tùy.[1][2] Do đó, người Trung Quốc đã bắt ông giam cầm và chuyển ông ta đến thủ đô Trường An của Trung Quốc.[1][2] Quân đội của Lưu Phương cũng buộc phải khuất phục hoặc đánh bại các gia tộc địa phương còn lại. Lãnh thổ bị chinh phục được hợp nhất vào Trung Quốc dưới sự cai trị của nhà Tùy."}
{"name":"khởi nghĩa Lý Tự Tiên","time":"687","description":"Tháng 7 năm 687 thời Bắc thuộc lần III, Lý Tự Tiên ở Giao Châu nổi dậy chống Đường, do quan đô hộ là Lưu Diên Hựu bắt nộp thuế cả mà không theo lệ cũ là chỉ nộp một nửa. Nhưng, cơ mưu bị bại lộ, Lý Tự Tiên bị Lưu Diên Hựu giết chết."}
{"name":"khởi nghĩa Mai Hắc Đế","time":"713 - 723","description":"Cuộc khởi nghĩa nổ ra tại Rú Đụn, còn gọi là Hùng Sơn (Nghệ An). Mai Thúc Loan lên ngôi vua, lấy hiệu là Mai Hắc Đế. Theo Việt điện u linh, Mai Hắc Đế mang mệnh thủy tức là nước, mà nước được tượng trưng là màu đen. Vì vậy, ông lấy hiệu là Hắc Đế để hợp với mệnh của mình. Một số nguồn cũng cho hay, ông lấy hiệu là Mai Hắc Đế vì ông có màu da đen. Ông cho xây thành lũy, lập kinh đô Vạn An (thuộc thị trấn Nam Đàn hiện nay), tích cực rèn tập tướng sỹ. Cuộc nổi dậy của ông được hưởng ứng rộng rãi ở trong nước và có cả sự liên kết với Lâm Ấp và Chân Lạp. Mai Hắc Đế tiến binh đánh thành Tống Bình (Hà Nội ngày nay), Đô hộ nhà Đường là Quang Sở Khách cùng đám thuộc hạ không chống cự lại được, phải bỏ thành chạy về nước. Lực lượng Mai Hắc Đế lúc đó lên tới chục vạn quân. Mùa thu năm Nhâm Tuất (722), Nhà Đường bèn huy động 10 vạn quân do tướng Dương Tư Húc và Quang Sở Khách sang đàn áp. Quan quân nhà Đường tiến theo đường bờ biển Đông Bắc và tấn công thành Tống Bình. Sau nhiều trận đánh khốc liệt từ lưu vực sông Hồng đến lưu vực sông Lam, cuối cùng Mai Hắc Đế thất trận, thành Vạn An thất thủ, nghĩa quân tan vỡ. Không đương nổi đội quân xâm lược, Mai Hắc Đế phải rút vào rừng, sau bị ốm rồi mất"}
{"name":"khởi nghĩa Phùng Hưng","time":"776-791","description":"Phùng Hưng là người ở làng Đường Lâm, thuộc Giao Châu. Ông vốn con nhà hào phú, có sức vật trâu, đánh hổ.[6] Chuyện kể rằng ông đã từng đánh chết một con hổ có thể quặp hai con trâu mộng mà vẫn chạy như thường,trừ được hoạ cho làng Đường Lâm. Phùng Hưng vốn là cháu bảy đời của Phùng Tói Cái – người đã từng vào trong cung vua Đường Cao Tổ thời niên hiệu Vũ Đức (618–626) dự yến tiệc và làm Quan lang ở đất Đường Lâm. Bố của Phùng Hưng là Phùng Hạp Khanh, một người hiền tài đức độ. Phùng Hưng nối nghiệp cha và đã trở thành Hào trưởng đất Đường Lâm. Cho tới nay dân gian vẫn còn lưu truyền câu chuyện ông dùng mưu kế giết hổ dữ mang lại bình yên cho làng xóm. Cao Chính Bình, Hiệu úy châu Vũ Định (miền Việt Bắc) giúp Kinh lược sứ An Nam là Trương Bá Nghi đánh bại được cuộc xâm lược của quân Chà Và (Java) ở Chu Diên, sau đó được cử làm đô hộ An Nam. Chính Bình ra sức vơ vét của cải của nhân dân, đánh thuế rất nặng. Phùng Hưng đem quân đánh với Cao Chính Bình, lâu ngày không thắng được. Phùng Hưng dùng kế của Đỗ Anh Hàn, đặt đại bản doanh ở làng Triều Khúc, Thanh Trì đem quân vây phủ. Phùng Hưng nhận thấy lực lượng chưa thật đủ mạnh để đánh bại quân địch, ông đã cùng các tướng tỏa đi xung quanh chiêu mộ thêm binh lính và sắm thêm vũ khí, còn việc vây thành được giao cho ba người cháu gái họ Phùng, gọi Phùng Hưng bằng bác. Quan Đô hộ Cao Chính Bình đem binh ra đánh, không hơn được, ưu phẫn phát bệnh vàng da rồi chết.  ông cầm quyền cai trị không lâu sau đó đã qua đời ngay trong năm 791. Các sử gia hiện nay xác định ông mất khoảng tháng 5 năm 791"}
{"name":"Khúc Thừa Dụ xây dựng chính quyền tự chủ","time":"905","description":"Trước khi nhà Đường sắp mất ngôi độ mấy năm, thì bên Trung Quốc loạn, giặc cướp nổi lên khắp cả mọi nơi. Uy quyền nhà vua không ra đến bên ngoài, thế lực ai mạnh thì người ấy xưng đế, xưng vương. Ở nước Việt, lúc bấy giờ có một người họ Khúc tên là Thừa Dụ, quê ở Hồng Châu (thuộc địa hạt Bàng Giang và Ninh Giang ở Hải Dương). Khúc Thừa Dụ vốn là một người hào phú trong xứ, mà tính lại khoan hòa, hay thương người, cho nên có nhiều người kính phục. Năm Bính Dần (906) đời vua Chiêu Tuyên nhà Đường, nhân khi trong châu có loạn, dân chúng cử ông làm Tiết độ sứ để cai trị Giao Châu. Nhà Đường lúc bấy giờ suy nhược, thế không ngăn cấm được, nên thuận cho ông làm Tĩnh Hải Tiết độ sứ và gia phong Đồng bình Chương sự. Năm sau nhà Đường mất ngôi (907), nhà Hậu Lương lên thay, phong cho Lưu Ẩn làm Nam Bình Vương, kiêm chức Tiết độ sứ Quảng Châu và Tĩnh Hải, có ý để lấy lại Giao Châu. Khúc Thừa Dụ dựng đô ở La Thành, làm cho dân yên, nước trị. Ông khéo léo dùng danh nghĩa xin mệnh nhà Đường buộc triều đình nhà Đường phải công nhận chính quyền của ông. Ngày 7 tháng 2 năm 906, vua Đường phong thêm cho Tĩnh Hải quân Tiết độ sứ Khúc Thừa Dụ tước Đồng bình chương sự. Sau đó, Khúc Thừa Dụ tự lấy quyền mình, phong cho con là Khúc Hạo chức vụ Tĩnh Hải hành quân tư mã quyền tri lưu hậu, tức là chức vụ chỉ huy quân đội và sẽ kế vị quyền Tiết độ sứ. Ngày 23 tháng 7 năm 907, Khúc Thừa Dụ mất, Khúc Hạo lên kế vị."}
{"name":"Trận Bạch Đằng, Ngô Quyền đánh bại quân Nam Hán trên sông Bạch Đằng","time":"938","description":"Năm 931, Dương Đình Nghệ đánh đuổi quân Nam Hán – một trong 10 nước thời Ngũ đại Thập quốc nằm liền kề với Tĩnh Hải quân – giành lại quyền tự chủ cho người Việt ở Tĩnh Hải quân, tự xưng là Tiết độ sứ. Năm 937, Đình Nghệ bị nha tướng Kiều Công Tiễn giết hại để cướp ngôi Tiết độ sứ. Con rể và là một tướng khác của Đình Nghệ là Ngô Quyền bèn tập hợp lực lượng ra đánh Công Tiễn để trị tội phản chủ.[3] Kiều Công Tiễn sợ hãi, bèn sai người sang cầu cứu Nam Hán. Vua Nam Hán là Lưu Nghiễm nhân cơ hội đó bèn quyết định đánh Tĩnh Hải quân lần thứ hai.[4] Lưu Nghiễm cho rằng Dương Đình Nghệ qua đời thì Tĩnh Hải quân không còn tướng giỏi, bèn phong cho con trai thứ 9 là Lưu Hoằng Tháo làm Bình Hải tướng quân và Giao Chỉ vương, thống lĩnh thủy quân. Sau khi tập hợp các hào kiệt trong nước đứng về phía mình, Ngô Quyền mang quân từ Ái châu ra Bắc đánh Kiều Công Tiễn. Kiều Công Tiễn bị cô lập không chống nổi, trông chờ viện binh của Nam Hán. Ngô Quyền cho quân sĩ đóng cọc có bịt sắt nhọn xuống lòng sông Bạch Đằng. Khi thủy triều lên, bãi cọc chìm sâu xuống dưới mặt nước nên không bị lộ. Ngô Quyền dự định nhử quân địch vào khu vực này khi thủy triều lên và đợi nước triều rút xuống cho thuyền địch mắc cạn mới giao chiến. Vào một ngày cuối đông năm 938, trên sông Bạch Đằng, vùng cửa biển và hạ lưu, cả một đoàn binh thuyền do Hoằng Tháo chỉ huy vừa vượt biển tiến vào cửa ngõ Bạch Đằng. Quân Nam Hán thấy quân của Ngô Quyền chỉ có thuyền nhẹ, quân ít tưởng có thể ăn tươi, nuốt sống liền hùng hổ tiến vào. Ngô Quyền ra lệnh cho quân bỏ chạy lên thượng lưu. Đợi đến khi thủy triều xuống, ông mới hạ lệnh cho quân sĩ đổ ra đánh. Thuyền chiến lớn của Nam Hán bị mắc cạn và lần lượt bị cọc đâm thủng gần hết. Lúc đó Ngô Quyền mới tung quân ra tấn công dữ dội. Quân Nam Hán thua chạy, còn Lưu Hoằng Tháo bỏ mạng với hơn một nửa quân sĩ."}
{"name":"Ngô Quyền xưng vương, kinh đô Cổ Loa","time":"939","description":"Tiền Ngô Vương là vị vua đầu tiên của nhà Ngô trong lịch sử Việt Nam. Năm 938, ông là người lãnh đạo nhân dân đánh bại quân Nam Hán trong trận Bạch Đằng, chính thức kết thúc gần một ngàn năm Bắc thuộc, mở ra một thời kì độc lập lâu dài của Việt Nam. Sau chiến thắng này, ông lên ngôi vua, lập ra nhà Ngô, trị vì từ năm 939 đến năm 944."}
{"name":"Loạn 12 sứ quân","time":"944 - 968","description":"Năm 944, Ngô Quyền mất, con trai Dương Đình Nghệ là Dương Tam Kha cướp ngôi, tự lập mình làm vua, xưng Dương Bình vương. Ngô Xương Ngập (con trưởng Ngô Quyền) chạy về nhà một hào trưởng là Phạm Lệnh Công ở làng Trà Hương (Hải Dương). Dương Tam Kha ba lần sai quân đi bắt Ngô Xương Ngập mà không được. Năm 950, Dương Tam Kha sai Ngô Xương Văn (con Ngô Quyền) đi đánh 2 thôn Đường Lâm và Nguyễn Gia Loan ở Thái Bình. Ngô Xương Văn cho rằng đây là các ấp vô tội và thuyết phục các tướng dẫn quân quay lại lật đổ Dương Tam Kha. Xương Văn không giết Tam Kha, chỉ giáng xuống làm Chương Dương công. Ngô Xương Văn tự xưng làm Nam Tấn Vương, đóng đô ở Cổ Loa, cho người đón anh trai Ngô Xương Ngập về cùng làm vua, là Thiên Sách Vương. Lúc đó cùng tồn tại hai vua là Thiên Sách Vương và Nam Tấn Vương, sử sách gọi là Hậu Ngô Vương. Năm 965, Ngô Xương Văn đi đánh thôn Đường tức Đường Lâm của sứ quân Ngô Nhật Khánh và thôn Nguyễn Gia Loan của sứ quân Nguyễn Thái Bình bị phục binh bắn nỏ chết.[4] Khi Ngô Xương Xí nối ngôi, Ngô Nhật Khánh là anh em cùng họ cũng kéo quân từ Đường Lâm về Cổ Loa tranh giành. Năm 966 Thứ sử Dương Huy, Thứ sử Kiều Công Hãn, Tham mưu Lã Xử Bình và Nha tướng Đỗ Cảnh Thạc tranh nhau làm vua.[8] Đinh Bộ Lĩnh giết được Lã Xử Bình, kiểm soát được thành Cổ Loa. Các tướng Kiều Công Hãn, Đỗ Cảnh Thạc thua chạy về Phong Châu và Đỗ Động, nổi dậy thành sứ quân. Các sứ quân ra mặt đánh chiếm lẫn nhau: Phạm Bạch Hổ tấn công Trần Lãm, Lã Đường tấn công Đỗ Cảnh Thạc; Kiều Công Hãn tấn công Nguyễn Khoan; Nguyễn Thủ Tiệp giết Dương Huy chiếm Vũ Ninh và tự xưng là Vũ Ninh vương. Năm 967, Sứ quân Trần Lãm mất, Sứ quân Ngô Nhật Khánh từ Đường Lâm, Đỗ Động Giang tập hợp 500 con em Ngô Tiên chúa đánh Bố Hải Khẩu, khi đến đất Ô Man thì bị Ngô phó sứ chặn đánh phải bỏ về.[10] Đinh Bộ Lĩnh liền cất quân đi đánh, không bộ lạc nào ở đó không hàng phục. Các sứ quân Phạm Bạch Hổ, Ngô Nhật Khánh, Ngô Xương Xí đem quân về hàng, lực lượng họ Đinh ngày càng lớn mạnh. Đinh Bộ Lĩnh đánh dẹp các sứ quân Đỗ Cảnh Thạc, Nguyễn Siêu, Nguyễn Khoan, Kiều Công Hãn, Kiều Thuận. Năm 968, Đinh Bộ Lĩnh tiếp tục đánh dẹp các sứ quân Lý Khuê, Lã Đường và thống nhất Tĩnh Hải quân, lên ngôi Hoàng đế ở kinh đô Hoa Lư, chính thức lập ra triều đại nhà Đinh trong lịch sử Việt Nam"}
{"name":"Đinh Bộ Lĩnh xưng đế, thành lập quốc gia Đại Cồ Việt, kinh đô Hoa Lư","time":"968","description":"Đinh Bộ Lĩnh công đánh dẹp loạn 12 sứ quân, thống nhất giang sơn và trở thành hoàng đế đầu tiên của Việt Nam sau thời Bắc thuộc."}
{"name":"Đinh Bộ Lĩnh cùng con trai bị sát hại","time":"979","description":"Đinh Tiên Hoàng có con trưởng là Đinh Liễn, nhưng ông lại lập con út Hạng Lang làm Thái tử. Vì vậy đầu năm Kỷ Mão 979, Đinh Liễn tức giận sai người giết Hạng Lang. Theo chính sử, tháng 11 (âm lịch) năm đó, một viên quan là Đỗ Thích, mơ thấy sao rơi vào miệng, tưởng là điềm báo được làm vua nên đã giết chết cả Đinh Tiên Hoàng và Đinh Liễn. Đinh Tiên Hoàng làm vua được 12 năm, thọ 56 tuổi. Ông được táng ở sơn lăng Trường Yên, kinh đô Hoa Lư."}
{"name":"Lê Hoàn lên ngôi vua, thành lập nhà Tiền Lê","time":"980","description":"Tháng 10 năm 979, Chi hậu nội nhân Đỗ Thích giết Đinh Tiên Hoàng và Nam Việt Vương Đinh Liễn ở sân cung. Định quốc công Nguyễn Bặc, Ngoại giáp Đinh Điền cùng Lê Hoàn rước Vệ vương Đinh Toàn lên ngôi hoàng đế và tôn mẹ Đinh Toàn là Dương Vân Nga làm Hoàng thái hậu.[1] Vệ vương Đinh Toàn lên ngôi khi mới 6 tuổi, Lê Hoàn làm nhiếp chính đảm đương việc nước, xưng là Phó vương. Định quốc công Nguyễn Bặc, Ngoại giáp Đinh Điền, Phạm Hạp nghi ngờ Hoàn sẽ làm điều bất lợi cho vua nhỏ, bèn dấy binh, chia hai đường thủy bộ, muốn tiến về Hoa Lư giết Lê Hoàn. Lê Hoàn chỉnh đốn quân lữ, đánh nhau với Đinh Điền, Nguyễn Bặc ở Tây Đô[a], Đinh Điền, Nguyễn Bặc bỏ chạy, đem quân thủy ra đánh. Lê Hoàn nhân chiều gió phóng lửa đốt thuyền chiến, chém Đinh Điền, bắt Nguyễn Bặc đóng cũi đưa về kinh sư, sau đem chém. Phạm Hạp được tin, mất khí thế, chạy về làng Cát Lợi ở Bắc Giang. Lê Hoàn đuổi theo, bắt sống Phạm Hạp mang về kinh sư. Nhận tin quân Tống chuẩn bị xâm lược, Thái hậu sai Lê Hoàn chọn dũng sĩ đi chiến đấu, lấy người Nam Sách Giang là Phạm Cự Lạng làm Đại tướng quân. Khi triều đình đang bàn kế hoạch xuất quân, Phạm Cự Lạng cùng các tướng quân khác đều mặc áo trận đi thẳng vào Nội phủ, nói với mọi người: Thưởng người có công, giết kẻ trái lệnh là phép sáng để thi hành việc quân. Nay chúa thượng còn trẻ thơ, chúng ta dẫu hết sức liều chết để chặn giặc ngoài, may có chút công lao, thì có ai biết cho? Chi bằng trước hãy tôn lập ông Thập đạo làm Thiên tử, sau đó sẽ xuất quân thì . Quân sĩ đều hô vạn tuế. Thái hậu thấy mọi người vui lòng quy phục bèn sai lấy áo long cổn khoác lên người Lê Hoàn, mời lên ngôi Hoàng đế. Từ đó ông lên ngôi hoàng đế, đổi niên hiệu là Thiên Phúc"}
{"name":"Chiến tranh Tống - Việt","time":"981 tháng 1 - tháng 4","description":"Cuối năm 980, vua Tống gửi thư khiêu chiến, triều thần Đại Cồ Việt họp khẩn cấp và giao vương quyền cho Thập đạo tướng quân Lê Hoàn (tức vua Lê Đại Hành) lãnh đạo toàn dân đánh đuổi giặc ngoại xâm. Sau đó, vua Tống huy động trên 4 vạn quân chia thành 2 đường thủy, bộ tiến vào nước ta, lịch sử gọi là chiến tranh Việt - Tống lần thứ 1. Vua Lê Đại Hành chia quân ra nhiều hướng chống địch. Một nhánh quân tiến lên lập phòng tuyến ở bờ bắc sông Lục Giang, một cánh quân khác phòng thủ vùng Đại La cùng phía bờ bắc sông Luộc. Lê Đại Hành đích thân dẫn đại quân từ kinh đô Hoa Lư ngược sông Đáy, sông Nhuệ vào sông Hồng rồi tiến ra vùng Đông Bắc nước ta nghênh địch. Tháng 1-981, cánh quân thủy của giặc tiến vào cửa sông Bạch Đằng. Quân Tống đã đánh chìm khoảng 200 chiến thuyền quân ta. Lê Hoàn buộc rút quân về vùng Kinh Môn (Hải Dương) để củng cố lực lượng. Lúc này, quân bộ của Tống cũng bắt đầu tấn công dữ dội vào các phòng tuyến của ta tại Hoa Bộ. Cuộc chiến diễn ra rất ác liệt, quân ta đã ngăn bước tiến của địch làm cho 2 cánh quân thủy, bộ của chúng không liên lạc được với nhau. Đầu tháng 2-981, thủy quân của Tống theo sông Kinh Thầy tiến vào sông Lục Đầu để tấn công thành Đại La. Lê Hoàn liền kéo quân đến xây dựng phòng tuyến giữ sông Lục Đầu. Quân Tống dàn quân chiếm sông và liên tục tìm cách chọc thủng phòng tuyến của quân ta nhưng đều thất bại. Ngày 11-4-981, quân Tống tăng viện binh và đã chọc thủng phòng tuyến của ta rồi tiến đến Tây Kết. Ngày 28-4-981, vua Lê tổ chức đánh một trận quyết chiến với giặc trên sông Bạch Đằng. Bằng mưu kế dụ địch của Ngô Quyền ngày trước, chờ quân Tống lọt vào trận địa phục kích, quân ta phản công và Hầu Nhân Bảo bị giết chết trong đám loạn quân. Nghe tin chủ tướng đã chết, cánh quân Tống trên bộ vội vàng tháo chạy về nước. Cuộc chiến giữa Đại Cồ Việt và Tống lần thứ 1 kết thúc với phần thắng thuộc về quân dân Đại Việt. Vua Tống thừa nhận thất bại và công nhận vương triều của nhà Lê do Lê Hoàn sáng lập."}
{"name":"Lý Công Uẩn lên ngôi vua, thành lập nhà Lý","time":"1009 21 tháng 11","description":"năm 1009, Lê Long Đĩnh mất, Thái tử còn bé, hai người em là Lê Minh Đề và Lê Minh Xưởng tranh cướp ngôi vua, bị Công Uẩn giết chết. Lý Công Uẩn lên ngôi hoàng đế ngày 21/11/1009, đặt niên hiệu Thuận Thiên"}
{"name":"Lý Công Uẩn dời đô về Thăng Long","time":"1010","description":"Hoa Lư vốn là kinh đô của 2 triều đại Đinh và Tiền Lê, là một vị trí cố thủ tự nhiên giữa những những mỏm núi đá nằm bên rìa phía Đông Nam đồng bằng sông Hồng, kiểm soát tuyến đường đất từ đồng bằng sông Hồng tới các tỉnh phía Nam, cũng là tiền đồn của những tỉnh phía Nam nhìn ra đồng bằng sông Hồng.[8]. Lúc lên ngôi, Lý Thái Tổ cho rằng Hoa Lư thành hẹp, đất thấp, muốn dời đô về Đại La. Tháng 7 năm Thuận Thiên thứ nhất (1010) thì khởi sự dời đô. Khi thuyền mới đến đậu ở dưới thành, thấy có con rồng vàng hiện ra, nhân thế đặt tên là Thăng Long"}
{"name":"Lý Thánh Tông lên ngôi, đổi tên nước từ Đại Cồ Việt thành Đại Việt","time":"1054","description":"Ngay sau khi lên ngôi, năm 1054, Lý Thánh Tông đã đổi tên nước từ Đại Cồ Việt thành Đại Việt"}
{"name":"Chiến tranh Việt-Chiêm, Đại Việt chiếm được 3 châu của Chiêm Thành","time":"1069","description":"Năm Giáp Thân (1044), Lý Thái Tông đã đánh Chiêm Thành với lý do nước này bỏ thông hiếu, phá quốc đô Phật Thệ và giết chúa Sạ Đẩu. Sang thời Lý Thánh Tông, năm 1065 - 1069, Chiêm Thành bỏ cống. Vua Thánh Tông lại đem quân Nam chinh. Nhưng một vài sử gia cho rằng tới giai đoạn lịch sử này cuộc đánh Chiêm chẳng phải riêng vì việc đoạn tuyệt giao hiếu, mà do Đại Việt bắt đầu thi hành chính sách mở rộng biên giới, dựa vào chỗ Chiêm Thành có tinh thần bất khuất chống đối đối với Đại Việt và lại lén lút thần phục nhà Tống. Ở triều bấy giờ Lý Thánh Tông giao cho Nguyên phi Ỷ Lan và Thái sư Lý Đạo Thành trông coi việc nước. Mùa xuân, tháng 2 năm Kỷ Dậu (1069), vua Lý Thánh Tông đích thân dẫn quân đi đánh Chiêm Thành. Vua Lý Thánh Tông đánh Chiêm Thành lâu lắm không hạ nổi, bèn đem quân trở về. Đi nửa đường đến châu Cư Liên, vua nghe thấy nhân dân khen bà Nguyên phi ở nhà giám quốc, trong nước được yên trị, Thánh Tông nói: Người đàn bà trị nước còn được như thế, mà mình đi đánh Chiêm Thành không thành công, thế ra đàn ông hèn lắm sao ? Vua Lý Thánh Tông quay trở lại đánh Chiêm. Lý Thường Kiệt đem quân theo phía Nam. Tháng tư quân Lý tiến đến biên giới Chân Lạp (Campuchia), qua các vùng Phan Rang, Phan Thiết ngày nay mà tiếng Chiêm gọi là Panduranga. Tháng 4, Lý Thường Kiệt bắt được vua Chế Củ ở biên giới Chân Lạp. Vua Chiêm vốn có cựu thù với nước Chân Lạp nên hết đường chạy phải ra hàng, kết quả là ông bị Lý Thường Kiệt cầm tù. Cuộc đuổi bắt vua Chế Củ mất hết một tháng."}
{"name":"Chiến tranh Tống-Việt","time":"1075–1077","description":"Ở phương bắc, nhà Tống từ khi thành lập (năm 960) đã phải khắc phục những hậu quả do thời kỳ chia cắt Ngũ Đại Thập Quốc để lại. Ngoài việc đánh dẹp các nước cát cứ, nhà Tống phải đối phó với nước Liêu lớn mạnh ở phương bắc - quốc gia của người Khiết Đan được vua nhà Hậu Tấn cắt cho 16 châu Yên Vân ở phía bắc từ năm 936 nên lãnh thổ bành trướng nhiều về phía Trung Quốc và thường nhân đó can thiệp vào Trung Nguyên. Đến thời Tống Thái Tông, dù dẹp hết các nước trong Thập quốc nhưng nguy cơ uy hiếp từ phía nhà Liêu vẫn luôn tiềm ẩn với nhà Tống. Sang thời Tống Nhân Tông, nhà Tống lại bị thêm sự uy hiếp của nước Tây Hạ của người Đảng Hạng phía tây bắc mới nổi. Nhà Tống phải cống nộp nhiều của cải và bị mất nhiều phần lãnh thổ cho Liêu và Tây Hạ. Trong nước, triều Tống bị rối loạn bởi những cải cách của Vương An Thạch. Chủ trương tiến đánh các nước phía nam Trung Quốc để giải tỏa các căng thẳng trở thành một chiến lược của nhà Tống. Năm 1072, vua Lý Thánh Tông qua đời, thái tử Càn Đức mới 7 tuổi lên thay, tức là vua Lý Nhân Tông. Thái phi Ỷ Lan làm nhiếp chính, được sự phò tá của các đại thần Lý Thường Kiệt, Lý Đạo Thành nên tình hình quốc gia vẫn khá ổn định. Thái úy Đại Việt là Lý Thường Kiệt chủ trương thực hiện một chiến lược đánh đòn phủ đầu[15] nên quyết định tập trung quân bắc tiến. Thời nhà Lý, giúp vua trị nước là 2 ban: ban Văn và ban Võ. Ban Văn phụ trách các mảng: giáo dục, thi cử, văn hóa, kinh tế, chính trị. Còn ban Võ thì chịu trách nhiệm về mảng quốc phòng và an ninh. Người đứng đầu ban Võ là Thái úy, tương đương với chức Bộ trưởng Bộ quốc phòng và Bộ trưởng Bộ Công an ngày nay. Năm 1073, Lý Thường Kiệt đã tập trung nhiều quân lính và vũ khí, lương thực, xe, ngựa, thuyền ở biên giới. Năm 1074, vua Tống được tin nhà Lý tụ binh, báo gấp cho Tô Giám, dặn rằng nếu Đại Việt tấn công Ung Châu thì phải kiểm quân cố thủ, không được khinh địch. Đại Việt tính rằng quân Tống có vào Đại Việt tất phải qua Ung Châu theo đường bộ và qua các cửa biển Khâm Châu và Liêm Châu theo đường thủy nên họ quyết tâm phá trước các cứ điểm này của người Tống. Đại Việt đã huy động hơn 10 vạn quân sang đánh phá căn cứ Ung Châu của Tống, bao gồm cả lực lượng chính quy của triều đình lẫn dân quân địa phương của các thủ lĩnh dân tộc thiểu số miền núi phía Bắc. Đạo quân của triều đình ở phía Đông do đích thân Thái úy Lý Thường Kiệt chỉ huy, gồm cả thủy quân xuất phát từ Móng Cái bằng thuyền độc mộc tiến vào đất Tống trong đêm tối nhằm tới châu Khâm. Còn đạo quân của các thủ lĩnh dân tộc thiểu số ở phía Tây đặt dưới sự chỉ huy của Tôn Đản chia làm 4 mũi tiến vào đất Tống: Lưu Kỷ từ Quảng Nguyên (Cao Bằng), Hoàng Kim Mãn từ Môn Châu (Đông Khê - Cao Bằng), Thân Cảnh Phúc từ Quang Lang (Lạng Sơn) và Vi Thủ An từ Tô Mậu (Quảng Ninh) nhắm tới châu Ung.[15] Đạo quân phía Tây sẽ dương Tây để đạo quân phía Đông bất ngờ kích Đông. Ngày 27 tháng 10 năm 1075, Vi Thủ An dẫn 700 quân từ Tô Mậu vào đánh Cổ Vạn, chiếm được trại Cổ Vạn. Tin tức đến tận ngày 21 tháng 12 mới tới được triều đình nhà Tống. Tiếp theo, các mũi quân phía Tây lần lượt đánh chiếm trại Vĩnh Bình, Thái Bình, các châu Tây Bình, châu Lộc, trại Hoành Sơn. Quân Tống bị thu hút vào phía Tây, nên lơ là phía Đông. Khi đạo quân phía Đông của Đại Việt tập kích, quân Tống đã không chống đỡ nổi. Ngày 30 tháng 12 năm 1075, châu Khâm bị chiếm. Ngày 2 tháng 1 năm 1076, châu Liêm thất thủ.[15] Sau đó, Lý Thường Kiệt dẫn quân đến châu Ung cùng đạo quân phía Tây quyết tâm hạ thành châu Ung. Từ ngày 10 tháng 12 năm 1075, cánh quân đầu tiên do Tông Đản chỉ huy đã kéo đến Ung Châu. Cánh quân chiếm được Khâm Châu tiến lên Ung Châu. Cánh chiếm được Liêm Châu tiến sang miền Đông Bắc chiếm châu Bạch.[16] Ngày 18 tháng 1 năm 1076, đạo quân của Lý Thường Kiệt cũng tới thành Ung châu. Một lực lượng cứu viện của Tống do Trương Thủ Tiết chỉ huy đã đi vòng theo đường Quý Châu tới Tân Châu rồi đến giữ ải Côn Lôn giữa châu Tân và châu Ung. Đến cách Ung 40 km thì lực lượng bị Lý Thường Kiệt cho quân đón đánh. Trương Thủ Tiết, Nguyên Dụ, Trương Biện, Hứa Dự, Vương Trấn là các chỉ huy của lực lượng viện binh nhà Tống đều bị giết tại trận. Thành Ung kiên cố lại có Tô Giám là tướng giỏi, nên quân Đại Việt đánh phá hơn 40 ngày không hạ được. Sau, quân Đại Việt bắt dân Tống, sai lấy túi đất đắp vào chân thành để leo lên đánh. Ngày 1 tháng 3 năm 1076, sau 42 ngày kiên cường kháng cự thành Ung thất thủ. Tô Giám tự sát.[17] Quân Đại Việt giết hết quân và dân trong thành, tổng cộng khoảng hơn 5 vạn người. Theo Tống sử: Cứ 100 thây chất làm một đống, cả thảy 580 đống. Quân Đại Việt tổn thất khoảng 1 vạn người. Lý Thường Kiệt ra lệnh tiêu hủy thành lũy, phá kho tàng dự trữ trong vùng Tả Giang và lấy đá lấp sông chặn đường cứu viện của quân Tống. Việc nhà Lý đánh các châu Liêm, Khâm và Ung đã thành công, tiêu diệt khoảng 7-10 vạn quân và dân nhà Tống, và bắt được hàng ngàn người Trung Quốc đem về Đại Việt làm nô lệ cùng với rất nhiều của cải (vàng, bạc, lụa, vũ khí,...). Sau khi hoàn thành được mục tiêu phá hủy toàn bộ các căn cứ hậu cần của đối phương, quan quân nhà Lý rút về nước. Sau chiến dịch đánh đòn phủ đầu thành công và rút quân về nước, Đại Việt chuẩn bị để đối phó với quân Tống sang đánh. Gián điệp Đại Việt đội lốt sư sãi dùng giấy tờ tu hành thu được ở Khâm, Liêm. Biết được, hoàng đế Tống ra lệnh cho lộ Quảng Tây đình việc cấp bằng cho các sư. Phía Đại Việt chuẩn bị lực lượng đánh gồm đánh chặn từ xa và tuyến phòng thủ sâu. Tướng Lý Kế Nguyên chịu trách nhiệm đánh đạo thủy quân của Tống. Còn Lý Thường Kiệt là tổng chỉ huy chung và trực tiếp chỉ huy đánh đạo quân bộ của đối phương. Để ngăn đạo lục quân Tống, Đại Việt bố trí hai tuyến phòng thủ - một ngay biên giới do các lực lượng của những thủ lĩnh dân tộc thiểu số chỉ huy và một ở bờ Nam sông Như Nguyệt (sông Cầu). Tuyến phòng thủ bờ Nam sông Như Nguyệt kéo dài khoảng 30 km suốt từ chân dãy núi Tam Đảo ngã ba sông Cà Lồ-sông Cầu tới Vạn Xuân (Phả Lại) lợi dụng các địa hình tự nhiên như bãi lầy, gò cao và cả các chiến lũy bằng đất, gỗ, rào tre. Ngày 8 tháng 1 năm 1077, Quách Quỳ và Triệu Tiết (趙禼) dẫn quân vượt qua ải Nam Quan tiến vào vùng Lạng Sơn ngày nay và đánh xuống phía kinh đô Thăng Long. Ngay từ đầu, quân Tống đã gặp phải sự chống cự hết sức mạnh mẽ của thổ binh do Thân Cảnh Phúc chỉ huy. Tiến công được vài chục dặm, quân Tống buộc phải tổ chức đột phá ải Quyết Lý. Tại đây Thân Cảnh Phúc đã bố trí mấy ngàn quân có cả voi chiến, để cố thủ cửa ải. Tư Kỷ chỉ huy đội tiền quân Tống cố sức công kích nhưng đều bị đẩy lùi. Quân Đại Việt dựa vào thế đất hiểm, có tổ chức phòng ngự vững chắc, đánh trả hết sức quyết liệt. Quách Quỳ buộc phải cử tướng Thế Cư chỉ huy một đạo tinh binh lên ứng chiến. Thấy cầm cự lâu không có lợi, Thân Cảnh Phúc đã chủ động lui quân về tuyến sau cố thủ cửa ải Chi Lăng. Biết ải Chi Lăng không những là đất hiểm mà còn được xây đắp kiên cố. Quân Tống cho một đội tiền quân tiến công vào chính diện. Còn hai đạo quân mạnh do Yên Đạt và Thế Cự chỉ huy đi vòng qua phía tây núi Cai Kinh, theo đường đất đánh bọc vào sau Chi Lăng, tạo nên thế hai mặt trước sau cùng đánh. Từ trên thành lũy và trên sườn núi cao, quân Đại Việt dùng nỏ và máy bắn đá bắn dữ dội vào đội hình xung phong của quân Tống, đồng thời tượng binh xông ra phản kích. Quân Tống bị thương vong rất nhiều. Nhưng lực lượng chênh lệch rất lớn, lợi dụng đêm tối Thân Cảnh Phúc đã chỉ huy quân rút theo đường tắt, lui về phòng giữ căn cứ Động Giáp, chuyển sang đánh du kích phía sau lưng quân Tống. Trong lúc đại quân của Quách Quỳ đang tiến công sang, thì đạo quân do Nhâm Khởi chỉ huy từ Vĩnh An đánh ngược lên Tô Mậu. Vị thủ lĩnh trấn giữ tại đây, chống cự không nổi, đầu hàng quân Tống. Nhâm Khởi cho quân theo hữu ngạn sông Lục Nam đánh xuống núi Nham Biền để trực tiếp bảo vệ sườn cánh trái của đạo quân Quách Quỳ. Đạo hữu quân do Khúc Trân[i] chỉ huy, từ Quảng Nguyên đánh xuống Môn Châu. Hoàng Kim Mãn trấn giữ châu này đầu hàng quân Tống, thành Môn Châu nhanh chóng bị mất. Đạo quân của phó tướng Triệu Tiết là một lực lượng đột kích chiến lược trên hướng thứ yếu, có sự yểm trợ trực tiếp của hữu quân Khúc Trân phía sườn phải, nhanh chóng vượt biên giới xuống Bình Gia, Vạn Nhai. Tại những nơi này quân Đại Việt chỉ có những lực lượng nhỏ án ngữ bởi thế Triệu Tiết nhanh chóng vượt qua, tiến thẳng xuống Nhã Nam và bến Như Nguyệt. Ngày 18 tháng 1, quân Tống tới bờ bắc sông Như Nguyệt, đối diện với tuyến phòng thủ chủ lực của quân Đại Việt. Quân Tống không đánh ngay mà đợi đạo thủy quân tới để hợp đồng tác chiến vượt sông. Trong khi chờ, đại quân Tống chia làm hai cánh. Cánh phía Tây do Triệu Tiết chỉ huy đóng tập trung ở vùng nay là Hiệp Hòa. Cánh phía Đông do Quách Quỳ chỉ huy đóng tập trung ở vùng nay có thể là thành phố Bắc Ninh. Ở giữa hai điểm tập trung trên, quân Tống còn chiếm một số vị trí là các gò cao. Chờ thủy quân không thấy, lục quân Tống quyết định tấn công. Quân Tống đã tổ chức 2 đợt tấn công lớn. Đợt thứ nhất đã chọc thủng được phòng tuyến của Đại Việt. Nhưng do tiến quân quá nhanh, lực lượng Tống thâm nhập khoảng 1.000-2.000 quân trở nên đơn độc và khi tiến đến vùng Sóc Sơn ngày nay thì bị quân Đại Việt vây đánh phải rút lui, chịu tốn thất khoảng 1.000 người. Đợt thứ hai, quân Tống đóng bè lớn để đưa quân sang bờ Nam sông Như Nguyệt, nhưng đợt nào sang cũng bị tiêu diệt gần hết. Quân Tống, sau 2 đợt tấn công thất bại đành tiếp tục đợi thủy quân đến. Sau 2 tháng, thấy quân Tống có dấu hiệu mệt mỏi, quân Đại Việt phản công. Ban đầu, quân Đại Việt tổ chức tấn công vào cánh của Quách Quỳ, song đã chịu thất bại. Hai quý tộc nhà Lý là Hoằng Chân và Chiêu Văn chỉ huy đợt tấn công này đều thiệt mạng. Sau thất bại này và nhận thấy quân Tống đang tập trung chú ý vào mặt trận phía Đông, quân Đại Việt liền tổ chức vượt sông đánh bất ngờ vào cánh quân phía Tây của Triệu Tiết. Trận này, quân Đại Việt thắng lớn. Trong khi quân Tống rối loạn vì cánh phía Tây bị tập kích, quân Đại Việt tiếp tục đổ bộ đánh vào cánh quân phía Đông. Sau khi giành được thắng lợi quân sự tại phòng tuyến Như Nguyệt, Đại Việt chủ động nghị hòa với quân Tống. Sứ thần Kiều Văn Ứng cho Quách Quỳ biết là vua Lý sẽ sai sứ sang xin tạ tội vì đã kéo quân đánh Khâm Châu và Liêm Châu và xin tiếp tục nộp cống. Ông cũng bào chữa việc đánh Tống trước là do Từ Bá Tường xúi giục. Tháng 3 năm 1077, Quách Quỳ rút quân về nước"}
{"name":"Lý Chiêu Hoàng nhường ngôi cho Trần Cảnh, thành lập nhà Trần","time":"1226 10 tháng 1","description":"Năm 1226, Chiêu Hoàng được Trần Thủ Độ sắp xếp nhường ngôi cho Trần Cảnh (Trần Thái Tông), triều đại nhà Lý cai trị Đại Việt hơn 200 năm đã chính thức kết thúc"}
{"name":"Chiến tranh Nguyên Mông–Đại Việt lần 1","time":"1258","description":"Vào năm 1206, Thành Cát Tư Hãn đã thành công trong việc thống nhất các bộ lạc Mông Cổ, từ đó Đế quốc Mông Cổ liên tục thực hiện nhiều cuộc chiến nhằm mở rộng đế quốc của mình. 50 năm sau, đến đời Đại hãn thứ 4, tức Mông Kha, ông đã tiến hành các chiến dịch tấn công nước Nam Tống (Trung Quốc). Mông Kha muốn đánh vào sườn nhà Tống thông qua việc cử em trai là Hốt Tất Liệt đánh Đại Lý. Đánh Đại Lý xong vào năm 1253, Hốt Tất Liệt trở về, ra lệnh cho Ngột Lương Hợp Thai ở lại đánh các nước chưa hàng phục. Đến năm 1257, việc chiếm Đại Việt nằm trong chiến lược tổng thể của quân đội Mông Cổ nhằm tiêu diệt Nam Tống. Bốn cánh quân Mông Cổ sẽ tấn công Nam Tống từ những địa điểm khác nhau từ phía Nam và phía Tây. Nắm quyền chỉ huy 3 cánh quân kia là Mông Kha, Hốt Tất Liệt và Tháp Sát Nhi. Cánh quân còn lại – cánh quân thứ tư, sau khi chiếm Đại Việt sẽ đánh thốc vào Nam Tống từ mạn cực Nam. Tổng chỉ huy của cánh quân thứ tư là Ngột Lương Hợp Thai. Đội quân của Ngột Lương Hợp Thai sau khi chiếm được Đại Lý, rồi đóng binh ở phía Bắc Đại Việt, sai hai sứ giả đến dụ hàng Đại Việt. Nhà Trần đã nhốt hai viên sứ giả vào ngục và trói bằng dây tre. Theo Nguyên sử: Ngột Lương Hợp Thai không thấy tin tức hai viên sứ giả này, bèn sai tướng là Triệt Triệt Đô cùng đem 3000 quân,[8] chia đường tiến binh tấn công Đại Việt. Tháng 8 năm 1257, chủ trại Quy Hóa[9] là Hà Khuất báo tin có sứ Nguyên sang. Vua Trần không nghe lời dụ hàng, xuống chiếu ra lệnh đem quân thủy bộ ra ngăn giữ biên giới, theo sự tiết chế của Trần Quốc Tuấn và truyền cả nước sắm sửa vũ khí. Ngột Lương Hợp Thai chia quân làm hai cánh, một cánh do mình chỉ huy và cánh quân còn lại do Triệt Triệt Đô chỉ huy, chia đường tiến xuống sông Thao ở vùng Kinh Bắc, Đại Việt. Viên tướng này dùng con trai là A Truật sang giúp và dòm ngó tình hình. Nhà Trần bày nhiều lớp phòng thủ, A Truật trở về báo, liền tiến quân đi gấp, sai Triệt Triệt Đô làm tiên phong, A Truật ở sau làm điện, đến tháng 12, 1257, hai đạo quân hợp lại với nhau. Đến tháng 12, 1257, quân đội Mông Cổ xâm lấn đồng Bình Lệ, vua Trần Thái Tông tự mình dẫn theo sáu đạo cấm quân (Thiên Thuộc, Thiên Chương, Thánh Dực, Chương Thánh, Thần Sách, Củng Thần), cộng thêm sương quân ở các địa phương gần kinh thành để chống lại. Quân Mông Cổ giáp trận quân Đại Việt do đích thân Trần Thái Tông (Trần Cảnh) ngự giá thân chinh chỉ huy tại Bình Lệ Nguyên (nay là huyện Bình Xuyên tỉnh Vĩnh Phúc). Đó là ngày 17 tháng 1 năm 1258. Quân đội nhà Trần bày tượng binh, kỵ binh và bộ binh bên bờ sông Hồng đợi giặc, tượng binh dàn hàng ngang tại tiền quân che chắn cho lớp bộ binh, kỵ binh phía sau, thủy quân dọc sông Hồng để có thể khi thua sẽ rút quân an toàn. Quân Mông Cổ chia làm ba đội để sang sông, Triệt Triệt Đô dẫn 5.000 quân làm quân tiên phong, Ngột Lương Hợp Thai cầm đại quân đi giữa, phò mã Hoài Đô và A Truật giữ hậu quân. Đội chủ lực của Ngột Lương Hợp Thai lấy những hàng binh Đại Lý dàn ở các hàng phía trước để làm bia đỡ hứng chịu thương vong, kỵ binh Mông Cổ đi phía sau để hỗ trợ và tung đòn quyết định. Nhưng Triệt Triệt Đô vừa qua sông đã ập lại đánh ngay. Trần Thái Tông tự làm tướng, đốc chiến đi trước xông pha tên đạn, sai tượng binh tiến ra giao chiến. Con Hợp Thai là A Truật (18 tuổi) ra lệnh cho kỵ binh bắn tên vào mắt voi, khiến voi đau và hoảng sợ, quay lại dày xéo đội hình quân Trần. Quân Trần nao núng, Trần Thái Tông ngoảnh trông hai bên, chỉ có tướng Lê Tần cưỡi ngựa một mình ra vào trận, sắc mặt không thay đổi. Lúc ấy, có người khuyên vua Trần dừng lại để chỉ huy chiến đấu. Lê Trần cố sức can vua: Nay thì bệ hạ chỉ đánh một ván dốc túi thôi! Hãy nên tạm lánh chúng, sao lại có thể dễ dàng tin lời người ta thế!. Bấy giờ, vua Trần mới lui quân đóng ở sông Lô, Lê Tần giữ phía sau. Quân Mông Cổ bắn loạn xạ, Lê Tần lấy ván thuyền che cho vua Trần khỏi trúng tên giặc. Thế quân Mông rất mạnh, do không chiếm được thuyền của Đại Việt, vua Trần vẫn bảo tồn được lực lượng và lui về giữ sông Thiên Mạc. Quân Trần thất lợi nhưng chủ động rút lui. Trần Thái Tông và tướng Lê Tần lui tới sách Cụ Bản, gặp tướng Phạm Cự Chích đem viện binh tới cứu. Quân Mông Cổ giết được Phạm Cự Chích, nhưng vua Trần đã chạy thoát ra bến Lãnh Mỹ, rồi xuôi thuyền về Phù Lỗ. Không bắt được bộ chỉ huy nhà Trần, Ngột Lương Hợp Thai nổi giận. Triệt Triệt Đô uống thuốc độc tự sát do không nghe lệnh, để vua Trần chạy thoát. Ngay ngày hôm sau, ngày 18 tháng 1 năm 1258, hai bên chạm trán một lần nữa tại Phù Lỗ, vua Trần đã chặt cầu Phù Lỗ từ trước. Hai bên đối mặt nhau qua một con sông (sông Cà Lồ) mà bày trận, quân Mông Cổ vẫn là người qua sông phá trận. Quân Mông muốn qua sông nhưng chưa dò được nông sâu, bèn men theo bờ sông bắn tên xuống nước, nghiệm chỗ nào tên bắn xuống mà không nổi lên tức là cạn, rồi dùng kị binh băng qua sông. Quân Trần vẫn tiếp tục thất lợi, nhưng một lần nữa họ lại chủ động rút lui. Sau đó, quân Trần lại chủ động rút khỏi Thăng Long. Chiếm được kinh đô chỉ sau hai trận đánh, nhưng kho tàng trống rỗng là vấn đề lớn đối với đội quân Mông Cổ. Những cuộc cướp bóc để kiếm lương ở vùng ngoại vi và phụ cận không có nhiều kết quả, quân Mông Cổ lâm vào tình trạng thiếu thốn lương thực. Nửa đêm ngày 28 tháng 1 năm 1258, từ nơi trú quân là Hoàng Giang,[17] Trần Thái Tông cùng Thái tử Trần Hoảng ngự lâu thuyền[2] ngược sông, bất ngờ đánh thẳng vào quân Mông Cổ.[18] Quân Mông Cổ cho rằng lực lượng quân Trần đã kiệt quệ sau trận thua đầu nên rất chủ quan, do đó khi bị tập kích đã không kịp trở tay, bị thua to. Sau khi bị phá tan tại Đông Bộ Đầu,[19] quân Mông Cổ không giữ nổi Thăng Long nữa. Chúng đồng loạt tháo chạy thẳng về Vân Nam. Như khi mới tiến quân vào, quân Mông Cổ rút chạy theo dọc sông Thao, nhưng theo con đường bộ ở phía tả ngạn. Quân Mông rút lui quá nhanh, ngoài cả dự tính của nhà Trần khiến vua Trần chưa kịp bố trí lực lượng đón đánh. Tuy nhiên khi đến Quy Hóa (vùng Lào Cai, Yên Bái), quân Mông bị chủ trại là Hà Bổng – một thổ quan người Tày - tập kích kịch liệt."}
{"name":"Hội nghị Bình Than, triệu họp vương hầu, trăm quan","time":"1282","description":"Hội nghị Bình Than được tổ chức vào tháng 10 âm lịch năm 1282 ở Bình Than. Đây là hội nghị của những người nắm giữ trọng trách lãnh đạo sự nghiệp giữ nước và chỉ bàn hai vấn đề thiết yếu nhất: đó là xác định phương hướng chiến lược chống xâm lăng và tổ chức bộ máy chỉ huy chống xâm lăng. Ở hội nghị Bình Than, vua Trần Nhân Tông và Thượng hoàng Trần Thánh Tông đã quyết định trao quyền Tổng chỉ huy quân đội cho Trần Quốc Tuấn; Nhân Huệ vương Trần Khánh Dư làm Phó đô tướng quân"}
{"name":"Hội nghị Diên Hồng, triệu họp bô lão cả nước","time":"1284","description":"Hội nghị diễn ra sau khi đế quốc Nguyên vừa tiêu diệt Nam Tống và đang ráo riết chuẩn bị chinh phạt Đại Việt. Hốt Tất Liệt, hoàng đế Đại Nguyên, đã nhiều lần ra yêu sách đòi các vua Trần sang chầu, nhưng đều bị cự tuyệt. Tham dự hội nghị này là các vị bô lão, đại diện cho nhân dân cả nước. Thượng hoàng đích thân ban yến và hỏi các vị bô lão là nên đánh hay nên hòa. Một đời thân phận thấp hèn, tay bùn chân lấm, nay bỗng dưng được triều đình mời vào tận hoàng cung để bàn quốc gia đại sự, tinh thần của các vị bô lão phấn chấn khác thường. Thượng hoàng triệu phụ lão trong nước họp ở thềm điện Diên Hồng, ban yến và hỏi kế đánh giặc. Các phụ lão điều nói đánh, muôn người cùng hô một tiếng, như bật ra từ một cửa miệng. Hội nghị Diên Hồng được xem như hội nghị dân chủ đầu tiên trong lịch sử Việt Nam."}
{"name":"Chiến tranh Nguyên Mông-Đại Việt lần 2","time":"1285","description":"Ngày 21 tháng 7 năm 1284, Hốt Tất Liệt phong con trai thứ 9 của mình tên Toghan (Thoát Hoan)[10] làm Trấn Nam vương. Ariq Qaya, viên tướng xuất sắc người Uigur của nhà Nguyên, được chọn làm phó cho Thoát Hoan, và được phong làm An Nam hành trung thư tỉnh tả thừa tướng. Các tướng lĩnh đáng chú ý khác của đội quân Nguyên là Lý Hằng - viên tướng xuất sắc người Tây Hạ của nhà Nguyên, Koncak (Khoan Triệt, người Uzbek), Bolqadar (Bột La Hợp Đáp Nhĩ), Satartai (Sát Tháp Nhi Đài), Mangqudai (Mãng Cổ Đái), Naqai (Nạp Hải), các tướng người Hán là Lý Bang Hiến, Tôn Hựu, Tôn Đức Lâm, Lưu Thế Anh, Lưu Khuê, Nghê Nhuận. Tổng cộng nhà Nguyên huy động tới 50 vạn người (một số nguồn khác cho rằng quân Nguyên đông khoảng 30 vạn). Đây là lần xuất chinh với quân số lớn nhất mà nhà Nguyên từng thực hiện, so với dân số thời đó thì đoàn quân này có quy mô cực lớn. Nhà Nguyên chia làm 3 đạo tiến đánh Đại Việt. Đạo chủ lực do Thoát Hoan và A Lý Hải Nha chỉ huy từ Ninh Minh tiến vào Lộc Châu (nay là Lộc Bình, Lạng Sơn). Ngày 27 tháng 1 năm 1285 (dương lịch), đạo quân này chia làm 2 mũi tiến quân, một do Bột La Hợp Đáp Nhĩ chỉ huy theo đường Khâu Ôn (nay là Ôn Châu, Lạng Sơn), một do Sát Tháp Nhi Đài và Lý Bang Hiến chỉ huy đi theo đường núi Cấp Lĩnh (tức là từ Lộc Bình đi Sơn Động ngày nay). Đại quân của Thoát Hoan đi sau mũi thứ hai của Sát Tháp Nhi Đài và Lý Bang Hiến.[20] Chống lại đạo quân thứ nhất này của quân Nguyên là lực lượng chủ lực của quân Trần do đích thân Trần Quốc Tuấn chỉ huy. Đạo thứ hai chỉ gồm hơn 1 nghìn quân Mông Cổ và Vân Nam do Nasirud Din từ Vân Nam vào Đại Việt qua vùng Tuyên Quang tiến theo sông Chảy. Vị chỉ huy quân Trần ở vùng này là Trần Nhật Duật. Đạo thứ ba là đạo quân đang chiến đấu ở Chiêm Thành do Toa Đô chỉ huy, tiến vào Đại Việt muộn hơn hai cánh trên, vào khoảng tháng 3 dương lịch, từ phía Nam. Trận giao chiến đầu tiên giữa hai bên là trận tại ải Khả Ly.[22] Tướng Nguyên đi mở đường là Tôn Hựu đã đánh tan được quân Trần và bắt được các tướng Đỗ Vĩ và Đỗ Hựu. Sau khi vượt qua ải Khả Ly, quân Nguyên tiến tiếp tới ải Động Bản.[23] Tại đây, quân Nguyên lại thắng, giết được tướng Trần Sâm của Đại Việt. Chỉ 5 ngày sau, đại quân của Thoát Hoan tiến xuống từ Lộc Châu, cùng cánh quân của Bột La Đáp Nhĩ tràn qua các ải Vĩnh Châu, Thiết Lược, Chi Lăng. Ngày 2 tháng 2 năm 1285, quân Nguyên chia làm 6 mũi ồ ạt tấn công ải Nội Bàng nơi quân Trần tập trung một lực lượng lớn và có đại bản doanh của Trần Quốc Tuấn. Quân Trần bị tổn thất nặng nề; tướng Đoàn Thai của Đại Việt bị bắt.[25] Trong khi đó, cánh quân của Bột La Đáp Nhĩ đã qua ải Chi Lăng. Trần Quốc Tuấn phải thu quân về Vạn Kiếp. Theo Đại Việt sử ký toàn thư, quân Trần đã tan vỡ; Trần Quốc Tuấn thoát được là nhờ có Yết Kiêu kiên quyết giữ thuyền đợi chủ tướng. Ngày 11 tháng 2, thủy quân Nguyên do Ô Mã Nhi chỉ huy tấn công vào Vạn Kiếp và các trại quân Trần ở Chí Linh. Đại kịch chiến đã xảy ra. Tướng Nguyên cấp vạn hộ[26] là Nghê Nhuận bị tử trận. Tuy nhiên, quân Trần đã quyết định rút lui để tránh thế giặc mạnh, thực hiện nghi binh khiến địch mệt mỏi rồi mới phản công. Ngày 14 tháng 2, Ô Mã Nhi đem quân vây quân của Trần Quốc Tuấn. Một trận thủy chiến lớn giữa 2 bên đã diễn ra. Vua Trần đã đem quân đến trợ chiến cho Trần Quốc Tuấn. Ô Mã Nhi đã không ngăn nổi quân Trần rút lui. Toàn bộ quân Trần rút khỏi Vạn Kiếp, Phả Lại, Bình Than về dàn trận bên bờ sông Hồng gần thành Thăng Long. Quân Nguyên tiến theo đường bộ về Thăng Long. Quân Nguyên từ Vạn Kiếp[28] đi theo đường qua Vũ Ninh,[29] Đông Ngạn.[30] Đến sông Đuống, các đơn vị quân Nguyên và quân Trần giáp chiến. Quân Trần bị thiệt hại nặng, nhiều thuyền lọt vào tay quân Nguyên. Ngày 17 tháng 2, quân Nguyên dựng trại bên sông Hồng. Quân Trần do vua Trần Nhân Tông trực tiếp chỉ huy cũng lập các chiến lũy bằng gỗ bên bờ Bắc sông Hồng nghênh chiến. Dưới sông là lực lượng thủy quân đông đảo của Đại Việt. Mục đích của quân Trần trong trận này chỉ là cản bước quân Nguyên để kịp hoàn thành công tác sơ tán hoàng gia và dân chúng khỏi kinh thành, thực hiện kế hoạch 'vườn không nhà trống', đồng thời sử dụng chiến lược 'Tiêu thổ', đốt sạch các làng và đồng ruộng gần kinh thành. Khi quân Nguyên tiến đến bờ sông, quân Trần đã dùng súng bắn đá bắn vào quân Nguyên và thách đánh. Tuy nhiên, đến chiều ngày 17 tháng 2, vua Trần sai Đỗ Khắc Chung sang doanh trại đối phương để giả đưa thư cầu hòa. Arig Qaya gửi thư cự tuyệt. Đỗ Khắc Chung ở lại doanh trại địch trinh sát đến sáng sớm hôm sau mới quay về. Liền sau đó, hai bên Nguyên-Việt đại chiến bên bờ sông Hồng. Sau khi thành Thăng Long đã trống không, quân Trần xuôi sông Hồng rút lui. Khi rút khỏi Thăng Long, quân Trần hãy còn rất đông. Quân Nguyên tiến đến đóng dưới chân thành một hôm rồi mới vào thành, chỉ thấy cung thất nhẵn không. Thoát Hoan khao quân trong cung thành, nhưng rồi lại sớm rút quân khỏi thành (hoặc có lẽ không phải, vì theo tục lệ của người Thát, sau khi chiếm được bất kỳ thành trì nào họ cũng không đóng quân trong thành mà tìm một bãi rộng để dựng trướng, trại, do thành Thăng Long quá sát sông Hồng nên có thể họ qua lại bên kia sông để lập trại), trở lại trại đã lập bên bờ Bắc sông Hồng.[33] Vừa đợi Toa Đô từ phía Nam tiến lên, Thoát Hoan vừa phái Koncak, Mangqudai, Bolqadar theo đường bộ, Lý Hằng, Ô Mã Nhi theo đường thủy đuổi theo vua Trần. Cánh quân của Nasirud Din đi theo sông Chảy tới trại Thu Vật[34] thì bị quân của Trần Nhật Duật chặn đánh. Tuy nhiên, do đại quân đều đã rút lui về Vạn Kiếp, nên Trần Nhật Duật cũng thu quân. Quân Nguyên một mặt đi dọc 2 bờ sông đuổi theo quân Trần, một mặt cử một đơn vị đi chặn đầu. Trần Nhật Duật phát hiện ra kế hoạch của quân Nguyên, nên ra lệnh bỏ thuyền lên bộ, rút lui an toàn về đến Bạch Hạc (Việt Trì) vào ngày 20 tháng 2 năm 1285. Sau đó, Trần Nhật Duật được điều vào mặt trận phía Nam ngăn Toa Đô. Vua Trần, triều đình, tông thất và đại quân rút lui theo đường sông Hồng về hướng phủ Thiên Trường (Nam Định). Quân Nguyên chia làm 2 đường thủy bộ đuổi theo. Để cản địch, quân Trần liên tiếp bố trí một số trận đánh trên sông Hồng. Trận đầu tiên là trận ở bãi Đà Mạc.[35] Quân Trần do Trần Bình Trọng chỉ huy đã chặn đánh quân Nguyên quyết liệt. Kết quả, 600 quân Thánh Dực ở đây đã kiềm chân được mấy ngàn quân Mông đang hăng máu. Qua 6 đợt tấn công, thiệt hại vô số, nhờ lực lượng chênh lệch quá lớn nên quân Nguyên mới phá được đội hình của quân Trần. Trần Bình Trọng bị bắt và hy sinh. Trận tiếp theo ở ải Hải Thị.[37] Quân Trần đã đóng cọc, đắp bờ chắn sông để ngăn đối phương. Tuy nhiên, quân Nguyên đã thủy bộ hợp đồng tác chiến, phá tan trận tuyến của quân Trần. Sau trận Hải Thị, quân Trần lui hẳn về đóng quân tại Thiên Trường (Nam Định) và Trường Yên (Ninh Bình). Đồng thời, phát hiện thấy quân Nguyên không đóng giữ Vạn Kiếp, Trần Quốc Tuấn cùng Phạm Ngũ Lão đã chỉ huy hơn 1 nghìn thuyền quay lại đóng ở Vạn Kiếp. Một thuộc tướng khác của Trần Quốc Tuấn là Nguyễn Lộc thực hiện tác chiến kiểu du kích rất mạnh ở vùng Vĩnh Bình. Ngay sau khi tập hợp lại lực lượng, quân Trần đã tiến hành phản công. Quân của vua Trần ngược sông Hồng lên giao chiến với quân Nguyên ở đoạn chảy qua huyện Lý Nhân ngày nay vào ngày 10 tháng 3 năm 1285, nhưng không thắng được, phải rút lui. Cuối tháng 2, đầu tháng 3 năm 1285, đạo quân của Toa Đô đánh ra vùng Bố Chính (Quảng Bình ngày nay) rồi tiến ra Nghệ An. Trần Nhật Duật và Trịnh Đình Toản chỉ huy quân Trần ngăn địch, nhưng thất bại, phải rút lui. Toa Đô phái một đơn vị đánh ra Thanh Hóa. Tướng nhà Trần giữ Thanh Hóa là Chương Hiến hầu Trần Kiện mang 1 vạn quân ra đón hàng cánh quân Nguyên này. Ngày 9 tháng 3, quân Nguyên được Trần Kiện dẫn đường đã đi qua Vệ Bố (Quảng Xương) đánh úp quân Trần, giết được các tướng Đinh Xa và Nguyễn Tất Thống. Ngày 13 tháng 3, quân Nguyên lại được Trần Kiện dẫn đường đánh quân của Trần Quang Khải, giết được 2 chỉ huy của quân Trần. Do Trần Kiện đầu hàng và dẫn đường cho quân Nguyên làm cho quân Trần ở đây đã không thể giữ nổi Nghệ An - Thanh Hóa, phải rút lui. Toa Đô tiến lên Thanh Hóa, sai con trai là Bách Gia Nô cùng các tướng Giảo Kỳ và Tangutai mang một cánh quân ra phối hợp với Thoát Hoan. Sau trận quân của vua Trần phản công quân Nguyên không thành và việc mặt trận Thanh-Nghệ bị tan vỡ, đại quân do vua Trần chỉ huy ở Thiên Trường và Trường Yên lâm vào thế bị ép từ 2 mặt Bắc-Nam. Để tìm cách hoãn binh, vua Trần sai Trần Dương đi sứ đến chỗ Thoát Hoan xin cầu hòa, và sai Đào Kiên mang công chúa An Tư là em út của Trần Thánh Tông đến cho Thoát Hoan. Thoát Hoan giam giữ Trần Dương và sai người đến đòi vua Trần đến gặp, nhưng vua Trần không nghe, tiếp tục mang quân rút chạy. Thoát Hoan mang quân đuổi theo. Tình hình đó khiến Trần Quốc Tuấn lại bỏ Vạn Kiếp đem thuyền về cứu vua Trần. Trần Hưng Đạo đưa 2 vua Trần từ Thiên Trường dùng thuyền nhỏ đi qua cửa Giao Hải (cửa sông Hồng ở huyện Xuân Thủy, Nam Định) đi ra biển, ngược lên phía bắc rồi quay vào Tam Trĩ Nguyên (tức cửa sông Ba Chẽ, huyện Ba Chẽ tỉnh Quảng Ninh). Từ Tam Trĩ, vua Trần sai đem thuyền rồng lớn ra cửa Ngọc Sơn (Vạn Ninh, Móng Cái) để lừa quân Nguyên. Lúc hai vua Trần chạy vào Thanh Hóa, nhiều quý tộc nhà Trần đã hàng quân Nguyên: ngoài Trần Kiện và Trần Tú Hoãn ở Thanh Hóa còn có hoàng tử Trần Ích Tắc, Trần Lộng, các tướng Phạm Cự Địa, Lê Diễn, Trịnh Long. Vua Trần rút vào Thanh Hóa để củng cố, tổ chức lại lực lượng. Trong lúc đó quân Nguyên của Thoát Hoan ở ngoài Bắc không hợp thủy thổ và thời tiết mùa hè nóng bức, bị mưa lớn, phát sinh bệnh tật, lại bị thiếu lương. Toa Đô mang quân mỏi mệt từ Thiên Trường, cùng Ô Mã Nhi lại vào Thanh Hóa truy kích vua Trần nhưng không tìm được, phải dừng lại kiếm lương. Lúc đó Thanh Hóa có cánh quân Toa Đô đóng giữ. Sau một thời gian không bắt được vua Trần, Toa Đô cùng Ô Mã Nhi mang quân trở lại phía bắc để phối hợp với Thoát Hoan. Trần Nhân Tông sai Trần Nhật Duật làm chánh tướng, Chiêu Thành Vương[54] và Trần Quốc Toản làm phó tướng đi cùng với Nguyễn Khoái mang 5 vạn quân ra bắc đánh quân Nguyên ở Hàm Tử. Trần Trọng Kim và Trần Xuân Sinh cho rằng Toa Đô đụng độ với Trần Nhật Duật ở Hàm Tử.[55] Hà Văn Tấn và Phạm Thị Tâm theo Đại Việt sử ký toàn thư cho rằng Trần Nhật Duật đánh một đạo quân Nguyên nhưng không rõ tướng chỉ huy. Nhưng các nguồn tài liệu đều thống nhất rằng trong quân Trần Nhật Duật có tướng người Trung Quốc của nhà Tống cũ là Triệu Trung theo hàng. Trần Nhật Duật gặp binh thuyền Toa Đô ở bến Hàm Tử, bèn chia quân ra đánh. Hai bên chống nhau ác liệt. Toa Đô đi đường xa, giao chiến lâu ngày đã mỏi mệt, trông thấy cờ hiệu Tống của Triệu Trung, lo lắng tưởng rằng nhà Tống đã khôi phục sang giúp Đại Việt. Nhóm quân người Hoa trong hàng ngũ quân Trần đều muốn trả thù nên đánh rất hăng. Trong khi đó quân Trần lại dùng kế ly gián, bắn tên gắn giấy sang bên quân Nguyên, nói rằng chỉ đánh người Thát Đát chứ không đánh người Hoa. Điều đó khiến nhiều tướng sĩ người Hoa trong quân Nguyên không tận lực chiến đấu hoặc trở giáo sang hàng quân Trần. Toa Đô bị thua to. Được ít ngày, Toa Đô biết tin quân Thoát Hoan đã thất bại và rút chạy, bèn lui về Tây Kết (Khoái Châu). Ngày 24 tháng 6 năm 1285, Trần Hưng Đạo trực tiếp chỉ huy quân đánh Toa Đô. Toa Đô và Ô Mã Nhi thua, bỏ thuyền đi đường bộ ra phía biển. Trên đường chạy, Toa Đô bị quân Đại Việt bao vây, sau cùng bị tướng Vũ Hải của nhà Trần chém đầu. Ô Mã Nhi thì chạy thoát về Thanh Hóa. Trần Nhật Duật sai Trần Quốc Toản về Thanh Hoá báo tin thắng trận. Trần Quốc Tuấn bàn với Trần Nhân Tông quyết định mang toàn quân ra bắc đánh Thoát Hoan để lấy lại Thăng Long. Trần Quang Khải ở Nghệ An mới ra được cử làm chánh tướng, Phạm Ngũ Lão và Trần Quốc Toản làm phó tướng; lại truyền lệnh cho Trần Nhật Duật phải ngăn không cho Toa Đô hợp binh được với Thoát Hoan. Trần Quang Khải tiến ra bắc khá thuận lợi. Quân Trần nhanh chóng diệt nhiều đồn nhỏ của quân Nguyên, kết hợp dụ hàng quân người Hoa bỏ hàng ngũ quân Nguyên. Trong khi đó thì Trần Nhật Duật cũng giữ lại số quân để cầm chân Toa Đô, còn chia một số sang hợp với cánh quân Trần Quang Khải. Nhiều toán quân Trần trước kia bị tản mát, chưa tìm được vào Thanh Hoá, lúc đó gặp quân Trần Quang Khải đã cùng gia nhập nên lực lượng càng mạnh lên. Quân Trần chiếm được nhiều thuyền của địch ở bến đò. Quân Trần tiếp tục ngược sông Hồng phản công quân Nguyên. Trần Quang Khải cùng Phạm Ngũ Lão và Trần Quốc Toản đã tấn công quân Nguyên ở Chương Dương (huyện Thường Tín).[58] Quân Nguyên thường thấy quân Trần bị thua, khi đó thấy quân Trần đánh mạnh nên bị bất ngờ, tan tác bỏ chạy. Phần lớn các chiến thuyền quân Nguyên bị quân Trần đốt cháy hoặc chiếm. Sau các trận phản công thắng lợi trên sông Hồng, quân Trần quyết định tấn công giải phóng kinh thành Thăng Long. Lực lượng tham gia gồm các đơn vị thủy bộ chủ lực do Trần Quang Khải chỉ huy. Các đơn vị dân binh các địa phương lân cận do Trần Thông, Nguyễn Khả Lạp và Nguyễn Truyền chỉ huy. Sau khi đánh bại đơn vị quân Nguyên ngoài thành do Mã Vinh chỉ huy, quân Trần bắt đầu bao vây và công thành. Toa Đô vẫn không biết rằng Thoát Hoan đã tháo chạy. Cánh quân Toa Đô đóng ở sông Thiên Mạc[62] và tìm cách liên lạc với Thoát Hoan. Được ít ngày, Toa Đô biết tin quân Thoát Hoan đã thất bại và rút chạy, bèn lui về Tây Kết. Ngày 24 tháng 6 năm 1285, quân Trần do đích thân vua Trần chỉ huy tấn công đạo quân Nguyên này. Tướng Nguyên là Trương Hiển (chức tổng quản) đầu hàng quân Trần và dẫn đường cho quân Trần tấn công Toa Đô ở Tây Kết. Quân Nguyên bị giết rất nhiều. Toa Đô cũng bị tử trận. Ô Mã Nhi và Lưu Khuê đi thuyền nhỏ trốn thoát ra biển. Ngày 10 tháng 6 năm 1285, Trần Quốc Tuấn và Hưng Ninh vương Trần Tung dẫn hơn 2 vạn quân tấn công quân Nguyên ở bờ Bắc sông Hồng. Quân Nguyên cử Lưu Thế Anh dẫn quân ra đối phó, nhưng đại bại. Quân Nguyên rút chạy về phía Bắc. "}
{"name":"Chiến tranh Nguyên Mông–Đại Việt lần 3","time":"1287–1288","description":"Sau thất bại trong việc chinh phạt Đại Việt năm 1285, hoàng đế nhà Nguyên là Hốt Tất Liệt vẫn không từ bỏ kế hoạch chiếm Đại Việt. Gần như ngay lập tức, kế hoạch tái chinh phạt được hoạch định. Ngày 21 tháng 8 năm 1285, Khu mật viện nhà Nguyên trình đề nghị tái chiến với Đại Việt. Ngày 3 tháng 9 âm lịch, Thoát Hoan khởi binh từ đất Ngạc tiến về phía nam, mượn tiếng đưa An Nam quốc vương Trần Ích Tắc về nước. Cánh quân Nguyên chủ lực do Thoát Hoan và Áo Lỗ Xích chỉ huy tập kết tại Tư Minh vào ngày 18 tháng 12 năm 1287 và bắt đầu vào lãnh thổ Việt Nam ngày 25 tháng 12 năm 1287. Tiến tới Lộc Châu (Lộc Bình, Lạng Sơn) ngày 29 tháng 12 thì Thoát Hoan chia quân làm 2 mũi, một mũi do Trình Bằng Phi và Bột Đa Cáp Đáp Nhĩ chỉ huy có 1 vạn quân người Hán đi từ Vĩnh Bình tới Chi Lăng và một mũi nữa gồm số quân còn lại đi từ Lộc Bình tới Sơn Động; lưu 2500 quân ở lại vận lương, vũ khí và binh phục. Thủy quân của Ô Mã Nhi và Phàn Tiếp chỉ huy xuất phát từ Khâm Châu tiến về vùng bờ biển Đông Bắc của Đại Việt. Ngày 17 tháng 12 năm 1287, lực lượng chiến đấu chính do Ô Mã Nhi chỉ huy tách khỏi lực lượng vận tải lương thực, vài ngày sau thì tiến vào cửa biển Vạn Ninh (Móng Cái) từ đó đi ven bờ tiến tới cửa sông Bạch Đằng và theo sông này tiến vào Vạn Kiếp. Gần như ngay khi đặt chân vào đất Đại Việt, quân Nguyên và quân Đại Việt đã giao chiến với nhau. Quân từ Vân Nam của Ái Lỗ giao chiến với 4 vạn quân của Trần Nhật Duật tại Bạch Hạc và giành thắng lợi, thu được một số thuyền và giết được Lê Thạch và Hà Anh của Đại Việt. Lực lượng thủy quân Nguyên không tiến vào Thanh - Nghệ rồi đánh ngược ra giống lần trước như nhà Trần dự định vì đã biết quân Trần đề phòng, trái lại tiến thẳng vào miền bắc để hợp binh với Thoát Hoan. Khi Ô Mã Nhi tiến tiến đến Quảng Yên thì giao chiến với quân của tướng Đại Việt là Trần Gia tại vụng Đa Mỗ (mũi Ngọc, Móng Cái). Trần Gia nỗ lực chống lại, chiếm được một số thuyền và đánh đắm vài thuyền lương đầu tiên. Phía Trần Gia cũng bị chết vài trăm người[6] và thế yếu hơn, cuối cùng phải rút lui. Đầu tháng chạp âm lịch, quân Trần tại khắp các đồn ải ở biên giới Lạng Sơn chống đỡ không nổi phải rút lui; một số nơi khác nghe tin thanh thế quân Nguyên quá lớn phải bỏ đồn rút trước khi quân Nguyên đến nơi. Thoát Hoan chia quân đánh chiếm núi Phả Lại và núi Chí Linh (Hải Dương), lập trại vững chắc để bố phòng. Thoát Hoan chiếm lấy Vạn Kiếp làm căn cứ đầu não, để ở đây 2 vạn quân, dựng thành gỗ trên núi ở Chí Linh và Phả Lại. Từ đây, quân Nguyên đánh rộng ra xung quanh và tiến về Thăng Long. Tại mặt trận tây bắc, đạo quân của Aí Lỗ từ Vân Nam theo dòng sông Thao và sông Lô đánh xuống. Quân của các chủ trại Tuyên Quang ra đánh chặn không nổi. Trần Nhật Duật vốn giữ mặt trận Lạng Sơn, sợ địch vào sâu bèn ra đóng ở Bạch Hạc để ngăn quân Aruq. Hai bên giao chiến tất cả 18 trận và cùng bị thiệt hại. Cuối tháng 1, quân Nguyên bắt đầu tiến đánh Thăng Long. Cánh quân Vân Nam của Aruq gặp đại quân Thoát Hoan ở bên bờ sông Hồng gần Thăng Long. Ngày 2 tháng 2 năm 1288, quân Nguyên bắt đầu đánh thành. Trần Quốc Tuấn dàn quân cố thủ. Quân Trần nấp trong thành bắn tên đạn ra. Quân Nguyên bao vây tấn công vài lần không có kết quả. Trần Quốc Tuấn sai Trần Cao vài lần đến trại Thoát Hoan xin giảng hoà, nhưng ban đêm thường kéo ra từng toán nhỏ đánh lén vào trại quân Nguyên, đốt phá lương thực rồi rút lui. Thoát Hoan điều quân ra ngoài truy kích, nhưng quân Trần thường ẩn nấp khó phát hiện ra. Sau khi thấy cầm chân quân Nguyên đã đủ lâu, Trần Quốc Tuấn rút về kinh thành, sai tướng rước vua Trần lui xuống hạ lưu sông Hồng rồi theo cửa Giao Thủy đi ra biển vòng lên Tháp Sơn (Đồ Sơn). Sau đó bị cánh quân Nguyên của Ô Mã Nhi đuổi quá gấp, thượng hoàng Thánh Tông và Nhân Tông phải xuống thuyền vào Thanh Hóa. Ô Mã Nhi mang vài chục thuyền và ít lương đuổi gấp theo, nhưng nghe tin có Lê Phụ Trần[cần dẫn nguồn] cầm một đạo thủy quân lớn đã phòng ở Thanh Hoá, liệu thế không đánh nổi đành quay trở lại. Qua Long Hưng, Ô Mã Nhi bực tức sai phá lăng Trần Thái Tông. Ô Mã Nhi và Phàn Tiếp vốn được giao cầm quân thủy mở đường cho đoàn thuyền lương của Trương Văn Hổ, Phí Củng Thìn theo sau. Sau khi đánh lui được quân Trần Gia, Ô Mã Nhi cho rằng thế quân Trần yếu không đáng lo, bèn tiến sâu vào nội địa để hội binh với Thoát Hoan và truy đuổi vua Trần. Đầu năm 1288, đoàn thuyền lương của Trương Văn Hổ kéo đến Vân Đồn, bị quân Trần Khánh Dư tập kích. Không có quân chủ lực bảo vệ, quân của Trương Văn Hổ mau chóng bị tiêu diệt. Văn Hổ cố gắng kéo vào đất liền nhưng đến Lục Thủy thì thuyền quân Trần đổ ra đánh càng đông. Hổ đại bại, đổ cả thóc xuống biển vì không muốn lọt vào tay quân Trần, rồi bỏ chạy về Quỳnh châu. Thuyền lương của Phí Củng Thìn kéo theo sau, mới đến Huệ châu đã gặp bão, trôi giạt tới Quỳnh châu. Đoàn thuyền lương do Từ Khánh chỉ huy thì đi lạc tới Chiêm Thành rồi quay trở lại Quảng Đông. Như vậy, các thuyền lương của quân Nguyên mất hoàn toàn. Trong khi Thoát Hoan vây đánh Thăng Long thì các tướng Nguyên ở Vạn Kiếp vẫn tiếp tục củng cố căn cứ này làm bản doanh; lập hành lang thông sang Trung Quốc để báo tin về nước, nhưng nhiều đồn trại qua các vùng núi thường bị quân Trần đánh phá và cô lập. Thoát Hoan vây đánh Thăng Long, chờ mãi không thấy thuyền lương của Trương Văn Hổ tới, bèn sai Ô Mã Nhi đi đón. Ô Mã Nhi khi đi tìm đoàn thuyền lương phải qua đây và đã bị tập kích ở cửa Văn Úc (ngày 10 tháng 2 năm 1288), và trên biển gần Tháp Sơn, bị thiệt hại nặng mà vẫn không thấy Trương Văn Hổ đâu, đành quay về Vạn Kiếp. Dọc đường về Vạn Kiếp, Ô Mã Nhi đã cướp được 4 vạn thạch gạo.[14] Các đơn vị của A Bát Xích cũng đã giao chiến với quân Trần tại Tháp Sơn và cũng cướp được 1,3 vạn thạch lương thực. Nhưng ngần đó lương thực cũng không thể đủ nuôi số lượng quân Nguyên quá đông trong một thời gian đủ dài. Ở Thăng Long mà không có lương thực, Thoát Hoan lúng túng. Đã vậy, quân Đại Việt đã phản công mạnh mẽ và kiểm soát vùng Hải Dương và Hải Phòng đẩy Thoát Hoan vào nguy cơ bị cắt đường về Vạn Kiếp. Trước tình hình như vậy, Thoát Hoan rút quân khỏi Thăng Long quay về Vạn Kiếp. Tại Vạn Kiếp, quân Nguyên cố thủ trong các thành gỗ nhưng thường xuyên bị quân Đại Việt tập kích vào ban đêm. Tình hình thiếu lương thực càng ngày càng trầm trọng. Tướng lĩnh quân Nguyên hoang mang, cùng nhau bàn bạc kế tiến thủ. Thoát Hoan quyết định rút quân khỏi Đại Việt. Lúc đó là vào khoảng cuối tháng 3 năm 1288, tức là chỉ 3 tháng sau khi tiến quân vào Đại Việt. Quân Nguyên chia làm 2 ngả rút về, một ngả của thủy quân do Ô Mã Nhi và Phàn Tiếp chỉ huy. Một ngả của bộ binh do Thoát Hoan chỉ huy. Để bảo vệ cho thủy quân rút lui, Trình Bằng Phi và Đạt Truật được Thoát Hoan phái đi hộ tống, nhưng bị chặn đánh liên tục phải quay về Vạn Kiếp đi cùng đại quân bộ.[16] Đoàn thuyền của Ô Mã Nhi không có bộ binh bảo vệ đã bị chặn đánh liên tục, mãi tới ngày 8 tháng 4 năm 1288 mới tiến tới Trúc Động định vào sông Giá. Tuy nhiên, quân Đại Việt đã ngăn được quân Nguyên vào sông Giá, khiến Ô Mã Nhi phải tiến vào sông Bạch Đằng.[17] Tại đây, quân Đại Việt bố trí một trận địa cọc ngầm. Một lực lượng lớn bộ binh Đại Việt lại trú tại Tràng Kênh chờ đánh vào sườn phải quân Nguyên khi họ vào sông Bạch Đằng, còn một lực lượng lớn nữa trú tại khu rừng bên tả ngạn sông sẽ đánh vào sườn trái đối phương. Thủy quân Đại Việt thì ẩn náu trên các sông khác thông với sông Bạch Đằng. Sáng ngày 9 tháng 4 năm 1288, thủy quân Nguyên tiến vào sông Bạch Đằng, thấy thủy quân Việt liền đuổi đánh, song va phải các cọc ngầm và bị chặn lại. Quân Đại Việt từ khắp các hướng đổ ra đánh. Đích thân vua Trần và Trần Hưng Đạo cầm quân tham chiến. Tướng quân Nguyễn Khoái thống lĩnh quân Thánh Dực dũng nghĩa, đội cấm binh tinh nhuệ nhất của Đại Việt từ hạ lưu đánh thẳng vào chính diện đội hình chiến thuyền Nguyên Mông. Đội thuyền đang giả thua cũng quay đầu lại đánh, chắn ngang đường ra biển. Từ các nhánh sông Chanh, sông Kênh, sông Giá, sông Thai, sông Điền Công… thủy quân Trần vốn mai phục sẵn từ trước nhất tề đổ ra đánh. Đồng thời hàng loạt các thuyền bè chở đầy chất cháy được đốt rồi lao thẳng vào thuyền quân Nguyên Mông. Từ hai bên bờ sông, cung tên, hỏa tiễn bắn ra liên tục. Thủy triều rút làm cho số thuyền bị cọc nhọn làm hư hại càng tăng. Cả đoàn thuyền bị ùn tắc, đám thuyền không vướng cọc thì cũng bị một đội thuyền của quân Trần chặn ngang từ phía hạ lưu, không sao thoát ra hướng biển được. Quân Nguyên bị hãm giữa trận, tiến thoái đều không được. Đến chiều, toàn bộ cánh quân thủy của quân Nguyên bị tiêu diệt. Tướng Nguyên là Trương Ngọc chết trong đám loạn quân. Tướng Trần là Đỗ Hành bắt được Ô Mã Nhi và Tích Lệ Cơ. Phàn Tiếp bị thương, nhảy xuống nước, bị quân Trần dùng câu liêm móc lên, bắt sống Siragi và Lý Thiên Hựu. Khoảng 6 vạn quân Nguyên chết hoặc bị bắt (gần như không thoát được ai), hàng trăm tàu thuyền bị chìm, hơn 400 chiến thuyền khác lọt vào tay quân Trần. Gần như toàn bộ thủy quân Nguyên bị tiêu diệt. Ngày 8 tháng 4 năm 1288, quân của Thoát Hoan từ Vạn Kiếp tiến lên Lạng Sơn. Abaci dẫn quân kỵ đi mở đường. Siktur được lệnh dẫn một cánh đi theo hướng Tây (qua Chi Lăng), nhưng đến Hãm Nê thì bị quân Đại Việt chặn đánh, đành trở lại nhập vào đoàn quân của Thoát Hoan. Ngày 11 tháng 4, đội quân Nguyên tiến tới cửa Nội Bàng (thị trấn Chũ và xã Bình Nội của Bắc Giang ngày nay) và lọt vào trận địa phục kích của quân Đại Việt. Quân Nguyên cố sức chống cự; Daraci và Lưu Thế Anh phải liều chết mở đường máu cho đại quân thoát khỏi cửa Nội Bàng. Thoát Hoan cùng Trình Bằng Phi chạy thoát về nước."}
{"name":"phát hành Thông Bảo hội sao theo chủ trương của Hồ Quý Ly, đây là tiền giấy đầu tiên của Việt Nam","time":"1396","description":"Việc đổi tiền được Hồ Quý Ly khởi xướng thực hiện từ trước khi nhà Hồ được chính thức thành lập (1400). Năm 1396, tháng 4, Hồ Quý Ly khi đó nắm toàn quyền điều hành nhà Trần bắt đầu phát tiền giấy Thông bảo hội sao. Cứ một quan tiền đồng đổi lấy một quan 2 tiền giấy. Cấm tuyệt tiền đồng, không được chứa lén, tiêu vụng, tất cả thu hết về kho Ngao Trì ở kinh thành và trị sở các xứ. Kẻ nào vi phạm cũng bị trị tội chết như làm tiền giả. Thể thức tiền giấy: tờ 10 đồng vẽ rong, tờ 30 đồng vẽ sóng, tờ một tiền vẽ mây, tờ 2 tiền vẽ rùa, tờ 3 tiền vẽ lân, tờ 5 tiền vẽ phượng, tờ một quan vẽ rồng. Kẻ làm tiền giả bị tội chết, ruộng đất, tài sản tịch thu."}
{"name":"Hồ Quý Ly ép Trần Thuận Tông dời đô về Tây Đô","time":"1397","description":"Năm 1394, Thượng hoàng băng, Lê Quý Ly nắm toàn bộ quyền bính, ép Thuận Tông dời đô từ Thăng Long về Tây Đô, đồng thời thực hiện một số cải cách về khoa cử, ruộng đất, tài chính."}
{"name":"Hồ Quý Ly lên ngôi, thành lập nhà Hồ, đổi tên nước thành Đại Ngu","time":"1400 22 tháng 3","description":"Năm 1400, Hồ Quý Ly chiếm ngôi nhà Trần, đặt quốc hiệu là Đại Ngu, chưa được 1 năm trao ngôi cho con và làm Thái thượng hoàng nhưng vẫn nắm đại quyền. Hồ Quý Ly đã đề ra những cải cách về hành chính, giáo dục khoa cử, kinh tế, quân sự, trong đó bao gồm việc phát hành tiền giấy và đã chuyển kinh đô từ Thăng Long về Thanh Hóa."}
{"name":"Chiến tranh Đại Ngu–Đại Minh","time":"1406–1407","description":"Nhà Minh đã gây sức ép lên nhà Hồ bằng các đòi hỏi về người, lương thực, đất đai, của cải,... nhưng nhà Hồ chỉ đáp ứng cho nhà Minh theo cách mà gây ít thiệt hại nhất cho họ. Đến tháng 4 năm 1406 nhà Minh lấy cớ đưa Trần Thiêm Bình, một người tự xưng là dòng dõi nhà Trần đã sang cầu cứu nhà Minh việc Hồ Quý Ly cướp ngôi nhà Trần, về Đại Ngu, họ mang quân đánh vào ải Lãnh Kinh. Đội quân này bị đánh bại, nhưng nhà Hồ đã mất bốn đại tướng chỉ huy quân các vệ. Ba tháng sau, nhà Minh huy động 215.000 quân, nói phao lên thành 80 vạn quân, chia làm 2 đường tấn công Đại Ngu. Đại Ngu đã không phòng thủ ở biên giới, mà tập trung phòng thủ ở bờ Nam sông Hồng. Quân Minh với sự dẫn đường của các ngụy quan đầu hàng người Việt đã đánh bại Đại Ngu ở trận Mộc Hoàn, sau đó là trận Đa Bang, chiếm được Đông Đô. Quân Minh tiếp tục đánh bại hoàn toàn quân chủ lực của Đại Ngu ở trận Hàm Tử, khiến cho nhà Hồ phải rút lui về Thanh Hóa, và bắt được cha con Hồ Quý Ly, Hồ Hán Thương vào tháng 6 năm 1407, nhà Hồ hoàn toàn chấm dứt."}
{"name":"Trần Ngỗi xưng Giản Định đế, lập nên nhà Hậu Trần","time":"1407 2 tháng 10","description":"Trần Ngỗi nguyên là con của Trần Nghệ Tông, vua thứ 9 nhà Trần. Năm 1400 nhà Hồ soán ngôi nhà Trần, đến năm 1407 nước Việt bị người Minh đô hộ. Trần Ngỗi về Mô Độ (Ninh Bình), do là hậu duệ vua Trần nên được thổ hào vùng này là Trần Triệu Cơ tôn làm hoàng đế (hiệu là Giản Định Đế), tụ tập quân khởi nghĩa nhằm đánh đuổi quân Minh, khôi phục nhà Trần (sử gọi là triều Hậu Trần). Ông cùng Quốc công Đặng Tất tiến quân ra Bắc, đánh bại quân Minh trong trận Bô Cô (1408). Sau đó, nhà vua muốn đánh thần tốc Đông Đô, nhưng Đặng Tất không theo, chia quân vây các thành giữa Bô Cô với Đông Đô. Giản Định Đế nghe lời ly gián, bèn giết Đặng Tất và Nguyễn Cảnh Chân; các con của 2 người này là Đặng Dung, Nguyễn Cảnh Dị bất bình vào Nghệ An lập Trần Quý Khoáng lên ngôi, tức Trùng Quang Đế. Quân Trùng Quang đế đánh úp bắt Giản Định đế về Nghệ An, Trùng Quang đế tôn ông làm Thái thượng hoàng. Không lâu sau, Thượng hoàng thua trận và bị quân Minh bắt giết."}
{"name":"khởi nghĩa Lam Sơn","time":"1418–1427","description":"Lê Lợi vốn là phụ đạo Lam Sơn (tên gọi thổ tù), nối đời làm hào trưởng Lam Sơn, trước từng theo vua Trùng Quang làm chức Kim ngô Tướng quân, sau Hoàng Phúc chiêu dụ đến cho làm Thổ quan Tuần kiểm, Lê Lợi không theo.[9] Ông ẩn thân ở núi rừng làm nghề cày cấy; tự mình đọc sách kinh sử, nhất là càng chuyên tâm về các sách Thao Lược; hậu đãi các tân khách; chiêu nạp kẻ trốn, kẻ làm phản; ngầm nuôi kẻ mưu trí; bỏ của, phát thóc để giúp cho kẻ côi cút, nghèo nàn; hậu lễ, nhún lời để thu nạp anh hùng hào kiệt; đều được lòng vui vẻ của họ. Những hào kiệt như Lê Văn An, Lê Văn Linh, Bùi Quang Thanh, Bùi Quốc Hưng, Lưu Nhân Chú, Trịnh Vô, Vũ Uy, Lê Liễu và Lê Xa Lôi nối tiếp đến quy phục. năm 1418 Lê Lợi khởi binh ở Lam Sơn, xưng là Bình Định vương, cử cháu là Lê Thạch làm Tướng quốc, truyền hịch đi các nơi cùng chống quân Minh. Mùa xuân năm Mậu Tuất (1418), Lê Lợi đã cùng những hào kiệt đồng chí hướng như Lê Văn An, Lê Sát, Lưu Nhân Chú, Nguyễn Lý... tất cả 50 tướng văn và tướng võ chính thức phất cờ khởi nghĩa Lam Sơn (trong đó 19 người đã từng tham gia hội thề Lũng Nhai năm 1416), xưng là Bình Định vương, kêu gọi dân Việt đồng lòng đứng lên đánh quân xâm lược nhà Minh cứu nước. Địa danh Lam Sơn nay thuộc huyện Thọ Xuân, tỉnh Thanh Hóa. Trong thời gian đầu, lực lượng của quân Lam Sơn chỉ có vài ngàn người, lương thực thiếu thốn, thường chỉ thắng được vài trận nhỏ và hay bị quân Minh do các tướng như Lý Bân, Phương Chính chỉ huy đánh bại. Bị quân Minh vây đánh nhiều trận, quân Lam Sơn khốn đốn 3 lần phải rút chạy lên núi Chí Linh những năm 1418, 1419, 1422 và một lần cố thủ ở Sách Khôi năm 1422. Một lần bị quân Minh vây gắt ở núi Chí Linh (có sách ghi năm 1418, có sách ghi năm 1419), quân sĩ hết lương, một nghĩa sĩ của Lê Lợi là Lê Lai theo gương Kỷ Tín nhà Tây Hán phải đóng giả làm Lê Lợi, dẫn quân ra ngoài nhử quân Minh. Quân Minh tưởng là bắt được chúa Lam Sơn nên lơi lỏng phòng bị, Lê Lợi và các tướng lĩnh thừa cơ mở đường khác chạy thoát. Lê Lai bị quân Minh giải về Đông Quan và bị giết. Ngoài quân Minh, Lê Lợi và quân Lam Sơn còn phải đối phó với một bộ phận các tù trưởng miền núi tại địa phương theo nhà Minh và quân nước Ai Lao (Lào) bị xúi giục hùa theo. Dù gặp nhiều khó khăn, quân Lam Sơn mấy lần đánh bại quân Ai Lao có lực lượng đông hơn. Tuy nhiên do lực lượng chưa đủ mạnh nên Lê Lợi thường cùng quân Lam Sơn phải ẩn náu trong rừng núi, nhiều lần phải ăn rau củ và măng tre lâu ngày; có lần ông phải giết cả voi và ngựa chiến của mình để cho tướng sĩ ăn. năm 1424, Lê Lợi quyết định đưa quân vào đồng bằng Nghệ An. Tiến vào Nghệ An là một bước ngoặt về chiến thuật trong cuộc khởi nghĩa Lam Sơn. Trên đường đi, quân Lam Sơn hạ thành Đa Căng (Bất Căng, Thọ Xuân) do Lương Nhữ Hốt giữ, đánh lui quân cứu viện của viên tù trưởng địa phương theo quân Minh là Cầm Bành. Sau đó quân Lam Sơn đánh thành Trà Lân. Tướng Minh là Trần Trí mang quân từ Nghệ An tới cứu Cầm Bành, bị quân Lam Sơn đánh lui. Lê Lợi vây Cầm Bành, Trần Trí đóng ngoài xa không dám cứu. Bị vây ngặt lâu ngày, Cầm Bành phải đầu hàng. Lê Lợi sai Đinh Liệt mang quân vào đánh Nghệ An, lại mang quân chủ lực cùng tiến vào, Trần Trí bị thua liền mấy trận phải rút vào thành cố thủ. Lý An, Phương Chính từ Đông Quan (Hà Nội ngày nay) vào cứu Trần Trí ở Nghệ An, Trí cũng mang quân ra ngoài đánh. Lê Lợi dùng kế nhử địch đến sông Độ Gia phá tan. Trần Trí chạy về Đông Quan, còn An và Chính lại chạy vào thành Nghệ An. Tháng 5 năm 1425, Lê Lợi lại sai Đinh Lễ đem quân ra đánh Diễn Châu, quân Minh thua chạy về Tây Đô (Thanh Hóa). Sau đó ông lại điều Lê Sát, Lưu Nhân Chú, Lê Triện tiếp ứng cho Đinh Lễ đánh ra Tây Đô, quân Minh ra đánh lại bị thua phải rút vào cố thủ trong thành. Lê Lợi một mặt siết vòng vây quanh thành Nghệ An và Tây Đô, mặt khác sai Trần Nguyên Hãn, Doãn Nỗ, Lê Đa Bồ đem quân vào nam đánh Tân Bình, Thuận Hóa. Tướng Minh là Nhậm Năng ra đánh bị phá tan. Sau Lê Lợi lại sai Lê Ngân, Lê Văn An mang thủy quân tiếp ứng cho Trần Nguyên Hãn chiếm đất Tân Bình, Thuận Hoá. Quân Minh phải rút vào cố thủ nốt. Như vậy đến cuối năm 1425, Lê Lợi làm chủ toàn bộ đất đai từ Thanh Hóa trở vào, các thành địch đều bị bao vây. Tháng 8 năm 1426, Lê Lợi chia quân cho các tướng làm 3 cánh Bắc tiến. Phạm Văn Xảo, Đỗ Bí, Trịnh Khả, Lê Triện ra phía Tây Bắc, Lưu Nhân Chú, Bùi Bị ra phía Đông Bắc, Đinh Lễ, Nguyễn Xí ra đánh Đông Quan. Viện quân từ Vân Nam do Vương An Lão chỉ huy kéo sang, nhưng bị Phạm Văn Xảo phá tan. An Lão chạy về cố thủ ở thành Tam Giang. Trần Trí thấy mất viện binh bèn cầu viện Lý An ở Nghệ An. Lý An và Phương Chính để Thái Phúc ở lại giữ thành Nghệ An, mang quân vượt biển ra cứu Đông Quan. Quân Lam Sơn định đón đường ngăn chặn nhưng không được. Lê Lợi liền giao cho Lê Văn An, Lê Văn Linh vây thành, còn mình kéo đại quân ra bắc. Để đối phó lại tình hình nguy cấp, năm 1426, nhà Minh cho huy động 20.000 quân từ nhiều tỉnh phía nam tiến vào tiếp viện. Các quan lại nhà Minh tại Việt Nam cũng được lệnh mộ thêm 30.000 thổ binh bản xứ hỗ trợ. Thêm vào đó, nhà Minh cho gửi thêm hỏa khí sang trợ chiến, và các tướng Minh tại Giao Chỉ cũng rút hết quân làm đồn điền (trồng lúa lấy lương - khoảng 8.000 thổ binh bản xứ) để đối phó với quân nổi dậy.[32][33] Trần Trí, Phương Chính bị cách chức, bị đặt dưới quyền Vương Thông sai khiến để lấy công chuộc tội. Tại Vân Nam, Mộc Thạnh cũng được lệnh tuyển mộ 15 ngàn bộ binh và 3 ngàn cung thủ chuẩn bị sẵn sàng.[34] Từ Quảng Tây, tướng Minh là Cố Hưng Tổ (Gu Xing-zu) được lệnh đưa 5.000 quân bản bộ sang tiếp ứng với Vương Thông. Vương Thông, Mã Anh mang quân sang tiếp viện, hợp với quân ở Đông Quan được 10 vạn, chia cho Phương Chính, Mã Kỳ ra chặn đánh quân Lam Sơn. Lê Triện, Đỗ Bí đánh bại Mã Kỳ ở Từ Liêm, lại đánh luôn cánh quân của Chính. Cả hai tướng thua chạy, về nhập với quân Vương Thông ở Cổ Sở. Lê Triện lại tiến đánh Vương Thông, nhưng Thông đã phòng bị, Triện bị thua phải rút về Cao Bộ, sai người cầu cứu Nguyễn Xí. Đinh Lễ, Nguyễn Xí đem quân đến đặt phục binh ở Tốt Động, Chúc Động (các địa danh này ngày nay đều thuộc huyện Chương Mỹ, Hà Nội)[38]. Nhân biết Vương Thông định chia đường đánh úp Lê Triện, hai tướng bèn tương kế tựu kế dụ Thông vào ổ mai phục Tốt Động[39]. Quân Vương Thông thua to, Trần Hiệp, Lý Lượng và 5 vạn quân bị giết, 1 vạn quân bị bắt sống. Thông cùng các tướng chạy về cố thủ ở Đông Quan. Cuối năm 1427, vua Minh Tuyên Tông điều viện binh cứu Thành Sơn hầu Vương Thông, sai An Viễn hầu Liễu Thăng mang 10 vạn quân tiến sang từ Quảng Tây; Chinh Nam tướng quân Thái phó Kiềm quốc công Mộc Thạnh mang 5 vạn quân từ Vân Nam kéo sang. Đây là hai tướng đã từng sang đánh Việt Nam thời nhà Hồ và nhà Hậu Trần. Theo các nhà nghiên cứu, con số 15 vạn của cả hai đạo quân có thể là nói cao lên, trên thực tế nếu cộng số các đạo quân điều động từ các nơi thì tổng số chỉ có khoảng gần 12 vạn quân và cánh quân chủ lực là của Liễu Thăng. Nghe tin có viện binh, nhiều tướng muốn đánh để hạ gấp thành Đông Quan. Tuy nhiên, theo ý kiến của Nguyễn Trãi, Lê Lợi cho rằng đánh thành là hạ sách vì quân trong thành đông, chưa thể lấy ngay được, nếu bị viện binh đánh kẹp vào thì nguy; do đó ông quyết định điều quân lên chặn đánh viện binh trước để nản lòng địch ở Đông Quan. Đầu tiên, ông ra lệnh dời người ở những vùng địch đi qua như Lạng Giang, Bắc Giang, Quy Hóa, Tuyên Quang, để đồng không để cô lập địch. Biết cánh Liễu Thăng là quân chủ lực, ông sai Lê Sát, Lưu Nhân Chú, Lê Văn Linh, Đinh Liệt mang quân phục ở Chi Lăng, lại sai Lê Văn An, Nguyễn Lý mang quân tiếp ứng. Đối với cánh quân Mộc Thạnh, ông biết Thạnh là viên tướng lão luyện, sẽ ngồi chờ thắng bại của Liễu Thăng mới hành động nên hạ lệnh cho Phạm Văn Xảo và Trịnh Khả cố thủ không đánh. Tướng trấn giữ biên giới là Trần Lựu liên tục giả cách thua chạy từ Ải Nam Quan về Ải Lưu rồi lại lui về Chi Lăng. Ngày 18 tháng 9 âm lịch, Liễu Thăng đuổi đến Chi Lăng. Trần Lựu lại thua, Thăng đắc thắng mang 100 quân kị đi trước. Ngày 20, Thăng bị phục binh của Lê Sát, Trần Lựu đổ ra chém chết. Tới tận ngày 25 tháng 12 năm 1427, vua Minh mới nhận được tin Liễu Thăng bị giết. Các tướng thừa dịp xông lên đánh địch, giết hơn 1 vạn quân, chém được Lương Minh, Lý Khánh tự vẫn. Tướng Minh còn lại Hoàng Phúc, Thôi Tụ cố kéo về thành Xương Giang thế thủ nhưng đến nơi mới biết thành đã bị quân Lam Sơn hạ, phải đóng quân ngoài đồng không. Lê Lợi sai Trần Nguyên Hãn chặn đường vận lương, sai Phạm Vấn, Nguyễn Xí tiếp ứng cho Lê Sát cùng sáp đánh, giết 5 vạn quân Minh ở Xương Giang. Hoàng Phúc, Thôi Tụ và hơn 3 vạn quân bị bắt. Do quyết tâm không quy hàng, Thôi Tụ bị giết. Hoàng Phúc bị bắt khi định chạy theo ngả Chi Lăng, y cùng quẫn định tự sát thì thuộc hạ quỳ xuống van xin ngăn lại, Lê Lợi biết chuyện khen ngợi, tới ngày 17 tháng 12 năm 1427 thì cho người thả về Trung Quốc theo đường Long Châu, tỉnh Quảng Tây. Mộc Thạnh đóng quân ở vùng ải Lê Hoa đến Lãnh Thủy câu (冷水溝), nghe tin Liễu Thăng thua to nên kinh hồn, bèn rút chạy. Vương Thông nghe tin hai đạo viện binh bị đánh tan, sợ hãi xin giảng hòa để rút quân. Lê Lợi đồng ý cho giảng hòa để quân Minh rút về nước. Ông cùng Vương Thông tiến hành làm lễ thề trong thành Đông Quan, hẹn đến tháng chạp âm lịch năm Đinh Mùi (1427) rút quân về."}
{"name":"Lê Lợi thành lập quốc gia Đại Việt, đặt kinh đô tại Đông Kinh","time":"1428 29 tháng 4","description":"Ngày 15 tháng 4 âm lịch năm 1428, Lê Lợi từ điện Tranh ở Bồ Đề vào thành Đông Quan, đại xá thiên hạ, đổi niên hiệu là Thuận Thiên, đặt quốc hiệu là Đại Việt, lấy Đông Kinh làm thủ đô, xưng là Thuận Thiên Thừa Vận Duệ Văn Anh Vũ Đại Vương, hiệu là Lam Sơn động chủ, sử gọi là Thái Tổ Cao Hoàng đế, dựng lên Hoàng triều Lê"}
{"name":"Vụ án Lệ Chi viên","time":"1442","description":"Ngày 27 tháng 7 (âm lịch) năm Nhâm Tuất (1442), vua Lê Thái Tông đi tuần ở miền Đông, duyệt quân ở thành Chí Linh, Hải Dương. Nguyễn Trãi đón vua ngự ở chùa Côn Sơn, nơi ở của Nguyễn Trãi. Ngày 4 tháng 8 (âm lịch) vua về đến Lệ Chi viên thuộc huyện Gia Định (nay thuộc thôn Đại Lai, xã Đại Lai, huyện Gia Bình, tỉnh Bắc Ninh). Cùng đi với vua có Nguyễn Thị Lộ, một người thiếp của Nguyễn Trãi khi ấy đã vào tuổi 40 (bà sinh năm 1400)[7] được vua Lê Thái Tông yêu quý vì sự xinh đẹp, có tài văn chương, luôn được vào hầu bên cạnh vua. Khi về đến Lệ Chi viên, vua thức suốt đêm với Nguyễn Thị Lộ rồi mất. Các quan bí mật đưa về, ngày 6 tháng 8 (âm lịch) mới đến kinh sư, nửa đêm vào đến cung mới phát tang. Triều đình đã quy cho Nguyễn Thị Lộ tội giết vua. Ngay sau khi Thái tử Bang Cơ mới 2 tuổi lên nối ngôi (tức là Lê Nhân Tông), triều đình bắt Nguyễn Trãi tru di tam tộc vào ngày 16 tháng 8 (âm lịch) năm này."}
{"name":"Chính biến Thiên Hưng, Lê Thánh Tông lên ngôi","time":"1459–1460","description":"Tháng 8 năm 1442, Lê Thái Tông đột ngột băng ở Lệ Chi Viên, cựu thần Nguyễn Trãi bị vu oan, chịu án tru di tam tộc. Thái tử Bang Cơ khi ấy mới 1 tuổi lên ngôi, tức Lê Nhân Tông, dưới sự bảo trợ của các đại thần là Trịnh Khả, Nguyễn Xí, Lê Thụ, Đinh Liệt, Lê Bôi. Thần phi Nguyễn Thị Anh lên ngôi Thái hậu nhiếp chính. Khi Lê Bang Cơ được lập làm Thái tử, nhiều người trong triều dị nghị rằng, Nguyễn Thị Anh đã có thai trước khi vào cung và Bang Cơ không phải là con vua Thái Tông[3]. Cùng lúc đó, Ngô Thị Ngọc Dao lại có mang sắp sinh. Nguyễn Thị Anh sợ chuyện bại lộ thì con mình sẽ mất ngôi lớn nên tìm cách hại bà Ngọc Dao[4]. Trong khi đó bà Ngọc Dao được vợ chồng Nguyễn Trãi và Nguyễn Thị Lộ hết sức che chở, mang đi nuôi giấu và sinh được hoàng tử Lê Tư Thành năm 1442. Đêm ngày 28 tháng 10 năm 1459, Lạng Sơn vương Lê Nghi Dân cùng Lê Đắc Ninh là chỉ huy sứ đội vệ binh trong cung làm nội ứng, cùng các thủ hạ tin cậy là Phạm Đồn, Phan Ban, Trần Lăng và hơn 100 quân (có giả thiết là 300 quân với sự tham gia của Ngô Trang[6]) ban đêm bắc thang chia làm ba đường vào cung cấm, giết chết vua Lê Nhân Tông. Hôm sau thì quân của Nghi Dân tru sát Thái hậu Nguyễn Thị Anh. Sau khi Nghi Dân lên ngôi, ông chủ yếu dùng các thuộc hạ tin cậy của mình làm vây cánh, triệt hạ một số cựu thần thân cận của Lê Nhân Tông. Lê Nghi Dân bị cáo buộc là tin dùng gian nịnh, giết hại bề tôi cũ, thay đổi pháp chế, không được lòng dân và các đại thần, văn võ[10]. Một nhóm các trọng thần là Lê Ê, Lê Thụ, Đỗ Bí, Lê Ngang muốn binh biến lật đổ vua Lê Nghi Dân nhưng việc bị bại lộ, tất cả đều bị giết. Sau vụ đảo chính không thành của Lê Ê, Nhập nội kiểm hiệu Á thượng hầu là Lê Lăng bàn mưu với Thái bảo Nguyễn Xí và Xa kỵ tổng tri Lê Niệm, Á hầu Lê Nhân Thuận, Quan phục hầu Trịnh Văn Thái, Điện tiền ty đô chỉ huy Nguyễn Đức Trung lật đổ Nghi Dân lần nữa. Ngày 6 tháng 6 âm lịch năm 1460, Lê Lăng, Nguyễn Xí phát động binh biến, chém bầy tôi thân cận của Nghi Dân là Phạm Đồn, Phan Ban ở nghị sự đường, nắm lấy cấm binh, đóng chặt cửa thành, sai Lê Ninh Thuận bắt vây cánh của vua Thiên Hưng hơn 100 người. Sau đó các đại thần giáng Nghi Dân làm Lệ Đức hầu. Lê Lăng cầm giải lụa đến chỗ Lệ Đức hầu bắt phải tự thắt cổ chết. Lê Nghi Dân bị lật đổ.  Các đại thần quyết định lập Gia vương Tư Thành. Hoàng tử Tư Thành được lên ngôi, tức là vua Lê Thánh Tông."}
{"name":"biên soạn Luật Hồng Đức","time":"1483","description":"năm 1483, vua Thánh Tông sai các đình thần sửa đổi, biên soạn lại các điều luật cũ, làm thành bộ Quốc triều Hình luật (còn gọi là Luật Hồng Đức). Bộ luật gồm 6 quyển, 722 điều, và được sử dụng suốt từ thời Hồng Đức đến hết thế kỷ XVIII."}
{"name":"Mạc Đăng Dung ép Lê Cung Hoàng nhường ngôi, lập lên nhà Mạc","time":"1527","description":"Tháng 4 năm 1527, Lê Cung Hoàng sai đình thần cầm cờ tiết đem kim sách, áo mão thêu rồng đen, đai dát ngọc, kiệu tía, quạt vẽ, lọng tía đến Cổ Trai, tấn phong Mạc Đăng Dung làm An Hưng vương, gia thêm cửu tích. Tháng 6 năm 1527, Mạc Đăng Dung từ Cổ Trai trở lại kinh đô ép Lê Cung Hoàng nhường ngôi. Mạc Đăng Dung lên ngôi, tức là vua Mạc Thái Tổ, chính thức lập ra Nhà Mạc."}
{"name":"Nguyễn Kim lập Lê Ninh làm vua, tái lập nhà Lê, đóng đô tại Vạn Lại","time":"1533","description":"Năm 1533, cựu thần nhà Lê gồm An Thanh hầu Nguyễn Kim, Hòa Trung hầu Lại Thế Vinh, Lỵ quốc công Trịnh Duy Thuận, Phúc Hưng hầu Trịnh Duy Duyệt và Tả Đô đốc Trịnh Duy Liệu dựng người con rốt của vua Lê Chiêu Tông tên Duy Ninh làm vua Trang Tông; lên ngôi vua tại Ai Lao, đặt niên hiệu là Nguyên Hòa."}
{"name":"Chiến tranh Lê–Mạc","time":"1533–1677","description":"Năm 1545, Nguyễn Kim bị hàng tướng Trung Hậu hầu Dương Chấp Nhất đầu độc giết chết. Con rể Nguyễn Kim là Đại tướng quân Dực quận công Trịnh Kiểm được Lê Trang Tông phong làm Thái sư Lượng quốc công, nắm quyền quân quốc trọng sự. Năm 1546, Mạc Hiến Tông chết, con là Phúc Nguyên còn nhỏ lên thay, tức là Mạc Tuyên Tông, chú là Khiêm Vương Mạc Kính Điển làm phụ chính. Bắc triều xảy ra biến loạn do bất đồng trong việc chọn người thừa kế nghiệp. Tướng Phạm Tử Nghi muốn lập con Mạc Thái Tổ là Hoằng Vương Mạc Chính Trung đã trưởng thành nhưng không được nên cùng Chính Trung khởi binh nổi loạn. Mạc Kính Điển phải vất vả đối phó tới năm 1551 mới dẹp được. Nhân sự tổn thất lực lượng của Bắc triều, Nam triều chiếm lại được Thanh Hóa và Nghệ An. Năm 1572, sau khi tướng Nam triều là Nguyễn Hoàng chiếm được Thuận Hóa, nhà Mạc mất hẳn phía nam và chỉ còn kiểm soát Bắc Bộ. Sau đó Nam triều cũng xảy ra biến loạn. Trịnh Kiểm mất (1570), hai con Tuấn Đức hầu Trịnh Cối và Phúc Lương hầu Trịnh Tùng tranh ngôi. Trịnh Tùng khống chế được vua Lê Anh Tông; Trịnh Cối yếu thế sang hàng nhà Mạc. Vua Anh Tông phong Trịnh Tùng làm Thái uý Trường quốc công, quản lĩnh việc quân quốc của Nam triều. Trong suốt những năm 1545-1580 là giai đoạn hai bên giằng co, chiến sự nổ ra chủ yếu tại Sơn Nam, Ninh Bình, Thanh Hóa - Nghệ An. Hai bên khi được khi thua. Ngoài vai trò của người phụ chính như Mạc Kính Điển và cha con Trịnh Kiểm, Trịnh Tùng, cuộc chiến đã nổi lên tên tuổi các danh tướng Nguyễn Quyện phía Bắc triều và Hoàng Đình Ái, Nguyễn Hữu Liêu phía Nam triều. Tháng 10 năm 1580, Mạc Kính Điển mất, em là Mạc Đôn Nhượng lên thay làm phụ chính. Lực lượng quân đội nhà Mạc suy yếu đi nhiều vì thiếu đi người chỉ huy có tầm cỡ và uy tín. Mạc Mậu Hợp từ nhỏ lên ngôi, khi lớn vẫn dựa vào các hoàng thân phụ chính, không chú trọng việc chính sự. Uy thế quân Mạc suy sút nhiều và thường bị thua trận. Đầu năm 1592, Trịnh Tùng thúc quân tổng tiến công ra bắc. Quân Mạc đại bại, chết rất nhiều. Cuối năm 1592, Trịnh Tùng lại tiến đánh Thăng Long. Cha con Mạc Mậu Hợp và Mạc Toàn thua chạy rồi lần lượt bị bắt và bị hành hình. Bắc triều chấm dứt. Nhà Hậu Lê chiếm lại được Thăng Long, việc trung hưng hoàn thành. Họ Mạc chạy lên Cao Bằng và cát cứ tới năm 1677."}
{"name":"Nguyễn Hoàng vào trấn thủ Thuận Hóa","time":"1558","description":"Nguyễn Hoàng (chữ Hán: 阮潢; 28 tháng 8, 1524 – 20 tháng 7 năm 1613) hay Nguyễn Thái Tổ, Chúa Tiên, là vị chúa Nguyễn đầu tiên, người đặt nền móng cho vương triều Nguyễn (1802 - 1945). Ông quê ở làng Gia Miêu, huyện Tống Sơn, phủ Hà Trung, xứ Thanh Hoa, ngày nay là Gia Miêu Ngoại Trang, thôn Gia Miêu, xã Hà Long, huyện Hà Trung, tỉnh Thanh Hóa. Ông nội (Nguyễn Hoằng Dụ) và cha ông (Nguyễn Kim) là những trọng thần của triều đình nhà Hậu Lê. Sau cái chết của cha ông là Nguyễn Kim, người anh rể là chúa Trịnh Kiểm nắm giữ quyền hành đã giết chết anh trai ông là Nguyễn Uông, Nguyễn Hoàng nhờ chị gái Nguyễn Thị Ngọc Bảo xin Trịnh Kiểm cho mình vào trấn thủ Thuận Hóa, Trịnh Kiểm chấp thuận."}
{"name":"Trịnh – Nguyễn phân tranh","time":"1627–1672","description":"Tháng 3 năm 1627, Trịnh Tráng khởi 20 vạn đại quân thủy bộ vào nam, cùng các tướng Nguyễn Khải, Lê Khuê chia làm hai đạo tiến vào, hội binh ở cửa Nhật Lệ. Phía Nguyễn cử các tướng Nguyễn Hữu Dật, Nguyễn Vệ, Nguyễn Phúc Trung đón đánh. Quân Trịnh chủ động tấn công nhưng không chọc thủng được tuyến phòng thủ của quân Nguyễn. Phía Nguyễn có lợi thế là đại bác kiểu Bồ Đào Nha nên làm quân Trịnh sợ chạy dạt. Hai tướng Trịnh là Nguyễn Khải và Lê Khuê đều thua chạy. Quân Trịnh rút về, Nguyễn Phúc Nguyên theo kế của Đào Duy Từ gấp rút xây lũy Trường Dục (Lũy Thầy) để phòng thủ. Năm 1633, Trịnh Tráng khởi binh nam tiến lần thứ hai, đóng ở cửa Nhật Lệ. Chúa Nguyễn cử Nguyễn Hữu Dật, Nguyễn Hữu Tiến làm tướng ra đánh. Trịnh Tráng đang đợi suốt hơn 10 hôm không thấy hiệu làm nội ứng của Anh thì bị quân Nguyễn đánh úp, quân Trịnh hoảng loạn tan vỡ bỏ chạy. Trịnh Tráng rút về bắc, để lại con rể là Nguyễn Khắc Liệt trấn thủ châu Bắc Bố Chính. Năm 1640, tướng Trịnh là Nguyễn Khắc Liệt mang quân đánh phá Nam Bố Chính rồi rút về. Chúa Nguyễn theo kế phản gián của Nguyễn Hữu Dật, viết thư cho Trịnh Tráng nói Liệt mưu thông đồng với chúa Nguyễn nên mặt ngoài gây chiến mà bên trong muốn hàng. Mặt khác, Nguyễn Phúc Lan thúc quân đánh Khắc Liệt. Khắc Liệt thua chạy, viết thư cầu cứu. Trịnh Tráng tin lời gièm của bên Nguyễn nên khi Liệt xin viện binh, Tráng điều Trịnh Kiều mang quân vào cứu, thực ra là để thay Liệt. Mất Bắc Bố Chính, năm 1643, Trịnh Tráng điều quân vào nam chiếm lại. Chúa Trịnh cử hai con là Tạc và Lệ đi tiên phong, cùng các tướng Phạm Công Trứ, Nguyễn Danh Thọ, Nguyễn Quang Minh. Quân Trịnh ồ ạt tiến công giết chết tướng Nguyễn là Bùi Công Thắng, chiếm lại Bắc Bố Chính, tiến lên đóng ở cửa Nhật Lệ. Sau khi hai con ra quân được một tháng, chúa Trịnh rước vua Lê Thần Tông cùng đi nam chinh. Hai bên đối trận chưa phân thắng bại, gặp lúc mùa hè, khí hậu oi bức, quân Trịnh bị bệnh nhiều nên Trịnh Tráng đành ra lệnh lui quân. Tháng 2 âm lịch năm 1648, Trịnh Tráng sai Lê Văn Hiểu khởi binh nam tiến lần thứ tư, dẫn bộ binh đánh Nam Bố Chính, còn thủy quân đánh cửa Nhật Lệ. Cha con Trương Phúc Phấn cố thủ ở lũy Trường Dục, quân Trịnh đánh không hạ được. Tháng 3 năm 1648, quân Nguyễn định vượt sông Gianh đánh ra Bắc Bố Chính thì nghe tin chúa Nguyễn ngã bệnh chết trên thuyền trên đường về Thuận Hóa nên phải lui binh. Con chúa Lan là Nguyễn Phúc Tần lên thay, tức là Hiền vương. Tháng 4 năm 1655, chúa Nguyễn sai Nguyễn Hữu Tiến, Nguyễn Hữu Dật mang quân vượt sông Gianh đánh Bắc Bố Chính. Tướng Trịnh là Phạm Tất Toàn đầu hàng. Tiến và Dật thừa thắng tiến lên đánh Hoành Sơn, Lê Hữu Đức thua chạy. Tiến và Dật đánh luôn Hà Trung, Lê Văn Hiểu thua chạy nốt, cùng Đức lui về giữ An Trường. Trịnh Thượng lãnh binh, tiến quân bộ vào huyện Kỳ Hoa, chia quân thủy tiến đến cửa Kỳ La. Hữu Tiến rút về nam sông Gianh. Trịnh Thượng thấy địch vô cớ rút, biết có mưu nhử nên không đuổi, đóng lại Lạc Xuyên, chia quân ra giữ Hà Trung. Hữu Tiến, Hữu Dật thấy địch không đuổi, liền chia quân thủy bộ đánh ra. Quân Trịnh hai cánh đều thua, quân thủy bỏ Kỳ La về Châu Nhai, quân bộ bỏ Lạc Xuyên về giữ An Trường. Thế là 7 huyện Nghệ An ở phía nam sông Lam là Kỳ Hoa, Thạch Hà, Thiên Lộc, Nghi Xuân, La Sơn, Hương Sơn, Thanh Chương về tay chúa Nguyễn. Trịnh Tráng giáng chức Thượng rồi cử con là Trịnh Tạc vào làm Thống lĩnh. Hữu Tiến thấy viện binh Trịnh bèn lui về giữ Hà Trung. Gặp lúc họ Mạc phía bắc quấy rối, Trịnh Tạc phải rút về bắc, để Đào Quang Nhiêu ở lại đóng ở An Trường, Vũ Văn Thiêm lãnh thủy quân đóng ở Khu Độc; Thân Văn Quang và Mẫn Văn Liên đóng ở Tiếp Vũ. Trịnh Tráng bèn cử con út là Trịnh Toàn vào cứu viện. Toàn đốc quân tiến đến Thạch Hà, sai Nhiêu và Dương Hồ tiến lên đóng ở Đại Nại và Hương Bộc, Văn Thiêm tiến lên cửa Châu Nhai (cửa khẩu sông Lam). Hữu Dật sai Nguyễn Cửu Kiều một lần nữa đánh tan Văn Thiêm, Thiêm lại bỏ chạy. Dật sang bờ sông Lam hợp binh với Kiều kéo đến Đại Nại. Quân bộ của Hữu Tiến đánh Nhiêu ở Hương Bộc, Trịnh Toàn mang quân đến cứu, đánh bại quân Nguyễn. Sau đó Toàn lại sang đánh quân Nguyễn ở Đại Nại, giết chết Cửu Kiều, quân Nguyễn thua to, chạy về Hà Trung. Toàn và Nhiêu cùng đuổi đến Tam Lộng lại bị Tiến và Dật đánh bại, phải rút về An Trường. Tháng 6 năm 1657, Trịnh Căn chia quân sai Hoàng Thể Giao, Lê Thì Hiến và Trịnh Thế Công vượt sông Lam đánh tướng Nguyễn là Tống Hữu Đại ở huyện Thanh Chương. Do có người tiết lộ, Hữu Tiến biết trước phòng bị nên quân Trịnh bị thua rút về bờ bắc sông Lam. Hai bên tạm hưu chiến cầm cự ở sông Lam, chỉ giao tranh những trận nhỏ. Tháng 6 năm 1658, tù trưởng Lang Công Chấn ở Quỳnh Lưu theo Nguyễn, mang quân đánh Trịnh, bị quân Trịnh đánh bại bắt được giải về Thăng Long. Tháng 7, quân Nguyễn vượt sông Lam thắng được Nguyễn Hữu Tá ở huyện Hưng Nguyên nhưng bị Lê Thì Hiến đánh bại phải rút về. Tháng 12, quân Trịnh đánh huyện Hương Sơn, thắng quân Nguyễn. Tháng 8 năm 1660, quân Trịnh lại đánh Nghi Xuân bị bại trận. Sau 1 năm nghỉ binh, nhân vừa thắng quân Nguyễn, tháng 10 năm 1661, Trịnh Tạc mang vua Lê Thần Tông cử đại binh vào nam, cử Trịnh Căn làm thống lĩnh cùng các tướng Hoàng Thể Giao, Đào Quang Nhiêu, Lê Thì Hiến vượt sông Gianh. Nguyễn Hữu Dật trấn thủ Nam Bố Chính chia quân đắp lũy thế thủ, quân Trịnh đánh mấy tháng không hạ được. Tháng 3 năm 1662, quân viễn chinh mệt mỏi, lương hết, chúa Trịnh bèn rút quân về bắc. Hữu Dật đuổi theo đến sông Gianh rồi rút về. Vua Lê Thần Tông rồi Lê Huyền Tông qua đời, Lê Gia Tông lên ngôi. Sau khi dứt được họ Mạc ở Cao Bằng (1667), năm 1672, chúa Trịnh lại cử binh nam tiến, sai Trịnh Căn lĩnh thủy binh, Lê Thì Hiến lĩnh bộ binh. Bên Nguyễn năm 1666, Nguyễn Hữu Tiến chết. Chúa Nguyễn cử em là Hiệp làm chủ tướng cùng Hữu Dật và Nguyễn Mỹ Đức ra chống cự, tự chúa Nguyễn ra tiếp ứng. Quân Trịnh hăng hái đánh lũy Trấn Ninh mấy lần suýt hạ được nhưng Hữu Dật cố sức chống đỡ. Quân Trịnh đánh mãi không thắng phải rút về Bắc Bố Chính, Trịnh Căn lại bị ốm nên Trịnh Tạc rút đại quân về kinh, cử Lê Thì Hiến, Lê Sĩ Triệt ở lại trấn thủ. Trước sau trong 46 năm ròng rã, hai bên Trịnh–Nguyễn đánh nhau lớn 7 lần và một số lần đánh nhau quy mô nhỏ hơn. Chiến trường chủ yếu ở hai bờ sông Gianh, vùng Nghệ An, Hà Tĩnh và Quảng Bình ngày nay. Hai bên đều có lợi thế và nhược điểm nên không thể tiêu diệt được nhau, tuy cùng mang khẩu hiệu "Phù Lê". Sau nhiều năm giao chiến, cả hai bên đều kiệt quệ về sức người sức của nên phải chấp nhận đình chiến, chia cắt lâu dài. Sông Gianh, sử sách hay gọi là Linh Giang, trở thành ranh giới chia nước Đại Việt thành Đàng Trong và Đàng Ngoài."}
{"name":"khởi nghĩa Tây Sơn","time":"1771","description":"Năm Tân Mão niên hiệu Cảnh Hưng thứ 32, Định Vương Nguyễn Phúc Thuần thứ 6, tức năm 1771, Nguyễn Nhạc được các người cùng hợp tác và các nhân sĩ đồng bào địa phương tôn làm Tây Sơn Vương. Quân Tây Sơn phát triển nhanh nhờ có được sự ủng hộ rất lớn của dân chúng quanh vùng, nhất là những người nông dân nghèo bị bần cùng hóa bởi tình trạng địa chủ chiếm đất và sưu cao thuế nặng của Chúa Nguyễn. Quân ngũ Tây Sơn khi dựng nghiệp có khoảng 150.000 người được chia thành 12 đơn vị, trong đó có 2 đơn vị là người dân tộc thiểu số. Đây là đội quân tiên phong, dũng mãnh dưới quyền chỉ huy của Nguyễn Huệ. Kỵ binh có hơn 2.000 chiến mã, tượng binh có hơn 100 thớt voi. Từ căn cứ Tây Sơn, nghĩa quân tiến xuống đồng bằng giải phóng các làng xã, các huyện lỵ. Bọn quan lại, cường hào, ác bá bị trừng trị. Của cải của chúng và lương thực của cải trong kho nhà nước phong kiến bị tịch thu chia cho dân nghèo. Mọi thứ thuế được tuyến bố bãi bỏ, nhữung người bị giam cầm trong nhà ngục được giải phóng. Nhân dân các địa phương nô nức tham gia khởi nghĩa, trong đó có cả các thương nhân ở các thành thị. Một số nho sĩ tiến bộ, một số quan lại, thổ hào lớp dưới đã sớm tham gia khởi nghĩa. Cuộc khởi nghĩa phát triển nhanh chóng với khí thế hết sức mạnh mẽ. Mùa thu năm 1773, nghĩa quân hạ thành Quy Nhơn rồi tiến ra chiếm Quảng Ngãi, tiến vào giải phóng Phú Yên, Bình Thuận. Sau khi điều đình tạm hoà hoãn với quân Trịnh ở mặt Bắc để tập trung diệt quân Nguyễn ở phía nam, liên tục các năm 1776, 1777, 1778, 1782, 1785, 5 lần quân Tây Sơn tiến công vào Gia Định. Cả 5 lần quân Nguyễn đều thất bại, lực lượng bị tan rã phải chạy trốn ra các hải đảo sang sống lưu vong bên đất Xiêm. Chính quyền họ Nguyễn cát cứ trên 200 năm bị đánh đổ. Phong trào Tây Sơn đã giải phóng hầu hết đất Đàng Trong. Sau khi đánh tan 5 vạn quân Xiêm can thiệp xâm lược, từ tháng 6/1786, quân Tây Sơn chuyển hoạt động ra hướng Bắc. Trong vòng 10 ngày, quân Tây Sơn do Nguyễn Huệ chỉ huy đã đánh tan 3 vạn quân Trịnh (mới vượt sông Gianh vào chiếm Phú Xuân của họ Nguyễn), giải phóng toàn bộ đất Đàng Trong. Thừa thắng, Nguyễn Huệ quyết định tiến quân ra Bắc. Tình hình Bắc Hà lúc này đang rối loạn. Chính quyền Lê - Trịnh mục nát cực độ. Binh lính thì đang tan rã, lưu manh hoá và nổi loạn. Quân Tây Sơn với hơn 1.000 chiến thuyền vượt biển đánh chiếm vùng Nam Định rồi tiến thẳng về giải phóng Thăng Long ngày 21/7/1786. Như thế chỉ chưa đầy một tháng, bằng cuộc tiến công vũ bão, quân Tây Sơn đã đập tan lực lượng quân sự của họ Trịnh, lật đổ chính quyền họ Trịnh tồn tại gần 300 năm, giải phóng Đàng Ngoài."}
{"name":"Nguyễn Huệ phá tan quân Xiêm tại Rạch Gầm – Xoài Mút","time":"1785 19 tháng 1 – 20 tháng 1","description":"Tháng 7 năm 1784, thủy quân Xiêm đổ bộ lên đánh lấy Rạch Giá (thuộc đạo Kiên Giang), tiến đánh quân Tây Sơn của Đô đốc Nguyễn Hóa ở Trấn Giang (Cần Thơ), tiến chiếm các miền Ba Thắc (Srok Pra-sak, Sóc Trăng), Trà Ôn, Sa Đéc, Mân Thít (hay Mang thít, Man Thiết) rồi chia quân đóng giữ. Tướng Tây Sơn là Trương Văn Đa liền đem quân thủy từ Gia Định tiến xuống Long Hồ (Vĩnh Long) để cản ngăn. Sau khi bí mật cho quân và tàu chiến ẩn náu ở các nơi hiểm yếu, Nguyễn Huệ lệnh cho quân đến khiêu khích. Lập tức, Chiêu Tăng giao Sạ Uyển ở lại giữ đại bản doanh, cử Lục Cổn dẫn bộ binh men theo tả ngạn sông Tiền để cùng phối họp; còn ông cùng với tướng tiên phong là Chiêu Sương, dẫn hàng trăm thuyền chiến tiến xuống Mỹ Tho, nơi đặt đại bản doanh của Tây Sơn. Đêm ngày 18 tháng 1 năm 1785 (ngày 8 tháng Chạp năm Giáp Thìn), lợi dụng con nước đang xuôi, cả hai đạo thủy bộ quân Xiêm cùng rầm rộ tấn công. Đến khoảng đầu canh năm ngày 19 tháng 1 năm 1785, đoàn thuyền chiến của địch lọt vào trận địa mai phục của quân Tây Sơn ở Rạch Gầm-Xoài Mút, tức thì pháo lệnh tấn công của Tây Sơn nổ vang. Mở đầu trận đánh, hai đội thủy binh Tây Sơn từ Rạch Gầm, Xoài Mút bất ngờ lao ra, chặn đánh hai đầu, dồn quân địch vào vòng vây đã bố trí sẵn. Đồng thời, từ hai bờ sông Tiền (đoạn Rạch Gầm-Xoài Mút) và dọc bờ cù lao Thới Sơn, bãi Tôn, cồn Bà Kiểu, Rừng Dừa... các đại bác cùng pháo hỏa hổ của bộ binh Tây Sơn bắn ra dữ dội vào khúc giữa đoàn thuyền địch lúc bây giờ đang bị ùn lại. Đồng loạt, đoàn thuyền Tây Sơn từ Rạch Gầm, Xồi Mút từ trong những nhánh rạch nhỏ chảy quanh các cồn bãi, nhanh chóng kéo ra chặn đánh đầu. Một đoàn thuyền Tây Sơn khác ẩn náu sau cù lao Thới Sơn, xông ra đánh mạnh vào hông (nhằm chia cắt đội hình) và đánh chặn đường lui, dồn đoàn thuyền của đối phương vào thế tiến thoái lưỡng nan. Cùng lúc ấy, quân Tây Sơn, cho những thuyền nhẹ chở đầy những vật liệu dễ cháy đâm thẳng vào những chiến thuyền đang rối loạn làm cho số bị chìm, số bị cháy. Trời vừa rạng sáng, thì chiến cuộc cũng vừa dứt. Kết quả là 300 chiến thuyền và 2 vạn thủy binh của Xiêm cùng một số quân của chúa Nguyễn, không đầy một ngày, đã bị quân Tây Sơn phá tan. Hai tướng Chiêu Tăng, Chiêu Sương chạy trốn về Sa Đéc, bị truy kích, lại hối hả cùng Sa Uyển dẫn vài nghìn tàn quân chạy bộ sang Chân Lạp rồi về Xiêm ."}
{"name":"Quang Trung đại phá quân Thanh","time":"1789","description":"Càn Long muốn nhân cơ hội đánh chiếm Đại Việt bèn sai Tổng đốc Lưỡng Quảng là Tôn Sĩ Nghị mang khoảng 29 vạn quân và dân binh gồm các đạo binh huy động từ Quảng Đông, Quảng Tây, Vân Nam và Quý Châu hộ tống Lê Chiêu Thống về Đại Việt với danh nghĩa phù Lê. Khi quân Thanh tiến qua biên giới, quân lính Tây Sơn bỏ trốn hết khiến viên trấn thủ của Tây Sơn là Phan Khải Đức phải đầu hàng[21] Theo thư Lê Chiêu Thống gửi cho Tôn Sĩ Nghị, tổng số quân Tây Sơn đóng ở miền Bắc khoảng 60 ngàn quân, trong đó có 30 ngàn quân do bắt lính tại địa phương, không có lòng chiến đấu. Ngô Văn Sở được tin quân Thanh kéo sang liền nhóm họp các văn võ quan nhà Lê Trung Hưng đưa một bức thư ký tên Giám Quốc Sùng Nhượng Công, Lê Duy Cẩn sang xin hoãn binh với Tôn Sĩ Nghị. Rồi các tướng Tây Sơn mở cuộc thảo luận. Ngày 21 tháng 11 năm Mậu Thân (1788), thành Thăng Long bỏ ngỏ, quân của Nghị vào đóng và tướng doanh của Nghị đặt tại Tây Long Cung. Theo lời vua Thanh dặn, Sĩ Nghị lấy xong thành này rồi trao ấn cho Duy Kỳ, tấn phong làm An Nam quốc vương lấy lòng dân Đại Việt.[22]. Ngày 22, Sĩ Nghị làm lễ ở điện Kính Thiên để làm lễ sách phong cho vua Lê Chiêu Thống. Bốn ngày từ khi xuất phát tại Biện Sơn, ngày 24 tháng 11, đô đốc Tuyết vào tới Phú Xuân cấp báo với Bắc Bình vương Nguyễn Huệ. Để lấy danh nghĩa chính thống, Nguyễn Huệ quyết định lên ngôi Hoàng đế. Nguyễn Huệ tức tốc cho lập đàn Nam Giao ở núi Bân (cạnh núi Ngự Bình) làm lễ tế trời đất, tuyên bố lên ngôi Hoàng đế, lấy niên hiệu Quang Trung. Ngày 29 tháng 11, quân Tây Sơn đến Nghệ An, đóng lại hơn 10 ngày để tuyển thêm quân. Đêm trừ tịch (30 tết), từ phòng tuyến Tam Điệp, quân Tây Sơn xuất phát. Đạo quân do Quang Trung chỉ huy vượt sông Giao Thủy đánh đồn Gián Khẩu của quân cần vương nhà Lê. Quân Lê tan vỡ, Hoàng Phùng Tứ bỏ chạy. Do đạo quân Tây Sơn hành quân nhanh và các đám quân do thám bị bắt, quân Thanh từ đồn Hà Hồi tới Thăng Long không biết gì về cử động của quân Tây Sơn. Ngày 3 tháng Giêng, quân Tây Sơn tiến đến Hà Hồi cách Thăng Long khoảng 20 km. Quang Trung cho quân vây chặt đồn rồi sai bắc loa kêu gọi quân Thanh đầu hàng. Quân Thanh bị bất ngờ trước sự áp sát quá nhanh của quân Tây Sơn, không kịp kháng cự, đều ra hàng. Mờ sáng ngày mồng 5 Tết, quân Tây Sơn do đích thân Vua Quang Trung chỉ huy đánh một trận hỏa công, thiêu cháy hoàn toàn đồn Ngọc Hồi của quân giặc, mở đường tiến thẳng vào thành Thăng Long. Một bộ phận còn lại của giặc tháo chạy đến Đầm Mực (thuộc xã Quỳnh Đô, nay là thôn Quỳnh Đô, xã Vĩnh Quỳnh, huyện Thanh Trì) thì bị cánh quân của Đô đốc Bảo mai phục sẵn, biến mấy chục mẫu Đầm Mực thành mồ chôn hàng vạn quân Thanh. Cùng mờ sáng mồng 5 Tết Kỷ Dậu, cánh quân của Đô đốc Long chỉ huy theo đường núi tiến ra tập kích đồn Khương Thượng (tức đồn Đống Đa) phá vỡ đồn Khương Thượng rồi qua ô Thịnh Quang (nay là ô Chợ Dừa) thọc sâu vào thành Thăng Long, lao thẳng tới Đại bản doanh của chủ tướng giặc Tôn Sĩ Nghị ở Cung Tây Long. Tôn thất trận, bỏ chạy qua cầu phao, rút về nước. Cầu bị gãy vì quá tải, hàng ngàn quân bị đẩy xuống sông mà chết. Chiều mồng 5 tết (tức 30 tháng 1 năm 1789[41]), Quang Trung và đô đốc Bảo tiến vào Thăng Long trong sự chào đón của nhân dân, đô đốc Long ra đón rước vào thành."}
{"name":"Nguyễn Ánh đánh bại nhà Tây Sơn, lên ngôi vua, đặt niên hiệu là Gia Long, lập lên nhà Nguyễn, đặt kinh đô tại Phú Xuân","time":"1802","description":"Tháng 7-1792, Nguyễn Ánh tiến đánh Quy Nhơn và đã triệt hạ gần như toàn bộ căn cứ thủy quân của Nguyễn Nhạc đóng tại Thị Nại. Hay tin này, vua Quang Trung quyết định thực hiện một chiến dịch quân sự lớn theo 2 đường thủy - bộ nhằm tiêu diệt tận gốc thế lực của Nguyễn Ánh. Trong lúc kế hoạch tác chiến đang triển khai thì vua Quang Trung đột ngột băng hà vào ngày 16-9-1792. Vua mới là Quang Toản (tức Cảnh Thịnh) tin dùng nịnh thần nên xảy ra mâu thuẫn, nghi kỵ lẫn nhau làm cho nhà Tây Sơn nhanh chóng bị suy yếu. Nhân cơ hội này, Nguyễn Ánh tổ chức tấn công Quy Nhơn vào năm 1793. Nguyễn Nhạc cho người ra Phú Xuân cầu cứu. Vua Cảnh Thịnh sai Ngô Văn Sở, Phạm Công Hưng đưa 17.000 quân và 80 thớt voi vào đánh lui quân Nguyễn Ánh. Năm 1795, nhà Tây Sơn xảy ra biến loạn, một số đại thần bị giết, số khác bị tước hết binh quyền nên Nguyễn Ánh lại tiếp tục động binh. Năm 1800, Nguyễn Ánh chiếm được thành Quy Nhơn. Vua Cảnh Thịnh sai Trần Quang Diệu và Võ Văn Dũng đưa quân chủ lực vào tái chiếm. Quân Tây Sơn và quân Nguyễn Ánh đánh nhau tại Quy Nhơn kéo dài gần 1 năm bất phân thắng bại. Trong khi thế trận đang giằng co thì Nguyễn Ánh bí mật đưa một cánh quân vượt biển đánh ra Phú Xuân vào năm 1801. Vua Quang Toản đưa quân chống cự nhưng bị thua trận phải bỏ kinh thành chạy ra Bắc. Năm 1802, quân Tây Sơn chiếm được thành Quy Nhơn thì Nguyễn Ánh cũng đã tiến đến đất Nghệ An. Trần Quang Diệu và Võ Văn Dũng mang quân ra cứu nhưng bị thất bại. Giữa năm 1802, Nguyễn Ánh chiếm được Thăng Long, vua Cảnh Thịnh bị bắt sống, gia tộc Tây Sơn và các tướng lĩnh bị trả thù man rợ... Sau đó, Nguyễn Ánh sai sứ sang cầu xin nhà Thanh phong cho mình làm An Nam quốc vương thay thế nhà Tây Sơn. Tháng giêng năm 1804, Nguyễn Ánh nhận sắc phong của nhà Thanh, đến tháng 2 đổi quốc hiệu là Việt Nam."}
{"name":"Chiến tranh Pháp-Đại Nam","time":"1858–1884","description":""}
{"name":"nhà Nguyễn cắt Nam Kỳ lục tỉnh nhượng cho Pháp","time":"1867","description":""}
{"name":"Hòa ước Giáp Thân, kết thúc Chiến tranh Pháp–Đại Nam, triều đình nhà Nguyễn chấp nhận sự bảo hộ của Pháp","time":"1884 6 tháng 6","description":""}
{"name":"phong trào Cần Vương","time":"1885–1895","description":"Phong trào giải phóng dân tộc Việt Nam (1885-1945)"}
{"name":"thực dân Pháp thành lập Liên bang Đông Dương, gồm Bắc Kỳ, Trung Kỳ, Nam Kỳ và Campuchia, đặt thủ đô tại Sài Gòn","time":"1887 17 tháng 10","description":"[1]"}
{"name":"sáp nhập Lào vào Liên bang Đông Dương","time":"1893 3 tháng 10","description":"tiếng Lào"}
{"name":"sáp nhập Quảng Châu Loan vào Liên bang Đông Dương","time":"1898 12 tháng 4","description":"tiếng Pháp"}
{"name":"Liên bang Đông Dương dời thủ đô về Hà Nội","time":"1902","description":"21°02′00″B 105°51′00″Đ﻿ / ﻿21,0333°B 105,85°Đ﻿ / 21.0333; 105.8500"}
{"name":"phong trào Duy Tân","time":"1906–1908","description":"[1]"}
{"name":"phong trào chống sưu thuế Trung Kỳ","time":"1908","description":"1908"}
{"name":"khoảng 100.000 người Việt bị ép sang châu Âu chiến đấu cho Pháp trong Chiến tranh thế giới thứ nhất","time":"1914–1918","description":""}
{"name":"khởi nghĩa Thái Nguyên","time":"1917","description":""}
{"name":"Nguyễn Ái Quốc gửi Yêu sách của nhân dân An Nam tới Hội nghị Hòa bình Versailles","time":"1919 18 tháng 6","description":""}
{"name":"hợp nhất ba tổ chức cộng sản thành Đảng Cộng sản Việt Nam","time":"1930 3 tháng 2","description":""}
{"name":"phong trào Xô Viết Nghệ Tĩnh","time":"1930–1931","description":"Xô Viết Nghệ Tĩnh (định hướng)"}
{"name":"khoảng 20.000 thanh niên Việt Nam bị cưỡng bức phục vụ Pháp trong chiến tranh thế giới thứ hai","time":"1939","description":"Pháp (định hướng)"}
{"name":"quân đội Nhật Bản tiến vào Đông Dương 25 tháng 9 chính phủ Pháp chấp nhận mọi yêu sách, chấp nhận việc chiếm đóng cùng giao quyền điều hành những căn cứ quân sự cho quân đội Nhật","time":"1940 30 tháng 8 25 tháng 9","description":"tiếng Nhật"}
{"name":"Việt Nam Tuyên truyền Giải phóng quân được thành lập","time":"1944 22 tháng 12","description":"chú thích trong hàng"}
{"name":"Nhật đảo chính thực dân Pháp 11 tháng 3 thành lập Đế quốc Việt Nam, phụ thuộc Đế quốc Nhật Bản 14 tháng 8 - 30 tháng 8 cách mạng tháng Tám 23 tháng 8 Đế quốc Việt Nam sụp đổ 30 tháng 8 Bảo Đại thoái vị","time":"1945 tháng 3 11 tháng 3 14 tháng 8 - 30 tháng 8 23 tháng 8 30 tháng 8","description":"[1]"}
{"name":"Hồ Chí Minh tuyên bố độc lập, thành lập nước Việt Nam Dân chủ Cộng hòa 8 tháng 9 phát động phong trào Bình dân học vụ 23 tháng 9 quân Pháp nổ súng tại Sài Gòn, bắt đầu cuộc chiến tranh xâm lược Việt Nam lần 2 23 tháng 9 Trần Văn Giàu kêu gọi Nam Bộ kháng chiến","time":"1945 2 tháng 9 8 tháng 9 23 tháng 9 23 tháng 9","description":""}
