[
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "Xem thêm",
    "time": "Xem thêm",
    "description": "Lịch sử sinh học là nghiên cứu lịch sử về thế giới sống từ thời cổ đại đến hiện đại. Mặc dù khái niệm sinh học với tư cách là một lĩnh vực độc lập chỉ mới xuất hiện trong thế kỷ 19, ngành khoa học này đã có tiền đề trong nhiều lĩnh vực như y học, dược học cho đến lịch sử tự nhiên, với nguồn gốc từ tận nền y học Ấn Độ cổ đại Ayurveda, y học Ai Cập cổ đại và các tác phẩm của Aristotle và Galen trong thế giới Hy-La. Các tác phẩm cổ đại được phát triển thêm trong thời kỳ Trung Cổ bởi các thầy thuốc Hồi giáo và các học giả như Avincenna. Trong thời kỳ Phục hưng và đầu thời kỳ hiện đại, những tư tưởng sinh học đã được cách mạng hóa ở châu Âu nhờ những quan tâm được làm mới lại trong chủ nghĩa kinh nghiệm và việc phát hiện nhiều sinh vật mới lạ. [ Đọc tiếp ]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "Xem thêm",
    "time": "",
    "description": "Lịch sử sinh học là nghiên cứu lịch sử về thế giới sống từ thời cổ đại đến hiện đại. Mặc dù khái niệm sinh học với tư cách là một lĩnh vực độc lập chỉ mới xuất hiện trong thế kỷ 19, ngành khoa học này đã có tiền đề trong nhiều lĩnh vực như y học, dược học cho đến lịch sử tự nhiên, với nguồn gốc từ tận nền y học Ấn Độ cổ đại Ayurveda, y học Ai Cập cổ đại và các tác phẩm của Aristotle và Galen trong thế giới Hy-La. Các tác phẩm cổ đại được phát triển thêm trong thời kỳ Trung Cổ bởi các thầy thuốc Hồi giáo và các học giả như Avincenna. Trong thời kỳ Phục hưng và đầu thời kỳ hiện đại, những tư tưởng sinh học đã được cách mạng hóa ở châu Âu nhờ những quan tâm được làm mới lại trong chủ nghĩa kinh nghiệm và việc phát hiện nhiều sinh vật mới lạ. [ Đọc tiếp ]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "Niên biểu lịch sử Việt Nam là hệ thống các sự kiện lịch sử Việt Nam nổi bật theo thời gian từ các thời tiền sử, huyền sử, cổ đại, trung đại, cận đại cho tới lịch sử hiện đại ngày nay.",
    "time": "Niên biểu lịch sử Việt Nam",
    "description": "Lịch sử sinh học là nghiên cứu lịch sử về thế giới sống từ thời cổ đại đến hiện đại. Mặc dù khái niệm sinh học với tư cách là một lĩnh vực độc lập chỉ mới xuất hiện trong thế kỷ 19, ngành khoa học này đã có tiền đề trong nhiều lĩnh vực như y học, dược học cho đến lịch sử tự nhiên, với nguồn gốc từ tận nền y học Ấn Độ cổ đại Ayurveda, y học Ai Cập cổ đại và các tác phẩm của Aristotle và Galen trong thế giới Hy-La. Các tác phẩm cổ đại được phát triển thêm trong thời kỳ Trung Cổ bởi các thầy thuốc Hồi giáo và các học giả như Avincenna. Trong thời kỳ Phục hưng và đầu thời kỳ hiện đại, những tư tưởng sinh học đã được cách mạng hóa ở châu Âu nhờ những quan tâm được làm mới lại trong chủ nghĩa kinh nghiệm và việc phát hiện nhiều sinh vật mới lạ. [ Đọc tiếp ]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "25.000 TCN–7.000 TCN Văn hóa Soi Nhụ",
    "time": "25.000 TCN–7.000 TCN",
    "description": "Văn hóa Soi Nhụ gọi theo tên địa điểm khảo cổ học Soi Nhụ thuộc vịnh Bái Tử Long, là nền văn hóa của người tiền sử được các nhà khảo cổ học Việt Nam phát hiện năm 1964 và khai quật năm 1967. Khái niệm và đặc điểm của nền văn hóa này đầu tiên được Ts. Hà Hữu Nga, Viện Khảo cổ học đề xuất trong Hội nghị thông báo \"Những phát hiện mới về khảo cổ học năm 1996\" (Nhà Xuất bản KHXH, Hà Nội năm 1997)."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "23.000 TCN Văn hóa Ngườm",
    "time": "23.000 TCN",
    "description": "Kỹ nghệ Ngườm là một kỹ nghệ chế tác công cụ lao động từ đá của người nguyên thủy thời hậu kỳ Đá cũ. Thập niên 1970 và 1980, các nhà khảo cổ học đã liên tục phát hiện các hiện vật mà họ cho là các công cụ nạo được chế tác từ phiến tước bằng đá có niên đại cách ngày nay khoảng 2 vạn năm ở các hang và mái đá phía nam khối núi Bắc Sơn, tiêu biểu là Mái Đá Ngườm, hang Miệng Hổ, hang Na Khù ở xã Thần Sa (Võ Nhai), Nà Coóc ở xã Yên Đĩnh (Chợ Mới), Hang Dơi ở xã Vũ Lễ (Bắc Sơn), Bó Lấm ở xã Bằng Hữu (Chi Lăng), Lạng Nắc ở xã Mai Sao (Chi Lăng), Nà Nông (Chi Lăng), thuộc địa bàn các tỉnh Thái Nguyên, Bắc Kạn và Lạng Sơn. Giáo sư Hà Văn Tấn là người đã lấy địa danh Ngườm đặt tên cho loại kỹ nghệ này.[cần dẫn nguồn]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "23.000 TCN–1.000 TCN Văn hóa Tràng An",
    "time": "23.000 TCN–1.000 TCN",
    "description": "Văn hóa Tràng An là một nền văn hóa cổ ở Việt Nam, hình thành từ thời kỳ đồ đá cũ cách nay khoảng 25 ngàn năm. Tràng An là tên một địa danh ở Ninh Bình, nơi đầu tiên tìm ra những di chỉ của nền văn hóa này. Đến nay đã có khoảng 30 địa điểm thuộc nền văn hóa Tràng An đã được phát hiện.[1]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "20.000 TCN–12.000 TCN Văn hóa Sơn Vi",
    "time": "20.000 TCN–12.000 TCN",
    "description": "Văn hóa Sơn Vi là một nền văn hóa ở Việt Nam vào hậu kỳ thời đại đồ đá cũ cách ngày nay khoảng 30 ngàn đến 11 ngàn năm. Đây là nền văn hóa kế trước văn hóa Hòa Bình. Sơn Vi là tên một xã thuộc huyện Lâm Thao, tỉnh Phú Thọ, nơi đầu tiên tìm ra những di chỉ của nền văn hóa này. Đến nay đã có khoảng 160 địa điểm thuộc văn hóa Sơn Vi đã được phát hiện.[1]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "12.000 TCN–10.000 TCN Văn hóa Hòa Bình",
    "time": "12.000 TCN–10.000 TCN",
    "description": "Văn hóa Hòa Bình được giới khảo cổ học chính thức công nhận từ ngày 30 tháng 1 năm 1932, do đề xuất của Madeleine Colani, sau khi đã được Đại hội các nhà Tiền sử Viễn Đông họp tại Hà Nội thông qua. Khởi thủy, cụm từ này được dùng để nói đến nền văn hóa cuội được ghè đẽo trên khắp chu vi hòn cuội[1] để tạo ra những dụng cụ từ thời kỳ đá cũ đến thời kỳ đá mới. Qua thời gian, tất nhiên cụm từ này đã được đề nghị mang những tên khác nhau và có những ý nghĩa cũng khác nhau. Nhưng thời gian gần đây, hoạt động của các nhà khảo cổ học trong suốt từ năm 1975 lại đây đã cho thấy một hướng mới về quan niệm khác về thời đại cũng như không gian của Văn hóa Hòa Bình.Đây là 1 nền văn hoá đã khởi nguồn cho văn minh người Việt mà lan truyền và ảnh hưởng lên xứ phía Bắc."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "10.000 TCN - 8.000 TCN Văn hóa Bắc Sơn",
    "time": "10.000 TCN - 8.000 TCN",
    "description": "Văn hóa Bắc Sơn là một nền văn hóa cổ đại Việt Nam ở sơ kỳ thời đại đồ đá mới có niên đại sau nền văn hóa Hòa Bình, cách ngày nay từ một vạn đến tám ngàn năm. Bắc Sơn là đặt theo tên huyện Bắc Sơn (tỉnh Lạng Sơn), nơi đầu tiên phát hiện những di vật của nền văn hóa này. Các bộ lạc chủ nhân của văn hóa Hòa Bình đã tạo ra nền văn hóa Bắc Sơn."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "8.000 TCN - 6.000 TCN Văn hóa Quỳnh Văn",
    "time": "8.000 TCN - 6.000 TCN",
    "description": "Văn hóa Quỳnh Văn (thời đại đồ đá mới, khoảng 6.000 – 3.500 năm cách ngày nay) được phát hiện từ những năm 1930 bởi các học giả người Pháp. Cho đến nay đã có hơn 70 năm nghiên cứu với 21 di tích, phân bố ở ven biển Nghệ An và Hà Tĩnh, chủ yếu tập trung xung quanh vịnh biển cổ Quỳnh Lưu. Đây là các di tích \"đống rác bếp\" (Kjökkenmodding), thành phần chủ yếu là các loại điệp. Trong các lớp điệp còn có xương cốt động vật, di vật đá, gốm và bếp lửa. Công cụ đá Quỳnh Văn ít về số lượng, nghèo nàn về loại hình, kỹ thuật ghè đẽo thô sơ, chủ yếu được tạo từ đá gốc. Loại hình thường thấy là các công cụ không xác định, công cụ hình đĩa, công cụ hình múi bưởi, công cụ hình rìu dài và công cụ hình rìu ngắn. Đồ gốm thô, hầu hết là đồ đun nấu với kích thước lớn, được tạo hình bằng tay kết hợp với bàn đập hòn kê. Đồ gốm có bốn loại chủ yếu: gốm đáy tròn văn in đập, gốm đáy tròn văn thừng, gốm đáy tròn văn thừng ở mặt ngoài và văn chải ở mặt trong, gốm đáy nhọn văn chải 2 mặt. Gốm đáy nhọn, văn chải 2 mặt là đặc trưng tiêu biểu nhất của văn hóa Quỳnh Văn. Các loại hình hiện vật khác như xương, đồ trang sức có số lượng ít.[1]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "7.000 TCN - 5.000 TCN Văn hóa Cái Bèo",
    "time": "7.000 TCN - 5.000 TCN",
    "description": "Văn hóa Cái Bèo có niên đại trước nền văn hóa Hạ Long. Di chỉ Cái Bèo được phát hiện vào năm 1938 trong lần tiến hành thám sát khảo cổ học ven biển khu vực liên quan thuộc vùng vịnh Hạ Long ngày nay. Di chỉ Cái Bèo khai quật được hơn 479 công cụ như chày, bàn nghiền, bàn mài, hòn kê, rìu bôn, đục, chì lưới … bằng đá cuội. Đồ gốm thô cứng làm từ đất sét và cát hạt khô, bếp, di cốt người; các xương răng động vật, xương thú như lợn rừng, nai, dê núi. Theo cạeiririejehhdc nhà khảo cổ học, di chỉ Cái Bèo thuộc nền văn hóa Hạ Long, bởi phân tích rõ ra là cư dân Cái Bèo cùng với thời gian và xu hướng chuyển cư của người Hòa Bình – Bắc Sơn từ vùng núi xuống biển. Sau đợt biển tiến Haloxen Trung làm nảy sinh các hoạt động kinh tế riêng biệt của từng vùng. Riêng cư dân đảo Cát Bà, trong đó có người cổ Cái Bèo làm nghề đánh cá là chủ yếu.[1]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "6.000 TCN - 5.000 TCN Văn hóa Đa Bút",
    "time": "6.000 TCN - 5.000 TCN",
    "description": "Văn hóa Đa Bút là một nền văn hóa Việt Nam ở sơ kỳ thời đại đồ đá mới có niên đại sau các nền văn hóa Hòa Bình và Bắc Sơn, cách đây từ 5000 đến 6000 năm. Không gian của văn hóa Đa Bút là dải đất nằm từ hữu ngạn sông Đáy đến tả ngạn sông Mã thuộc các tỉnh Ninh Bình và Thanh Hóa ngày nay. Tính đến năm 2010, đã có hơn 10 điểm văn hóa Đa Bút được phát hiện và khai quật. Các bộ lạc chủ nhân của văn hóa Đa Bút đã tạo ra nền văn hóa Đông Sơn.[1]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "3.000 TCN–1.500 TCN Văn hóa Hạ Long",
    "time": "3.000 TCN–1.500 TCN",
    "description": "Văn hóa Hạ Long là một nền văn hóa cổ. Cho đến nay, đã có khoảng gần 50 di tích “Văn hoá Hạ Long” được phát hiện trên các đảo của Vịnh Hạ Long cũng như dọc bờ biển từ Móng Cái đến Vân Đồn, với đặc trưng chung về loại hình - kỹ thuật chế tác công cụ đá và đồ gốm có niên đại từ 5.000-3.000 năm cách ngày nay.[1][2][3]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "2.000 TCN–1.500 TCN Văn hóa Phùng Nguyên",
    "time": "2.000 TCN–1.500 TCN",
    "description": "Văn hóa Phùng Nguyên là một nền văn hóa tiền sử thuộc sơ kỳ thời đại đồ đồng, cuối thời đại đồ đá mới, tồn tại từ cuối thiên niên kỷ III TCN, đầu thiên niên II TCN và kết thúc vào khoảng nửa đầu thiên niên kỷ II TCN[1]. Phùng Nguyên là tên một làng ở xã Kinh Kệ (nay là xã Phùng Nguyên), huyện Lâm Thao, tỉnh Phú Thọ, nơi đầu tiên tìm ra các di chỉ của nền văn hóa này. Di chỉ văn hóa Phùng Nguyên đã được phát hiện ở Phú Thọ, Bắc Ninh, Ninh Bình, Hà Nội, Hải Phòng và một vài nơi khác trong lưu vực sông Hồng. Tính đến năm 1998, có khoảng 55 địa điểm đã được phát hiện có di chỉ văn hóa đồng dạng với các di chỉ tại Phùng Nguyên, trong đó có 3 địa điểm có di cốt người. Công cụ bằng đá phổ biến và chiếm ưu thế tuyệt đối. Đồ trang sức bằng các loại đá, đá bán quý, ngọc được tìm thấy nhiều, đặc biệt là các vòng đá. Ngoài đồ đá, cư dân Phùng Nguyên đã biết chế tạo đồ gốm đặc sắc từ khâu làm đất, tạo dáng cho đến hoa văn trang trí. Trong đời sống của cư dân Phùng Nguyên đã xuất hiện đồ đồng và thuật luyện kim (còn hạn chế)."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "2.000 TCN–1.000 TCN Văn hóa Tiền Sa Huỳnh",
    "time": "2.000 TCN–1.000 TCN"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1.500 TCN–1.000 TCN Văn hóa Đồng Đậu",
    "time": "1.500 TCN–1.000 TCN",
    "description": "Văn hoá Đồng Đậu là nền văn hóa thuộc thời kỳ đồ đồng ở Việt Nam cách ngày nay khoảng 3.000 năm, sau văn hóa Phùng Nguyên, trước văn hóa Gò Mun. Tên của nền văn hóa này đặt theo tên khu di tích Đồng Đậu ở thị trấn Yên Lạc, huyện Yên Lạc, tỉnh Vĩnh Phúc, nơi các nhà khảo cổ học đã khám phá ra một nền văn hóa đồ đồng phong phú năm 1962."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1.000 TCN - 600 TCN Văn hóa Gò Mun",
    "time": "1.000 TCN - 600 TCN",
    "description": "Văn hóa Gò Mun ước chừng trong khoảng thời gian từ năm 1.000 - năm 700 TCN, thuộc cuối thời kỳ đồ đồng. Nền văn hóa này được đặt tên theo địa điểm mà vào năm 1961 các nhà khảo cổ học đã khai quật được nhiều di chỉ của nền văn hóa này (gò Mun, xã Tứ Xã, huyện Phong Châu, tỉnh Phú Thọ)."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1.000 TCN - 200 Văn hóa Sa Huỳnh",
    "time": "1.000 TCN - 200 ",
    "description": "Văn hóa Sa Huỳnh là một nền văn hóa được xác định ở vào khoảng năm 1000 TCN đến cuối thế kỷ thứ 2. Nền văn hóa Sa Huỳnh là một trong ba cái nôi cổ xưa về văn minh trên lãnh thổ Việt Nam, cùng với Văn hóa Đông Sơn và Văn hóa Đồng Nai tạo thành tam giác văn hóa của Việt Nam thời kỳ đồ sắt"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1.000 TCN - 0 Văn hóa Đồng Nai",
    "time": "1.000 TCN - 0",
    "description": "Văn hóa Đồng Nai chỉ các di tích khảo cổ ở Việt Nam phân bố trên vùng trung du và đồng bằng miền Đông Nam Bộ, ven các sông Đồng Nai, sông Sài Gòn và sông Vàm Cỏ, thể hiện một quá trình diễn biến văn hoá từ sơ kì thời đại đồ đồng đến sơ kì thời đại sắt. Giữa các di tích có những khác biệt nhất định, song chúng cùng có những đặc trưng chung nên có nhiều ý kiến xếp chúng vào một nền văn hoá chung. Có người gọi là Văn hóa Đồng Nai, cũng có ý kiến gọi là văn hoá Phước Tân, văn hoá Bến Đò hay văn hoá Cù Lao Rùa. Cho đến nay, đã phát hiện được hàng trăm di tích ở hầu khắp các tỉnh miền Đông Nam Bộ, trong đó có các di tích tiêu biểu như Cầu Sắt, Suối Chồn, Bình Đa, Cái Vạn, Cù Lao Rùa, Hưng Thịnh, Đồi Xoài, Đồi Mít, Gò Me, Đồi Phòng Không, Cái Lăng, Long Bửu, Bến Đò, Phước Tân, Gò Đá, Dốc Chùa, Bù Đốp, Gò Tháp, Gò Canh Nông, Gò Cao Su, An Sơn, Rạch Núi, vv.[1]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "700 TCN–100 Văn hóa Đông Sơn",
    "time": "700 TCN–100",
    "description": "Văn hóa Đông Sơn là một nền văn hóa cổ đã xuất hiện vào khoảng năm 800 Trước Công Nguyên, từng tồn tại ở một số tỉnh miền Bắc Việt Nam và Bắc Trung bộ Việt Nam (Phú Thọ, Yên Bái, Hòa Bình, Hà Nội, Nam Định, Ninh Bình, Hà Nam , Thanh Hóa, Nghệ An, Hà Tĩnh mà trung tâm là khu vực Đền Hùng), và ba con sông lớn và chính của đồng bằng Bắc Bộ (sông Hồng, sông Mã và sông Lam) vào thời kỳ đồ đồng và thời kỳ đồ sắt sớm. Nền văn hóa này được đặt tên theo địa phương nơi các dấu tích đầu tiên của nó được phát hiện, gần sông Mã, Thanh Hóa. Nhiều dấu tích đặc trưng cho văn hóa Đông Sơn cũng được tìm thấy ở một số vùng lân cận Việt Nam như ở Vân Nam, Quảng Tây, Hải Nam của Trung Quốc, ở Lào hay ở Thái Lan..."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1 - 630 Văn hóa Óc Eo",
    "time": "1 - 630",
    "description": "Văn hóa Óc Eo là một nền văn hóa cổ hình thành và phát triển ở Nam Bộ Việt Nam từ thế kỷ 1 đến thế kỷ 7 sau Công Nguyên. Đây là một nền văn hóa lớn trong lịch sử Việt Nam, gắn liền với đất nước, con người ở vùng châu thổ hạ lưu sông Mê Kông và có quan hệ mật thiết với lịch sử Đông Nam Á cổ đại.[1]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "Thế kỉ VII TCN vua Hùng thành lập quốc gia Văn Lang",
    "time": "Thế kỉ VII TCN",
    "description": "Hùng Vương (chữ Hán: 雄王) hay Vua Hùng (chữ Nôm: 𤤰雄) là cách gọi dành cho các vị vua nước Văn Lang của người Lạc Việt, tồn tại vào khoảng thế kỷ 7 tới thế kỷ 2 trước công nguyên."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "207 TCN An Dương Vương thôn tính Văn Lang, thành lập quốc gia Âu Lạc",
    "time": "207 TCN",
    "description": "An Dương vương (chữ Hán: 安陽王), tên thật là Thục Phán (蜀泮),[2] là người lập nên nước Âu Lạc, nhà nước thứ hai trong lịch sử Việt Nam sau nhà nước Văn Lang. Niên đại trị vì của An Dương Vương được các tài liệu ghi khác nhau. Sử cũ như Đại Việt sử ký toàn thư, Khâm định Việt sử thông giám cương mục cho rằng thời gian ông làm vua Âu Lạc kéo dài 50 năm, từ 257 TCN đến 208 TCN.[3] Các sử gia hiện đại căn cứ vào Sử ký Tư Mã Thiên là tài liệu gần thời đại nước Âu Lạc nhất, cho rằng An Dương Vương và nước Âu Lạc tồn tại từ khoảng 208 TCN đến 179 TCN, tức là gần 30 năm.[4]."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "218 TCN - 207 TCN Chiến tranh Tần-Việt",
    "time": "218 TCN - 207 TCN",
    "description": "Nhà Tần chiến thắng"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "179 TCN Triệu Đà xâm lược nước Âu Lạc, sáp nhập vào quốc gia Nam Việt",
    "time": "179 TCN",
    "description": "Triệu Vũ Đế (chữ Hán: 趙武帝, 257 TCN hoặc 235 TCN - 137 TCN), húy Triệu Đà (chữ Hán: 趙佗), là vị vua đầu tiên của nước Nam Việt, án ngữ tại Quảng Đông và miền bắc Việt Nam. Ông vốn là người Trung Quốc, quê ở huyện Chân Định (真定), quận Hằng Sơn (恒山) (ngày nay là huyện Chính Định (正定), tỉnh Hà Bắc), miền Bắc Trung Quốc.[1]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "111 TCN Chiến tranh Hán-Nam Việt",
    "time": "111 TCN",
    "description": "Chiến tranh Hán–Nam Việt là một cuộc chiến tranh giữa nhà Tây Hán và nước Nam Việt vào cuối thế kỷ 2 trước Công nguyên."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "111 TCN nhà Hán thôn tính Nam Việt",
    "time": "111 TCN",
    "description": "Nhà Hán là hoàng triều thứ hai trong lịch sử Trung Quốc, do thủ lĩnh khởi nghĩa nông dân Lưu Bang thành lập và được cai trị bởi gia tộc họ Lưu. Tiếp nối nhà Tần (221 TCN – 206 TCN) tồn tại trong một khoảng thời gian ngắn ngủi và thời kỳ Chiến tranh Hán – Sở vô quân chủ, nhà Hán bị gián đoạn giai đoạn ngắn khi nhiếp chính Vương Mãng tiếm quyền, lập nên nhà Tân (9 – 23). Nó tồn tại qua hai thời kỳ – Tây Hán (206 – 9) và Đông Hán (23 – 220) – trước khi thời kỳ Tam Quốc mở ra. Trải dài hơn bốn thế kỷ, nhà Hán được coi là triều đại hoàng kim trong lịch sử Trung Quốc, ảnh hưởng mạnh mẽ đến bản sắc nền văn minh Trung Hoa cho tới mãi về sau.[4] Ngày nay, nhóm dân tộc đa số ở Trung Quốc tự gọi mình là \"Hán nhân\", tiếng Trung được gọi là \"Hán ngữ\" và chữ viết Trung Quốc được gọi là \"Hán tự\".[5]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "40 khởi nghĩa Hai Bà Trưng, Trưng Trắc thành lập quốc gia Lĩnh Nam, kinh đô đặt tại Mê Linh",
    "time": "40",
    "description": "Khởi nghĩa Hai Bà Trưng là cuộc khởi nghĩa chống Bắc thuộc đầu tiên trong lịch sử Việt Nam do hai chị em Trưng Trắc và Trưng Nhị lãnh đạo. Cuộc khởi nghĩa đã đánh đuổi được lực lượng cai trị nhà Đông Hán ra khỏi Giao Chỉ (tương đương một phần Quảng Tây, Trung Quốc và Bắc Bộ, Bắc Trung Bộ Việt Nam hiện nay), mang lại độc lập trong 3 năm cho người Việt tại đây."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "42 - 43 Chiến tranh Lĩnh Nam - Đông Hán",
    "time": "42 - 43",
    "description": "Chiến tranh Hán-Việt 42-43 là tên gọi của cuộc chiến do tướng nhà Đông Hán Mã Viện chỉ huy chống lại quân nổi dậy của Hai Bà Trưng ở đất Việt năm 42-43."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "43 Đông Hán thôn tính Lĩnh Nam",
    "time": "43",
    "description": "Nhà Hán là hoàng triều thứ hai trong lịch sử Trung Quốc, do thủ lĩnh khởi nghĩa nông dân Lưu Bang thành lập và được cai trị bởi gia tộc họ Lưu. Tiếp nối nhà Tần (221 TCN – 206 TCN) tồn tại trong một khoảng thời gian ngắn ngủi và thời kỳ Chiến tranh Hán – Sở vô quân chủ, nhà Hán bị gián đoạn giai đoạn ngắn khi nhiếp chính Vương Mãng tiếm quyền, lập nên nhà Tân (9 – 23). Nó tồn tại qua hai thời kỳ – Tây Hán (206 – 9) và Đông Hán (23 – 220) – trước khi thời kỳ Tam Quốc mở ra. Trải dài hơn bốn thế kỷ, nhà Hán được coi là triều đại hoàng kim trong lịch sử Trung Quốc, ảnh hưởng mạnh mẽ đến bản sắc nền văn minh Trung Hoa cho tới mãi về sau.[4] Ngày nay, nhóm dân tộc đa số ở Trung Quốc tự gọi mình là \"Hán nhân\", tiếng Trung được gọi là \"Hán ngữ\" và chữ viết Trung Quốc được gọi là \"Hán tự\".[5]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "156–160 Khởi nghĩa Chu Đạt",
    "time": "156–160",
    "description": "Cuộc khởi nghĩa Chu Đạt diễn ra từ năm 156 đến năm 160. Năm 156, Chu Đạt, người huyện Cư Phong, Cửu Chân (nay là xã Phú Hào-Thọ Phú, huyện Triệu Sơn, Thanh Hóa), nổi dậy chống chính quyền đô hộ nhà Đông Hán. Chu Đạt chiêu mộ dân binh vây đánh huyện sở Cư Phong (vùng đất các huyện Nông Cống, Quảng Xương, Tĩnh Gia, Như Xuân, Như Thanh thuộc tỉnh Thanh Hóa ngày nay) giết chết huyện lệnh, giải phóng toàn bộ quận Cửu Chân rồi tấn công quận trị Tư Phố giết chết thái thú Nghê Thức nhà Đông Hán. Cuộc khởi nghĩa tập hợp lực lượng có tới 5.000 người, quản trị Cửu Chân được 4 năm từ năm 156 đến năm 160. Năm 158, vua Đông Hán cử đô úy Ngụy Lãng đem quân đàn áp, buộc Chu Đạt phải lui vào Nhật Nam (Quảng Bình, Quảng Trị, Thừa Thiên). Tại đây thanh thế nghĩa quân mạnh lên, lực lượng lên tới hàng vạn người, hoạt động đến mùa thu 160 thì bị thứ sử Hạ Phương dập tắt. Chu Đạt mất tại đây."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "178–181 Khởi nghĩa Lương Long",
    "time": "178–181",
    "description": "Khởi nghĩa Lương Long (178-181) do Lương Long (梁龍) người Giao Chỉ lãnh đạo nhân dân các quận Giao Chỉ, Cửu Chân, Nhật Nam, Hợp Phố chống lại chính quyền đô hộ nhà Đông Hán. Lực lượng nghĩa quân lên tới hàng vạn người, liên kết với người Ô Hử 烏滸 (tổ tiên của người Tày ở biên giới Việt-Trung và người Choang ở Quảng Tây hiện nay) cùng Thái thú quận Nam Hải là Khổng Chi nên thanh thế rất mạnh, nổi dậy đánh chiếm được các quận huyện và nhiều vùng đất từ Giao Chỉ đến Hợp Phố và từ Cửu Chân đến Nhật Nam. Thứ sử Giao Châu là Chu Ngung phải đóng cổng thành cố thủ và xin viện binh. Mùa hè năm 181, Đông Hán vương cử Huyện lệnh Lan Lăng là Chu Tuấn mang 5000 quân sang đánh dẹp, cuộc khởi nghĩa bị dập tắt."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "192 Khu Liên khởi nghĩa, tách quận Nhật Nam thành lập quốc gia Lâm Ấp",
    "time": "192",
    "description": "Khu Liên hay Sri Mara (tiếng Tamil: திருமாறன், tiếng Thái: ศรีมาระ) là quốc vương đầu tiên của Lâm Ấp. Người ta cho rằng ông lập ra vương quốc Lâm Ấp (sau này là Chăm Pa) năm 192. Ngày tháng năm sinh cũng như mất là không rõ, chỉ biết rằng năm 270, cháu ngoại của ông là Phạm Hùng lên làm vua."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "229 23 tháng 6 Tôn Quyền xưng đế, lập nước Đông Ngô, ly khai nhà Hán",
    "time": "229 23 tháng 6",
    "description": "Tôn Quyền (giản thể: 孙权; phồn thể: 孫權; 5 tháng 7 năm 182– 21 tháng 5, 252),[a][2] tự là Trọng Mưu (仲谋), thụy hiệu Ngô Đại Đế (吴大帝, tức là \"Hoàng đế lớn của Ngô\"), là người sáng lập của chính quyền Đông Ngô dưới thời Tam Quốc trong lịch sử Trung Quốc. Ông thừa hưởng quyền kiểm soát đất Giang Đông từ tay huynh trưởng, Tôn Sách, năm 200. Ông tuyên bố độc lập và cai trị Giang Đông từ năm 222 đến 229 với tước hiệu Ngô vương và từ 229 đến 252 với tước hiệu hoàng đế Ngô. Không như các đối thủ Tào Tháo và Lưu Bị, Tôn Quyền thường đóng vai trò trung lập trong các cuộc xung đột của Thục và Ngụy, và chỉ đứng về một trong phía hai bên còn lại nếu điều đó có lợi cho nước Ngô; cũng không bao giờ cố gắng để thống nhất ba nước, mặc dù nhiều sử gia cho rằng là do không đủ thực lực để làm điều đó."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "246 - 248 Khởi nghĩa Bà Triệu",
    "time": "246 - 248",
    "description": "Thời tiền sử"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "280 Chiến tranh Tấn – Ngô",
    "time": "280",
    "description": "Chiến tranh Tấn-Ngô 279-280 là cuộc chiến cuối cùng thời Tam Quốc trong lịch sử Trung Quốc. Vua Tây Tấn là Tư Mã Viêm phát động chiến tranh và nhanh chóng tiêu diệt nước Đông Ngô (được hình thành từ đầu thế kỷ 3) chỉ sau một chiến dịch. Cuộc chiến tranh này gắn liền với sự kiện nhà Tây Tấn thống nhất toàn quốc, thời Tam Quốc kết thúc."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "420 Lưu Dụ ép Tấn Cung Đế nhường ngôi, lập ra nhà Lưu Tống",
    "time": "420",
    "description": "Tống Vũ Đế (chữ Hán: 宋武帝, 16 tháng 4 năm 363 - 26 tháng 6 năm 422), tên thật là Lưu Dụ (劉裕), tên tự Đức Dư (德輿), Đức Hưng (德興), tiểu tự Ký Nô (寄奴), quê ở thôn Tuy Dư Lý, huyện Bành Thành[1], là nhà chính trị và quân sự hoạt động vào cuối thời Đông Tấn và đồng thời cũng là vị hoàng đế khai quốc của nhà Lưu Tống trong lịch sử Trung Quốc. Tuy xuất thân bần hàn, nhưng với tài năng của mình, ông bắt đầu đặt chân vào quân đội trong triều đình Đông Tấn, lần lượt kinh qua các chức vụ quan trọng. Năm 405, Lưu Dụ lãnh binh tiêu diệt quân khởi nghĩa của Sở đế Hoàn Huyền, từ đó ông nắm toàn bộ quyền lực trong triều đình. Những năm tiếp theo, Lưu Dụ tiến hành bắc phạt, tiêu diệt các quốc gia của người Hồ ở miền bắc là Nam Yên và Hậu Tần, mở rộng lãnh thổ Đông Tấn. Bên trong, ông tiêu diệt được các thế lực của các tướng lĩnh và quý tộc như Lưu Nghị, Gia Cát Trường Dân, Tư Mã Hưu Chi, củng cố quyền lực lớn mạnh. Năm 416, ông được ban tước vị Tống công và gia phong cửu tích, kiến quốc trên đất 20 quận. Năm 419, ông ép vua Tấn phong cho mình làm Tống vương và sang năm 420 thì đoạt ngôi nhà Tấn, lên ngôi hoàng đế, kiến lập nhà Lưu Tống, triều đại đầu tiên ở phía nam trong thời kì Nam-Bắc triều. Ông ở ngôi được hai năm và qua đời và ngày 26 tháng 6 năm 422, thọ 60 tuổi. Miếu hiệu là Cao Tổ (高祖). Thuỵ hiệu là Vũ Hoàng đế (武皇帝)."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "436 Thứ sử Giao Châu Đàn Hòa Chi đánh Lâm Ấp, cướp châu báu rút về",
    "time": "436",
    "description": "Đàn Hòa Chi (chữ Hán: 檀和之, ? – 456), người Kim Hương, Cao Bình,[1] là tướng lĩnh nhà Lưu Tống trong lịch sử Trung Quốc. Ông từng cai quản Giao Châu (Bắc Bộ và Bắc Trung Bộ Việt Nam hiện nay), có công đánh bại quân Lâm Ấp láng giềng (nay là Nam Trung Bộ Việt Nam)."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "468 - 485 khởi nghĩa Lý Trường Nhân",
    "time": "468 - 485",
    "description": "Lý Trường Nhân (chữ Hán: 李長仁) là một thủ lĩnh địa phương, cát cứ Giao Châu, tự trị với chính quyền phong kiến phương Bắc trong lịch sử Việt Nam thời Bắc thuộc lần II."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "479 Tiêu Đạo Thành phế Lưu Chuẩn tự làm vua, thành lập nhà Nam Tề",
    "time": "479",
    "description": "Nam Tề Cao Đế (chữ Hán: 南齊高帝; 427–482), tên húy là Tiêu Đạo Thành (giản thể: 萧道成; phồn thể: 蕭道成; bính âm: Xiāo Dàochéng), tên tự Thiệu Bá (紹伯), tiểu húy Đấu Tương (鬥將), là hoàng đế sáng lập nên triều đại Nam Tề thời Nam-Bắc triều trong lịch sử Trung Quốc. Ông từng là tướng nhà Lưu Tống trong thời gian trị vì của hai vị hoàng đế Minh Đế và Hậu Phế Đế. Đến năm 477, do lo sợ sẽ bị Hậu Phế Đế sát hại, ông ám sát Hậu Phế Đế và đoạt lấy quyền lực, đến năm 479 thì đoạt ngôi nhà Lưu Tống."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "502 Tiêu Diễn phế truất Tiêu Bảo Dung, thành lập nhà Lương",
    "time": "502",
    "description": "Lương Vũ Đế (chữ Hán: 梁武帝; 464 – 549), tên húy là Tiêu Diễn (蕭衍), tự là Thúc Đạt (叔達), tên khi còn nhỏ Luyện Nhi (練兒), là vị Hoàng đế khai quốc của triều Lương thời Nam-Bắc triều trong lịch sử Trung Quốc. Thời kỳ ông trị vì là một trong những giai đoạn ổn định nhất và thịnh vượng nhất của Nam triều."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "541 khởi nghĩa Lý Bí",
    "time": "541",
    "description": "Chiến tranh Tiền Lý - Lương là cuộc chiến bùng nổ từ năm 545 đến năm 550 kéo dài 5 năm do Triệu Quang Phục lãnh đạo chống quân Lương."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "544 Lý Bí thành lập quốc gia Vạn Xuân",
    "time": "544",
    "description": "Lý Nam Đế (chữ Hán: 李南帝; 503 – 548), húy là Lý Bí hoặc Lý Bôn (李賁) (xem mục Tên gọi bên dưới), là vị vua đầu tiên của nhà Tiền Lý và nước Vạn Xuân. Ông là 1 trong 14 anh hùng tiêu biểu của dân tộc Việt Nam.[1]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "602 Chiến tranh Tùy–Vạn Xuân",
    "time": "602",
    "description": "Nhà Tùy chiến thắng"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "618 tháng 3 Lý Uyên tuyên bố thành lập nhà Đường tháng 5 Lý Uyên ép Dương Hựu nhường ngôi",
    "time": "618 tháng 3 tháng 5",
    "description": "Đường Cao Tổ (chữ Hán: 唐高祖, hiệu là Lý Uyên (李淵), biểu tự Thúc Đức (叔德), 8 tháng 4, 566 – 25 tháng 6, 635), là vị hoàng đế khai quốc của triều Đường trong lịch sử Trung Quốc. Ông trị vì từ năm 618 đến năm 626, tổng cộng 8 năm."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "687 khởi nghĩa Lý Tự Tiên",
    "time": "687",
    "description": "Lý Tự Tiên (李嗣先, ?-687) là thủ lĩnh cuộc khởi nghĩa tại An Nam chống lại sự đô hộ của nhà Đường năm 687."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "713 - 723 khởi nghĩa Mai Hắc Đế",
    "time": "713 - 723",
    "description": "Mai Hắc Đế (chữ Hán: 梅黑帝; 670 – 723), tên thật là Mai Thúc Loan (梅叔鸞),[1] là vị vua lãnh đạo cuộc khởi nghĩa chống lại sự chiếm đóng của nhà Đường ở miền Bắc Việt Nam vào đầu thế kỉ thứ 8.[2] Trong lịch sử Việt Nam, ông được xem như một vị anh hùng dân tộc."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "776-791 khởi nghĩa Phùng Hưng",
    "time": "776-791",
    "description": "Phùng Hưng[2][3][4] (chữ Hán: 馮興; 746-789[1]/791[5]/802) , là lãnh tụ một cuộc nổi dậy chống lại sự đô hộ của nhà Đường thời Bắc thuộc lần thứ ba (602–905) trong lịch sử Việt Nam."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "905 Khúc Thừa Dụ xây dựng chính quyền tự chủ",
    "time": "905",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "938 Trận Bạch Đằng, Ngô Quyền đánh bại quân Nam Hán trên sông Bạch Đằng",
    "time": "938",
    "description": "Tĩnh Hải quân chiến thắng"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "939 Ngô Quyền xưng vương, kinh đô Cổ Loa",
    "time": "939",
    "description": "Ngô Quyền (chữ Hán: 吳權; 17 tháng 4 năm 898 – 14 tháng 2 năm 944), còn được biết đến với tên gọi Tiền Ngô Vương ( 前吳王) là vị vua đầu tiên của nhà Ngô trong lịch sử Việt Nam. Năm 938, ông là người lãnh đạo nhân dân đánh bại quân Nam Hán trong trận Bạch Đằng, chính thức kết thúc gần một ngàn năm Bắc thuộc, mở ra một thời kì độc lập lâu dài của Việt Nam. Sau chiến thắng này, ông lên ngôi vua, lập ra nhà Ngô, trị vì từ năm 939 đến năm 944."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "944 - 968 Loạn 12 sứ quân",
    "time": "944 - 968",
    "description": "Thời tiền sử"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "968 Đinh Bộ Lĩnh xưng đế, thành lập quốc gia Đại Cồ Việt, kinh đô Hoa Lư",
    "time": "968",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "970 Đinh Bộ Lĩnh cho đúc Thái Bình hưng bảo, đồng tiền đầu tiên của Việt Nam",
    "time": "970",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "979 Đinh Bộ Lĩnh cùng con trai bị sát hại",
    "time": "979",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "980 Lê Hoàn lên ngôi vua, thành lập nhà Tiền Lê",
    "time": "980",
    "description": "Lê Hoàn (941-1005) là vị Hoàng đế sáng lập nhà Tiền Lê nước Đại Cồ Việt, trị vì nước Đại Cồ Việt trong 24 năm. Ông là 1 trong 14 vị anh hùng tiêu biểu của dân tộc Việt Nam.[2]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "981 tháng 1 - tháng 4 Chiến tranh Tống - Việt",
    "time": "981 tháng 1 - tháng 4",
    "description": "Chiến tranh Tống-Việt là một cuộc chiến tranh giữa Nhà Tống thời Tống Thái Tông và Đại Cồ Việt thời Lê Đại Hành diễn ra từ tháng 1 đến tháng 4 năm 981 trên lãnh thổ Đại Cồ Việt. Kết quả, Đại Cồ Việt đã đánh bại quân đội nhà Tống. Sau cuộc chiến này, vào năm 986, Hoàng đế Đại Tống công nhận nhà Tiền Lê và ban chế phong cho Lê Đại Hành."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1009 21 tháng 11 Lý Công Uẩn lên ngôi vua, thành lập nhà Lý",
    "time": "1009 21 tháng 11",
    "description": "Lý Thái Tổ (chữ Hán: 李太祖,(974-1028) là hoàng đế sáng lập ra nhà Lý trong lịch sử Việt Nam, trị vì từ năm 1009 đến khi qua đời vào năm 1028"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1010 Lý Công Uẩn dời đô về Thăng Long",
    "time": "1010",
    "description": "Lý Thái Tổ (chữ Hán: 李太祖,(974-1028) là hoàng đế sáng lập ra nhà Lý trong lịch sử Việt Nam, trị vì từ năm 1009 đến khi qua đời vào năm 1028"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1054 Lý Thánh Tông lên ngôi, đổi tên nước từ Đại Cồ Việt thành Đại Việt",
    "time": "1054",
    "description": "Lý Thánh Tông (chữ Hán: 李聖宗 30 tháng 3 năm 1023 – 1 tháng 2 năm 1072) là vị Hoàng đế thứ ba của hoàng triều Lý nước Đại Việt, trị vì từ tháng 11 năm 1054 đến khi qua đời năm 1072. Trong thời kỳ cầm quyền của mình, Lý Thánh Tông đã đẩy mạnh sản xuất nông nghiệp, khoan giảm hình phạt, đồng thời bảo trợ Phật giáo và Nho giáo. Ông còn xây dựng quân đội Đại Việt hùng mạnh, thực hiện chính sách đối ngoại cứng rắn với Đại Tống và mở đất về ba châu Địa Lý, Mã Linh, Bố Chính (nay là một phần thuộc Quảng Bình và Quảng Trị, Bắc Trung Bộ Việt Nam) sau thắng lợi trong cuộc chiến tranh Việt - Chiêm (1069). Sử thần đời Hậu Lê Ngô Sĩ Liên viết về Lý Thánh Tông: \"Vua khéo kế thừa, thực lòng thương dân, trọng việc làm ruộng, thương kẻ bị hình, vỗ về thu phục người xa, đặt khoa bác sĩ, hậu lễ dưỡng liêm, sửa sang việc văn, phòng bị việc võ, trong nước yên tĩnh, đáng gọi là bậc vua tốt\".[3]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1069 Chiến tranh Việt-Chiêm, Đại Việt chiếm được 3 châu của Chiêm Thành",
    "time": "1069",
    "description": "Chiến tranh Việt-Chiêm 1069 là cuộc chiến do vua Lý Thánh Tông của Đại Việt phát động năm 1069 nhằm đánh vương quốc Chiêm Thành ở phương Nam với lý do người Chiêm từ chối thần phục nhà Lý. Nhà Lý gọi cuộc chiến này là Chiến dịch phạt Chiêm 1069."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1075–1077 Chiến tranh Tống-Việt",
    "time": "1075–1077",
    "description": "Hai bên tuyên bố chiến thắng, hòa ước giữa hai nước"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1077 18 tháng 1 – 28 tháng 2 Trận Như Nguyệt, đẩy lùi quân xâm lược Tống",
    "time": "1077 18 tháng 1 – 28 tháng 2",
    "description": "Trận Như Nguyệt là một trận đánh lớn diễn ra ở một khúc sông Như Nguyệt (hay sông Cầu) vào năm 1077, là trận đánh có tính quyết định của cuộc Chiến tranh Tống-Việt, 1075-1077, và là trận đánh cuối cùng của nhà Tống trên đất Đại Việt. Trận chiến diễn ra trong nhiều tháng, kết thúc bằng chiến thắng của quân đội Đại Việt và thiệt hại nhân mạng lớn của quân Tống, đánh bại hoàn toàn ý chí xâm lược Đại Việt của họ, buộc họ phải thừa nhận Đại Việt là một quốc gia.[6]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1226 10 tháng 1 Lý Chiêu Hoàng nhường ngôi cho Trần Cảnh, thành lập nhà Trần",
    "time": "1226 10 tháng 1",
    "description": "Lý Chiêu Hoàng (chữ Hán: 李昭皇; 1218 - 1278) hay Chiêu Thánh Hoàng hậu (昭聖皇后) là nữ hoàng của đế quốc Đại Việt, cũng là Hoàng đế cuối cùng của triều đại nhà Lý, trị vì từ năm 1224 đến năm 1226. Bà là Nữ hoàng duy nhất trong lịch sử Việt Nam, nhưng không phải là vị vua nữ giới đầu tiên, vị nữ quân chủ đầu tiên là Nữ vương Trưng Trắc.[1][note 1] Bà được chính vua cha Lý Huệ Tông ra chỉ truyền ngôi, dù bên trong có khả năng do sự sắp đặt của Điện tiền Chỉ huy sứ Trần Thủ Độ, người đang nắm quyền lực trong triều đồng thời cũng là chú họ bên ngoại của bà."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1258 Chiến tranh Nguyên Mông–Đại Việt lần 1",
    "time": "1258",
    "description": "Chiến tranh Nguyên Mông – Đại Việt lần thứ nhất hay Kháng chiến chống Nguyên Mông lần thứ nhất là cách người Việt Nam gọi cuộc chiến đấu của quân dân Đại Việt chống lại quân đội của đế quốc Mông Cổ do Uriyangqatai (Ngột Lương Hợp Thai) chỉ huy vào trong khoảng thời gian nửa tháng cuối tháng 1 năm 1258 (hay năm Nguyên Phong[1] thứ 7). Cuộc chiến mở đầu với thất bại của quân Đại Việt trong trận Bình Lệ Nguyên, sau đó là trận ở Phù Lỗ, dù thắng nhưng quân đội của Ngột Lương Hợp Thai không đánh bại được đạo quân chủ lực của nhà Trần. Quân Mông Cổ tiến vào kinh thành của Đại Việt trong 9 ngày. Quân đội nhà Trần đã phản công, đại phá quân Mông trong trận Đông Bộ Đầu[2] khiến cho đội quân này phải chạy về phía Bắc, sau đó còn phải hứng chịu một cuộc tập kích khác của thủ lĩnh miền núi - Hà Bổng. Cuộc chiến này đã kết thúc với chiến thắng của nước Đại Việt, ghi dấu công lao của vua Trần Thái Tông trong việc lãnh đạo quân dân Đại Việt chiến đấu chống quân đội Mông Cổ.[3]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1282 Hội nghị Bình Than, triệu họp vương hầu, trăm quan",
    "time": "1282",
    "description": "Hội nghị Bình Than là một hội nghị quân sự do vua Trần Nhân Tông triệu tập vào tháng 11 năm 1283[1] để bàn phương hướng kháng chiến khi quân Mông Nguyên sang xâm lược Đại Việt lần thứ hai."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1284 Hội nghị Diên Hồng, triệu họp bô lão cả nước",
    "time": "1284",
    "description": "Hội nghị Diên Hồng là hội nghị được tổ chức năm 1284 tại kinh thành Thăng Long[1] do Thượng hoàng Trần Thánh Tông triệu họp các bô lão trong cả nước về trước thềm điện Diên Hồng để trưng cầu dân ý, hỏi về chủ trương hòa hay đánh khi quân Nguyên Mông sang xâm lược Việt Nam lần thứ 2."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1285 Chiến tranh Nguyên Mông-Đại Việt lần 2",
    "time": "1285",
    "description": "Nhà Trần Đại Việt Chiêm Thành"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1287–1288 Chiến tranh Nguyên Mông–Đại Việt lần 3",
    "time": "1287–1288",
    "description": "Chiến tranh Nguyên Mông – Đại Việt lần 3 (theo cách gọi khác ở Việt Nam là Kháng chiến chống quân Nguyên Mông lần thứ 3) là cuộc chiến tranh giữa Đại Nguyên và Đại Việt diễn ra trên lãnh thổ Đại Việt từ tháng 12 năm 1287 đến cuối tháng 4 năm 1288."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1396 phát hành Thông Bảo hội sao theo chủ trương của Hồ Quý Ly, đây là tiền giấy đầu tiên của Việt Nam",
    "time": "1396",
    "description": "Nhà Hồ (chữ Nôm: 茹胡, chữ Hán: 胡朝, Hán Việt: Hồ triều) là một triều đại quân chủ trong lịch sử Việt Nam, bắt đầu khi Hồ Quý Ly lên ngôi năm 1400 sau khi giành được quyền lực từ tay nhà Trần và chấm dứt khi Hồ Hán Thương bị quân Minh bắt vào năm 1407 – tổng cộng là 7 năm. Quốc hiệu Đại Việt đã đổi thành Đại Ngu năm 1400, với ý nghĩa là sự an vui lớn."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1397 Hồ Quý Ly ép Trần Thuận Tông dời đô về Tây Đô",
    "time": "1397",
    "description": "Hồ Quý Ly (chữ Hán: 胡季犛; 1336 – 1407), lấy tên húy Hồ Nhất Nguyên (胡一元), là vị hoàng đế đầu tiên của nhà nước Đại Ngu trong lịch sử Việt Nam. Ông ở ngôi vị Hoàng đế từ năm 1400 đến năm 1401 tự xưng là Quốc Tổ Chương Hoàng (國祖章皇), sau đó giữ ngôi Thái thượng hoàng từ năm 1401 đến năm 1407."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1400 22 tháng 3 Hồ Quý Ly lên ngôi, thành lập nhà Hồ, đổi tên nước thành Đại Ngu",
    "time": "1400 22 tháng 3",
    "description": "Hồ Quý Ly (chữ Hán: 胡季犛; 1336 – 1407), lấy tên húy Hồ Nhất Nguyên (胡一元), là vị hoàng đế đầu tiên của nhà nước Đại Ngu trong lịch sử Việt Nam. Ông ở ngôi vị Hoàng đế từ năm 1400 đến năm 1401 tự xưng là Quốc Tổ Chương Hoàng (國祖章皇), sau đó giữ ngôi Thái thượng hoàng từ năm 1401 đến năm 1407."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1400–1407 Chiến tranh Việt-Chiêm",
    "time": "1400–1407",
    "description": "Chiến tranh Việt – Chiêm (1400 – 1407) là cuộc chiến giữa nhà Hồ nước Đại Ngu và nước Chiêm Thành phía nam. Ban đầu nhà Hồ chiếm được đất đai mà tương đương với nam Quảng Nam và bắc Quảng Ngãi ngày nay; nhưng sau đó, do cuộc xâm lăng của nhà Minh, nhà Hồ thất bại và Chiêm Thành đã lấy lại những đất đai từng bị nhà Hồ chiếm."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1406–1407 Chiến tranh Đại Ngu–Đại Minh",
    "time": "1406–1407",
    "description": "Chiến tranh Đại Ngu – Đại Minh, Chiến tranh Hồ-Minh hay thường được giới sử học Việt Nam gọi là cuộc xâm lược của nhà Minh, là cuộc chiến của nhà Hồ nước Đại Ngu (Đại Việt) chống cuộc xâm chiếm của nhà Minh (Trung Quốc) dưới triều Minh Thành Tổ từ tháng 4 năm 1406 cho đến tháng 6 năm 1407 khi nhà Minh đánh bại hoàn toàn quân đội nhà Hồ và bắt được Hồ Quý Ly, Hồ Hán Thương."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1407 nhà Minh thôn tính Đại Ngu, đặt làm quận Giao Chỉ, trung tâm hành chính là Đông Quan 2 tháng 10 Trần Ngỗi xưng Giản Định đế, lập nên nhà Hậu Trần",
    "time": "1407 2 tháng 10",
    "description": "Giản Định Đế (chữ Hán: 簡定帝; 1375 – 1410) là vị hoàng đế khai lập nhà Hậu Trần trong lịch sử Việt Nam. Ông tên thật là Trần Ngỗi (陳頠), sinh tại kinh đô Thăng Long, (nay là Hà Nội). Có tài liệu phiên âm tên ông là Quỹ. Ông ở ngôi từ năm 1407 đến năm 1409, sau đó làm Thái thượng hoàng cho tới khi mất năm 1410."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1413 nhà Hậu Trần bị nhà Minh đánh bại",
    "time": "1413",
    "description": "Hậu Trần (chữ Nôm: 茹後陳, chữ Hán: 後陳朝, Hán Việt: Hậu Trần triều) là một triều đại trong lịch sử Việt Nam từ 1407 đến 1414 mà các sách sử vẫn chưa thống nhất cách gọi. Sách Đại Việt sử ký toàn thư thì gọi là nhà Hậu Trần, còn Khâm định Việt sử Thông giám cương mục thì hoàn toàn không nhắc đến cụm từ này mà chỉ thuật lại sự việc trong những năm tháng ấy. Ở đây, viết theo sách Đại Việt sử ký toàn thư nên gọi là nhà Hậu Trần."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1418–1427 khởi nghĩa Lam Sơn",
    "time": "1418–1427",
    "description": "Nghĩa quân Lam Sơn chiến thắng."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1428 29 tháng 4 Lê Lợi thành lập quốc gia Đại Việt, đặt kinh đô tại Đông Kinh",
    "time": "1428 29 tháng 4",
    "description": "Lê Thái Tổ (chữ Hán: 黎太祖 10 tháng 9 năm 1385[1] – 5 tháng 10 năm 1433), húy danh là Lê Lợi (黎利) là một nhà chính trị, nhà lãnh đạo quân sự, người đã thành lập một đội quân người Việt và lãnh đạo đội quân này chiến đấu chống lại sự chiếm đóng của quân đội nhà Minh từ năm 1418 đến lúc đánh đuổi hoàn toàn quân Minh ra khỏi Đại Việt vào năm 1428 sau đó xây dựng và tái thiết lại đất nước. Ông cũng thành công với các chiến dịch quân sự đánh dẹp các tù trưởng ở biên giới phía Bắc Đại Việt và quân đội Ai Lao bị xúi giục. Ông được coi là anh hùng, vị Hoàng đế huyền thoại của Đại Việt với tài năng quân sự, khả năng cai trị và lòng nhân ái đối với nhân dân.[2][3]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1442 Vụ án Lệ Chi viên",
    "time": "1442",
    "description": "Vụ án Lệ Chi viên, tức Vụ án vườn vải, là một vụ án oan nổi tiếng thời Lê sơ. Qua vụ án này, quan Đại thần Hành khiển Nguyễn Trãi và vợ là Lễ nghi học sĩ Nguyễn Thị Lộ bị triều đình Lê Sơ kết tội giết vua Lê Thái Tông, bắt tội chém đầu đến 3 họ nhà Nguyễn Trãi.[1]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1459–1460 Chính biến Thiên Hưng, Lê Thánh Tông lên ngôi",
    "time": "1459–1460",
    "description": "Chính biến Thiên Hưng là một loạt các sự kiện, trong đó có ba cuộc đảo chính từ tháng 10 năm 1459 đến tháng 6 năm 1460 dưới thời nhà Lê Sơ (1428 - 1527). Khoảng thời gian 8 tháng trên nằm trong niên hiệu Thiên Hưng (1459-1460) của vua Lê Nghi Dân. Hệ quả của sự kiện này là việc vua Lê Thánh Tông lên ngôi sau cái chết của Lê Nghi Dân và sau đó bức tử anh mình là Lê Khắc Xương. Sự kiện này cũng đặt ra nhiều nghi vấn về thân thế của vua Lê Nhân Tông, tính chính thống của Lê Nghi Dân và là vết đen trong sự nghiệp của Lê Thánh Tông."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1471 Chiến tranh Việt–Chiêm, miền bắc Chiêm Thành sáp nhập vào Đại Việt",
    "time": "1471",
    "description": "Chiến tranh Việt-Chiêm 1471 là cuộc chiến do vua Lê Thánh Tông của Đại Việt phát động năm 1471 nhằm chống lại vương quốc Chiêm Thành ở phương Nam. Quân đội Đại Việt thắng lớn, và Chiêm Thành suy yếu đến mức hầu như không còn được nhắc đến trong sử sách."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1478–1480 Chiến tranh Đại Việt–Lan Xang",
    "time": "1478–1480",
    "description": "- Đại Việt chiến thắng -Lan Xang, Lanna, và Bồn Man bị phá hủy"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1483 biên soạn Luật Hồng Đức",
    "time": "1483",
    "description": "Luật Hồng Đức là tên gọi thông dụng của bộ Quốc triều hình luật hay Lê triều hình luật, là bộ luật chính thức của nhà nước Đại Việt thời Lê sơ hiện còn được lưu giữ đầy đủ. Do các bộ luật của các triều đại phong kiến Việt Nam đều có tên gọi là Quốc triều hình luật nên ở đây dùng tên gọi Luật Hồng Đức làm tên gọi cho bài mặc dù nó không phải là tên gọi chính thức."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1511–1512 khởi nghĩa Trần Tuân",
    "time": "1511–1512",
    "description": "Trần Tuân (陳珣,[1] ?-1511) là thủ lĩnh một cuộc nổi dậy chống triều đình cuối thời Lê sơ trong lịch sử Việt Nam."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1516–1521 khởi nghĩa Trần Cảo",
    "time": "1516–1521",
    "description": "Trần Cảo (chữ Hán: 陳暠) là thủ lĩnh quân khởi nghĩa ở Đại Việt cuối thời Lê sơ. Ông lãnh đạo dân chúng nổi dậy chống các triều vua Lê Tương Dực, Lê Chiêu Tông, 3 lần đem quân uy hiếp Đông Kinh, ở lần 2 ông chiếm được Đông Kinh một thời gian. Cuộc nổi dậy của ông tuy thất bại nhưng đã gây cho quân triều đình thiệt hại lớn, và là một tác nhân đưa nhà Lê suy yếu và đi đến sụp đổ. Sách Khâm định Việt sử thông giám cương mục do phải kỵ húy nên thay chữ \"cảo\" 暠 trong tên ông bằng chữ \"cao\" 高, gọi ông là Trần Cao (陳高)."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1516-1526 Khủng hoảng cuối nhà Lê sơ và nội chiến",
    "time": "1516-1526",
    "description": "Trong lịch sử Việt Nam, giai đoạn cuối triều Lê sơ (1516 – 1526) tương ứng với các triều vua Lê Tương Dực, Lê Chiêu Tông và Lê Cung Hoàng xảy ra khủng hoảng kinh tế - chính trị trầm trọng. Trong khoảng thời gian này, Đại Việt trở nên loạn lạc, biến thành nội chiến kéo dài khiến nhà Lê suy vong, cuối cùng dẫn đến Mạc Đăng Dung nắm quyền, lập nên nhà Mạc."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1527 Mạc Đăng Dung ép Lê Cung Hoàng nhường ngôi, lập lên nhà Mạc",
    "time": "1527",
    "description": "Mạc Thái Tổ (chữ Hán: 莫太祖 22 tháng 12, 1483 – 11 tháng 9, 1541) tên húy là Mạc Đăng Dung (莫登庸), là nhà chính trị, hoàng đế sáng lập ra triều Mạc trong lịch sử Việt Nam. Ông đóng vai trò quan trọng trong các sự kiện đánh dẹp các thế lực cát cứ, chống đối triều đình, loại bỏ ảnh hưởng của những người ủng hộ Nhà Lê, thành lập Nhà Mạc và chống lại những lực lượng trung thành với nhà Lê ở Thanh Hóa."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1533 Nguyễn Kim lập Lê Ninh làm vua, tái lập nhà Lê, đóng đô tại Vạn Lại",
    "time": "1533",
    "description": "Nguyễn Lim (chữ Hán: 阮, 1468–1545), là một nhà chính trị và quân sự giai đoạn Lê trung hưng trong lịch sử Việt Nam. Ông được xem là người lãnh đạo trên thực tế của chính quyền và quân đội Lê trung hưng, đã tích cực đối kháng nhà Mạc sau khi nhà Lê sơ sụp đổ. Ông đã đem các con em chạy sang Ai Lao, chiêu tập binh mã, tôn lập vua Lê Trang Tông, đặt nền móng gây dựng lại nhà Lê và mở đầu thời kỳ Nam–Bắc triều (1533–1592). Ông là nội tổ phụ của các chúa Nguyễn và vua Nguyễn sau này, đồng thời cũng là ngoại tổ phụ của các chúa Trịnh. Các vua Hậu Lê từ Lê Thần Tông (cháu ruột Trịnh Tùng) cũng là hậu duệ trực tiếp bên họ ngoại của ông. Miếu hiệu của ông là Triệu Tổ, thụy là Tĩnh Hoàng đế dù ông không phải là vua hoặc chúa nào ở nhà Nguyễn."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1533–1677 Chiến tranh Lê–Mạc",
    "time": "1533–1677",
    "description": "Nội chiến Lê–Mạc (1533–1677) là cuộc nội chiến giữa nhà Mạc và nhà Hậu Lê trong lịch sử Việt Nam. Phe chống nhà Mạc về sau khi chép sử có gọi đây là thời kỳ Phù Lê diệt Mạc."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1592 nhà Lê trung hưng đánh bại nhà Mạc, lên nắm quyền điều hành đất nước",
    "time": "1592",
    "description": "Nhà Lê trung hưng (chữ Nôm: 茹黎中興, chữ Hán: 黎中興朝, Hán Việt: Lê trung hưng triều, 1533–1789) là giai đoạn sau của triều đại quân chủ nhà Hậu Lê (giai đoạn đầu là nhà Lê sơ) trong lịch sử Việt Nam. Nhà Lê trung hưng được thành lập khi Lê Trang Tông với sự phò tá của cựu thần nhà Lê sơ là Nguyễn Kim được đưa lên ngôi báu. Đây là triều đại dài nhất so với các triều đại Việt Nam với 256 năm."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1597 Lê Thế Tông dời đô về Đông Kinh",
    "time": "1597",
    "description": "Lê Thế Tông (chữ Hán: 黎世宗 1567 - 12 tháng 10 năm 1599), tên húy là Lê Duy Đàm (黎維潭), là vị hoàng đế thứ tư của Hoàng triều Lê - giai đoạn Trung hưng và thứ 15 của triều Hậu Lê nước Đại Việt, ở ngôi từ năm 1573 đến năm 1599."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1558 Nguyễn Hoàng vào trấn thủ Thuận Hóa",
    "time": "1558",
    "description": "Nguyễn Hoàng (chữ Hán: 阮潢; 28 tháng 8, 1524 – 20 tháng 7 năm 1613) hay Nguyễn Thái Tổ, Chúa Tiên, là vị chúa Nguyễn đầu tiên, người đặt nền móng cho vương triều Nguyễn (1802 - 1945). Ông quê ở làng Gia Miêu, huyện Tống Sơn, phủ Hà Trung, xứ Thanh Hoa, ngày nay là Gia Miêu Ngoại Trang, thôn Gia Miêu, xã Hà Long, huyện Hà Trung, tỉnh Thanh Hóa. Ông nội (Nguyễn Hoằng Dụ) và cha ông (Nguyễn Kim) là những trọng thần của triều đình nhà Hậu Lê. Sau cái chết của cha ông là Nguyễn Kim, người anh rể là chúa Trịnh Kiểm nắm giữ quyền hành đã giết chết anh trai ông là Nguyễn Uông, Nguyễn Hoàng nhờ chị gái Nguyễn Thị Ngọc Bảo xin Trịnh Kiểm cho mình vào trấn thủ Thuận Hóa, Trịnh Kiểm chấp thuận."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1627–1672 Trịnh – Nguyễn phân tranh",
    "time": "1627–1672",
    "description": "Trịnh–Nguyễn phân tranh (chữ Hán: 鄭阮紛爭) là thời kỳ phân chia lãnh thổ giữa chế độ \"vua Lê chúa Trịnh\" ở phía Bắc sông Gianh (Đàng Ngoài) và chúa Nguyễn cai trị ở miền Nam (Đàng Trong), mở đầu khi Trịnh Tráng đem quân đánh Nguyễn Phúc Nguyên năm 1627 và kết thúc vào năm 1777 khi chúa Nguyễn sụp đổ."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1683 nhà Lê trung hưng đánh bại hoàn toàn nhà Mạc",
    "time": "1683",
    "description": "Nhà Lê trung hưng (chữ Nôm: 茹黎中興, chữ Hán: 黎中興朝, Hán Việt: Lê trung hưng triều, 1533–1789) là giai đoạn sau của triều đại quân chủ nhà Hậu Lê (giai đoạn đầu là nhà Lê sơ) trong lịch sử Việt Nam. Nhà Lê trung hưng được thành lập khi Lê Trang Tông với sự phò tá của cựu thần nhà Lê sơ là Nguyễn Kim được đưa lên ngôi báu. Đây là triều đại dài nhất so với các triều đại Việt Nam với 256 năm."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1771 khởi nghĩa Tây Sơn",
    "time": "1771",
    "description": "Nhà Tây Sơn (chữ Nôm: 家西山, chữ Hán: 西山朝 / Tây Sơn triều) là một triều đại quân chủ trong lịch sử Việt Nam tồn tại từ năm 1778 đến năm 1802, được thành lập trong bối cảnh tranh chấp quyền lực cuối thời Lê Trung hưng (1533–1789). Theo cách gọi của phần lớn sử gia, nhất là các sử gia hiện đại[1] tại Việt Nam thì \"nhà Tây Sơn\" được dùng để gọi triều đại của anh em Nguyễn Nhạc, Nguyễn Lữ và Nguyễn Huệ để phân biệt với nhà Nguyễn của Nguyễn Ánh (vì cùng họ Nguyễn). Ngoài ra, \"Tây Sơn\" cũng chỉ các lãnh tụ và quân đội khởi nghĩa xuất thân từ ấp Tây Sơn; cũng được dùng làm tên cuộc chiến của Tây Sơn."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1774–1775 chiến tranh Bình Nam",
    "time": "1774–1775",
    "description": "Bình Nam (Chữ Hán: 平南) là cuộc chiến lần thứ 8 và là cuộc chiến cuối cùng giữa chúa Trịnh và chúa Nguyễn trong lịch sử chia cắt Đàng Ngoài-Đàng Trong hơn 200 năm của nước Đại Việt. Trong sử sách nhà Nguyễn cuộc chiến này còn được gọi là Loạn năm Giáp Ngọ."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1777 Nguyễn Ánh xưng vương",
    "time": "1777",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1778 Nguyễn Nhạc xưng Hoàng đế, đặt niên hiệu Thái Đức, lập lên nhà Tây Sơn, đặt kinh đô tại Quy Nhơn Nguyễn Nhạc phong Nguyễn Huệ làm Bắc Bình Vương",
    "time": "1778 ",
    "description": "Nguyễn Huệ (阮惠)"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1785 19 tháng 1 – 20 tháng 1 Nguyễn Huệ phá tan quân Xiêm tại Rạch Gầm – Xoài Mút",
    "time": "1785 19 tháng 1 – 20 tháng 1",
    "description": "Trận Rạch Gầm – Xoài Mút (tiếng Thái: การรบที่ซากเกิ่ม-สว่ายมุต) là một trận chiến lớn trên sông diễn ra vào đêm 19 rạng sáng ngày 20 tháng 1 năm 1785 giữa liên quân Xiêm-Nguyễn và quân Tây Sơn tại khúc sông Rạch Gầm - Xoài Mút, khi đó thuộc dinh Trấn Định, xứ Đàng Trong; về sau đổi thành tỉnh Mỹ Tho, nay thuộc tỉnh Tiền Giang, Việt Nam. Chỉ trong nửa ngày, quân Tây Sơn do Nguyễn Huệ chỉ huy đã dùng chiến thuật phục kích để đánh tan lực lượng quân Xiêm đông gấp đôi, bảo vệ được chủ quyền của Đại Việt tại vùng Nam Bộ trước đội quân viễn chinh Xiêm La (nay là Thái Lan) do Nguyễn Ánh cầu viện."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1788 Nguyễn Nhạc từ bỏ đế hiệu, chỉ xưng Tây Sơn vương 22 tháng 12 Nguyễn Huệ xưng đế, đặt niên hiệu Quang Trung, đặt kinh đô tại Phú Xuân",
    "time": "1788 22 tháng 12",
    "description": "Nguyễn Huệ (阮惠)"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1789 Trận Ngọc Hồi – Đống Đa, đẩy lui quân xâm lược nhà Thanh, nhà Hậu Lê sụp đổ",
    "time": "1789",
    "description": "60.000 quân chính quy và dân binh đóng ở miền bắc[1], cộng với mấy vạn quân và dân binh hành quân từ phía nam ra, tổng số khoảng 100.000 quân chính quy và dân binh[2] (gồm khoảng 5 vạn quân chính quy và 5 vạn dân binh)"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1792 16 tháng 9 Nguyễn Huệ qua đời, con trai Nguyễn Quang Toản lên ngôi",
    "time": "1792 16 tháng 9",
    "description": "Nguyễn Huệ (阮惠)"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1802 Nguyễn Ánh đánh bại nhà Tây Sơn, lên ngôi vua, đặt niên hiệu là Gia Long, lập lên nhà Nguyễn, đặt kinh đô tại Phú Xuân",
    "time": "1802",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1803–1855 Nổi dậy Đá Vách",
    "time": "1803–1855",
    "description": "Phong trào nổi dậy ở Đá Vách là tên gọi một loạt nhiều cuộc nổi dậy của người dân tộc thiểu số ở khu vực Quảng Ngãi, Việt Nam. Phong trào kéo dài từ buổi đầu triều đại vua Gia Long[1] đến suốt hơn nửa thế kỷ.[2]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1804 Nguyễn Ánh đổi tên nước thành Việt Nam",
    "time": "1804",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1821–1827 Khởi nghĩa Phan Bá Vành",
    "time": "1821–1827",
    "description": "Phan Bá Vành Phan Khánh (Ba Voi) Trần Bất Hựu (Ba Bất) Hai Đáng - Trưởng tả quân Phan Ba Trần Diễn Chiêu Liễn Vũ Thị Hinh (vợ Hai Đáng) Ba Hùm thủ lĩnh (người Mường) Nguyễn Hạnh (tướng cũ của nhà Tây Sơn)"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1833–1834 Chiến tranh Việt–Xiêm",
    "time": "1833–1834",
    "description": "Chiến tranh Việt – Xiêm (1833-1834) là một cuộc chiến gồm hai đợt tấn công của quân Xiêm vào lãnh thổ Đại Nam (Việt Nam ngày nay), đợt thứ nhất khởi đầu từ tháng 11 năm 1833, đợt thứ hai tấn công từ tháng Giêng năm Giáp Ngọ (1834), đến tháng Năm cùng năm thì kết thúc. Sau cùng, quân Việt chiến thắng[1]. Theo Việt sử tân biên, Quyển 4, thì:"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1836 Việt Nam thôn tính Chân Lạp, đặt làm Trấn Tây Thành",
    "time": "1836",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1839 15 tháng 2 Minh Mạng đổi tên nước thành Đại Nam",
    "time": "1839 15 tháng 2",
    "description": "Minh Mạng (chữ Hán: 明命, 25 tháng 5 năm 1791 – 20 tháng 1 năm 1841) hay Minh Mệnh, là vị hoàng đế thứ hai của triều Nguyễn trị vì từ năm 1820 đến khi ông qua đời, được truy tôn miếu hiệu là Nguyễn Thánh Tổ. Ông là vị vua có nhiều thành tích nhất của nhà Nguyễn. Đây được xem là thời kỳ hùng mạnh cuối cùng của chế độ phong kiến trong lịch sử Việt Nam."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1841 rút quân khỏi Trấn Tây Thành, Xiêm đặt Ang Duong lên ngôi, tái lập Chân Lạp",
    "time": "1841",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1858–1884 Chiến tranh Pháp-Đại Nam",
    "time": "1858–1884",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1861–1865 Bạo loạn ven biển",
    "time": "1861–1865",
    "description": "Cuộc nổi dậy Tạ Văn Phụng, hay còn gọi là Cuộc bạo loạn ven biển hoặc Nạn giặc biển; là tên gọi của cuộc nổi dậy do Tạ Văn Phụng lãnh đạo chống lại triều đình nhà Nguyễn ở vùng ven biển Bắc Kỳ từ 1861 cho tới 1865."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1866 Chính biến chày vôi",
    "time": "1866",
    "description": "Cuộc nổi dậy Đoàn Hữu Trưng xảy ra vào ngày 16 tháng 9 năm 1866 do Đoàn Hữu Trưng khởi xướng, có thể gọi là cuộc đảo chính lần thứ ba dưới triều vua Tự Đức[1]. Những người lãnh đạo cuộc nổi dậy tin rằng việc đưa Đinh Đạo (tức Ưng Đạo, con trai trưởng của Hồng Bảo) lên thay Tự Đức sẽ cải thiện được tình hình rối ren trong nước và công cuộc kháng Pháp sẽ hiệu quả hơn. Do lực lượng nổi dậy dùng chày vôi (dụng cụ lao động) làm vũ khí, nên sử nhà Nguyễn và người dân quen gọi sự kiện này là Loạn chày vôi hoặc Giặc chày vôi."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1867 nhà Nguyễn cắt Nam Kỳ lục tỉnh nhượng cho Pháp",
    "time": "1867",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1884 6 tháng 6 Hòa ước Giáp Thân, kết thúc Chiến tranh Pháp–Đại Nam, triều đình nhà Nguyễn chấp nhận sự bảo hộ của Pháp",
    "time": "1884 6 tháng 6",
    "description": "Hòa ước Giáp Thân 1884 hay còn có tên là Hòa ước Patenôtre (phiên âm: Hòa ước Pa-tơ-nốt), là hòa ước cuối cùng nhà Nguyễn ký với thực dân Pháp vào ngày 6 tháng 6 năm 1884 tại kinh đô Huế gồm có 19 điều khoản. Đại diện nhà Nguyễn là Phạm Thận Duật - Toàn quyền đại thần, Tôn Thất Phan - Phó Toàn quyền đại thần, Nguyễn Văn Tường - Phụ chính đại thần và đại diện của Pháp là Jules Patenôtre - Sứ thần Cộng hoà Pháp."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1885–1895 phong trào Cần Vương",
    "time": "1885–1895",
    "description": "Phong trào Cần Vương (Chữ Nôm: 風潮勤王) nổ ra vào cuối thế kỷ 19 do đại thần nhà Nguyễn là Tôn Thất Thuyết nhân danh vua Hàm Nghi đề xướng trước cuộc xâm lược của thực dân Pháp."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1887 17 tháng 10 thực dân Pháp thành lập Liên bang Đông Dương, gồm Bắc Kỳ, Trung Kỳ, Nam Kỳ và Campuchia, đặt thủ đô tại Sài Gòn",
    "time": "1887 17 tháng 10",
    "description": "Đế quốc thực dân Pháp bao gồm các thuộc địa hải ngoại, xứ bảo hộ và lãnh thổ ủy thác nằm dưới sự cai trị của Pháp từ thế kỷ 16 trở đi. Các nhà sử học thường phân biệt \"Đế quốc thực dân Pháp thứ nhất\" tồn tại cho đến năm 1814, khi phần lớn lãnh thổ hải ngoại bị mất hoặc bị bán và \"Đế quốc thực dân Pháp thứ hai\" kể từ cuộc xâm lược Algérie năm 1830. Khi đỉnh điểm, đế quốc Pháp là một trong những đế quốc lớn nhất, bao gồm cả chính quốc PhápTổng diện tích của toàn đế quốc đạt 13,500,000 km² vào năm 1920, với dân số 150 triệu người vào năm 1936."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1893 3 tháng 10 sáp nhập Lào vào Liên bang Đông Dương",
    "time": "1893 3 tháng 10",
    "description": "ở ASEAN (xám đậm) – [Chú giải]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1898 12 tháng 4 sáp nhập Quảng Châu Loan vào Liên bang Đông Dương",
    "time": "1898 12 tháng 4",
    "description": "Quảng Châu Loan (tiếng Pháp: Kouang-Tchéou-Wan, tiếng Trung: 廣州灣), hoặc Lãnh thổ Quảng Châu Loan (tiếng Pháp: Territoire de Kouang-Tchéou-Wan) là một vùng lãnh thổ nằm ở ven bờ đông bán đảo Lôi Châu tỉnh Quảng Đông, Trung Quốc. Khu vực này từ năm 1898 là nhượng địa[1][2][3] của Pháp ký với nhà Thanh với hạn kỳ 99 năm nhưng đến năm 1946 thì đã hoàn lại chính phủ Trung Hoa. Nay vùng đất này thuộc địa cấp thị Trạm Giang, tỉnh Quảng Đông."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1902 Liên bang Đông Dương dời thủ đô về Hà Nội",
    "time": "1902",
    "description": "Liên bang Đông Dương (chữ Nôm: 聯邦東洋, tiếng Pháp: Union indochinoise,[a] sau 1947 là Fédération indochinoise) hay còn gọi là Đông Dương thuộc Pháp, Đông Pháp, là lãnh thổ nằm dưới quyền cai trị của thực dân Pháp trong hơn 67 năm (1887-1954) tại khu vực Đông Nam Á, ngày nay thuộc lãnh thổ Việt Nam, Lào, Campuchia và huyện Trạm Giang (tỉnh Quảng Đông, Trung Quốc). Nhân danh Triều đình Huế, Pháp cũng chính thức kiểm soát quần đảo Trường Sa và quần đảo Hoàng Sa vào năm 1920 và tuyên bố chủ quyền vào năm 1921."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1906–1908 phong trào Duy Tân",
    "time": "1906–1908",
    "description": "Cuộc vận động Duy Tân[1], hay còn được gọi là Phong trào Duy Tân hoặc Phong trào Duy Tân ở Trung Kỳ[2] là một cuộc vận động cải cách ở miền Trung Việt Nam, do Phan Châu Trinh (1872 - 1926) phát động năm 1906 cho đến năm 1908 thì kết thúc sau khi bị thực dân Pháp đàn áp."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1908 phong trào chống sưu thuế Trung Kỳ",
    "time": "1908",
    "description": "Phong trào chống sưu thuế Trung Kỳ năm 1908 hay còn gọi là Trung Kỳ dân biến là một trong những sự kiện nổi bật của phong trào chống thực dân Pháp ở Việt Nam trong những năm đầu thế kỷ 20."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1914–1918 khoảng 100.000 người Việt bị ép sang châu Âu chiến đấu cho Pháp trong Chiến tranh thế giới thứ nhất",
    "time": "1914–1918",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1917 khởi nghĩa Thái Nguyên",
    "time": "1917",
    "description": "Khởi nghĩa Thái Nguyên hay Binh biến Thái Nguyên là tên gọi cuộc nổi dậy ở tỉnh lỵ Thái Nguyên vào năm 1917 do Trịnh Văn Cấn chỉ huy, chống lại chính quyền Bảo hộ của Pháp để giành độc lập cho người Việt."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1919 18 tháng 6 Nguyễn Ái Quốc gửi Yêu sách của nhân dân An Nam tới Hội nghị Hòa bình Versailles",
    "time": "1919 18 tháng 6",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1930 3 tháng 2 hợp nhất ba tổ chức cộng sản thành Đảng Cộng sản Việt Nam",
    "time": "1930 3 tháng 2",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1930–1931 phong trào Xô Viết Nghệ Tĩnh",
    "time": "1930–1931",
    "description": "Xô Viết Nghệ - Tĩnh là tên gọi chỉ phong trào đấu tranh của lực lượng công nhân và nông dân ở Nghệ An và Hà Tĩnh trong năm 1930-1931 chống lại đế quốc Pháp tại Việt Nam. Tên gọi Xô viết Nghệ Tĩnh xuất phát từ sự hình thành các \"xã bộ nông\" mà những người cộng sản gọi là \"Xô viết\" [1]."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1939 khoảng 20.000 thanh niên Việt Nam bị cưỡng bức phục vụ Pháp trong chiến tranh thế giới thứ hai",
    "time": "1939",
    "description": "– ở châu Âu (xanh \u0026 xám đậm) – trong Liên minh châu Âu (xanh)"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1940 30 tháng 8 quân đội Nhật Bản tiến vào Đông Dương 25 tháng 9 chính phủ Pháp chấp nhận mọi yêu sách, chấp nhận việc chiếm đóng cùng giao quyền điều hành những căn cứ quân sự cho quân đội Nhật",
    "time": "1940 30 tháng 8 25 tháng 9",
    "description": "Đế quốc Nhật Bản hay Đại Nhật Bản Đế Quốc (大日本帝国 (大日本帝國), Dai Nippon Teikoku?) là một nhà nước lịch sử của Nhật Bản tồn tại từ cuộc Cách mạng Minh Trị năm 1868 cho đến khi Hiến pháp Nhật Bản được ban hành năm 1947.[4]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1944 22 tháng 12 Việt Nam Tuyên truyền Giải phóng quân được thành lập",
    "time": "1944 22 tháng 12",
    "description": "Việt Nam Tuyên truyền Giải phóng quân là tên của đội quân chủ lực của Mặt trận Việt Minh từ tháng 12 năm 1944 đến tháng 5 năm 1945. Đây là tổ chức quân sự được xem là tiền thân của Quân đội nhân dân Việt Nam. Ngày thành lập Việt Nam Tuyên truyền Giải phóng quân, 22 tháng 12, sau này đã được chọn làm ngày truyền thống của Quân đội nhân dân Việt Nam."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1945 tháng 3 Nhật đảo chính thực dân Pháp 11 tháng 3 thành lập Đế quốc Việt Nam, phụ thuộc Đế quốc Nhật Bản 14 tháng 8 - 30 tháng 8 cách mạng tháng Tám 23 tháng 8 Đế quốc Việt Nam sụp đổ 30 tháng 8 Bảo Đại thoái vị",
    "time": "1945 tháng 3 11 tháng 3 14 tháng 8 - 30 tháng 8 23 tháng 8 30 tháng 8",
    "description": "Đế quốc thực dân Pháp bao gồm các thuộc địa hải ngoại, xứ bảo hộ và lãnh thổ ủy thác nằm dưới sự cai trị của Pháp từ thế kỷ 16 trở đi. Các nhà sử học thường phân biệt \"Đế quốc thực dân Pháp thứ nhất\" tồn tại cho đến năm 1814, khi phần lớn lãnh thổ hải ngoại bị mất hoặc bị bán và \"Đế quốc thực dân Pháp thứ hai\" kể từ cuộc xâm lược Algérie năm 1830. Khi đỉnh điểm, đế quốc Pháp là một trong những đế quốc lớn nhất, bao gồm cả chính quốc PhápTổng diện tích của toàn đế quốc đạt 13,500,000 km² vào năm 1920, với dân số 150 triệu người vào năm 1936."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1945 2 tháng 9 Hồ Chí Minh tuyên bố độc lập, thành lập nước Việt Nam Dân chủ Cộng hòa 8 tháng 9 phát động phong trào Bình dân học vụ 23 tháng 9 quân Pháp nổ súng tại Sài Gòn, bắt đầu cuộc chiến tranh xâm lược Việt Nam lần 2 23 tháng 9 Trần Văn Giàu kêu gọi Nam Bộ kháng chiến",
    "time": "1945 2 tháng 9 8 tháng 9 23 tháng 9 23 tháng 9",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1946 6 tháng 1 Tổng tuyển cử bầu Quốc hội đầu tiên 26 tháng 3 Pháp lập nên Cộng hòa Tự trị Nam Kỳ thuộc Liên hiệp Pháp, thủ đô Sài Gòn 14 tháng 9 Tạm ước Việt - Pháp 19 tháng 12 Hồ Chí Minh kêu gọi Toàn quốc kháng chiến",
    "time": "1946 6 tháng 1 26 tháng 3 14 tháng 9 19 tháng 12",
    "description": "Hồ Chí Minh Việt Minh"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1947 7 tháng 10 - 22 tháng 12 Chiến dịch Việt Bắc Thu - Đông 1947",
    "time": "1947 7 tháng 10 - 22 tháng 12",
    "description": "Liên hiệp Pháp"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1949 14 tháng 6 Pháp lập nên Quốc gia Việt Nam, quốc trưởng Bảo Đại, thủ đô Sài Gòn",
    "time": "1949 14 tháng 6",
    "description": "– ở châu Âu (xanh \u0026 xám đậm) – trong Liên minh châu Âu (xanh)"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1950 8 tháng 5 Mỹ bắt đầu can thiệp quân sự vào Việt Nam 16 tháng 9–17 tháng 10 Chiến dịch Biên giới",
    "time": "1950 8 tháng 5 16 tháng 9–17 tháng 10",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1954 13 tháng 3 - 7 tháng 5 Chiến dịch Điện Biên Phủ 20 tháng 7 Hiệp định Genève, Pháp rút quân khỏi Việt Nam và đất nước bị chia cắt 10 tháng 10 Giải phóng Thủ đô",
    "time": "1954 13 tháng 3 - 7 tháng 5 20 tháng 7 10 tháng 10",
    "description": "Liên hiệp Pháp"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1955 Ngô Đình Diệm phế truất Bảo Đại, lên làm Tổng thống, lập nên Việt Nam Cộng hòa",
    "time": "1955",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1959–1960 Phong trào Đồng khởi",
    "time": "1959–1960",
    "description": "Đồng Khởi là phong trào do những thành viên Việt Minh ở lại miền Nam Việt Nam kêu gọi nhân dân nổi dậy đồng loạt chống lại Hoa Kỳ và chính phủ Việt Nam Cộng hòa. Trước hết là những vùng nông thôn rộng lớn ở Nam Bộ và cả vùng núi Nam Trung bộ Việt Nam. Phong trào này diễn ra từ cuối năm 1959, đỉnh cao là năm 1960, nhanh chóng lan rộng khắp miền Nam làm tan rã cơ cấu chính quyền cơ sở nông thôn của chính phủ Việt Nam Cộng hòa thời kỳ Ngô Đình Diệm, dẫn đến sự thành lập của Mặt trận Dân tộc Giải phóng miền Nam Việt Nam."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1960 20 tháng 12 thành lập Mặt trận Dân tộc Giải phóng miền Nam Việt Nam",
    "time": "1960 20 tháng 12",
    "description": "Mặt trận Dân tộc Giải phóng miền Nam Việt Nam (phía Việt Nam Cộng hoà và cùng các đồng minh phương Tây gọi là Việt Cộng) là một tổ chức liên minh chính trị hoạt động chống lại sự can thiệp của Hoa Kỳ và các đồng minh (Việt Nam Cộng hòa, Úc, Hàn Quốc, Thái Lan...) trong thời kỳ Chiến tranh Việt Nam. Đây là tổ chức được thành lập theo đường lối của Đảng Cộng sản Việt Nam tại Đại hội III với phương châm liên minh những người miền Nam Việt Nam có mục tiêu đấu tranh chống Mỹ và Việt Nam Cộng hòa, thực hiện đấu tranh giành độc lập dân tộc, thống nhất đất nước Việt Nam. Năm 1969, mặt trận này và Liên minh các Lực lượng Dân tộc, Dân chủ và Hòa bình Việt Nam thành lập Chính phủ Cách mạng lâm thời Cộng hòa miền Nam Việt Nam tại Nam Việt Nam. Mặt trận nhận được sự viện trợ và giúp đỡ của Việt Nam Dân chủ Cộng hòa và chịu sự lãnh đạo linh hoạt của Đảng Lao động Việt Nam."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1961 15 tháng 12 thành lập Quân Giải phóng miền Nam Việt Nam",
    "time": "1961 15 tháng 12",
    "description": "Quân Giải phóng miền Nam Việt Nam (gọi tắt là Quân Giải phóng hoặc Giải phóng quân), còn gọi là Các lực lượng vũ trang giải phóng miền Nam Việt Nam, được thành lập trên cơ sở thống nhất các lực lượng vũ trang do đảng cộng sản thành lập ở miền Nam, bao gồm lực lượng ở lại không đi tập kết, lực lượng mới tham gia tại chỗ và lực lượng đi tập kết đã quay lại miền Nam hoạt động. Về mặt quân sự, Quân Giải phóng miền Nam là một bộ phận của Quân đội Nhân dân Việt Nam, chịu sự lãnh đạo trực tiếp từ trên xuống của Quân ủy Trung ương Đảng Lao động Việt Nam và Bộ Quốc phòng Việt Nam Dân chủ Cộng hòa, Quân ủy và Bộ Tư lệnh Quân Giải phóng miền Nam, Quân khu ủy và các Bộ Tư lệnh Quân Giải phóng miền Nam ở các quân khu, Đảng ủy quân sự và Bộ Chỉ huy quân sự các tỉnh, thành phố tại miền Nam. Vì thế, lực lượng bộ đội từ miền Bắc tăng cường vào Nam chiến đấu, kể từ năm 1963, nghiễm nhiên cũng là bộ đội thuộc biên chế Quân Giải phóng. Về mặt chính trị, Quân Giải phóng là lực lượng vũ trang của Mặt trận Dân tộc Giải phóng miền Nam Việt Nam giai đoạn 1961-1969 và Chính phủ Cách mạng Lâm thời Cộng hòa miền Nam Việt Nam giai đoạn 1969-1976. Vì vậy, Quân Giải phóng chịu sự lãnh đạo tối cao từ trên xuống của Bộ Chính trị, Ban Chấp hành Trung ương Đảng Lao động Việt Nam, Trung ương Cục miền Nam của Đảng Nhân dân Cách mạng miền Nam (thành lập vào ngày 1-1-1962), Mặt trận Dân tộc Giải phóng miền Nam Việt Nam và Chính phủ Cách mạng Lâm thời Cộng hòa miền Nam Việt Nam[1]."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1961–1965 chiến dịch Chiến tranh đặc biệt",
    "time": "1961–1965",
    "description": "Giai đoạn 1960–1965"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1963 đảo chính lật đổ chính quyền Ngô Đình Diệm",
    "time": "1963",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1965 8 tháng 3 Mỹ bắt đầu đưa quân vào tham chiến tại miền Nam Việt Nam",
    "time": "1965 8 tháng 3",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1965–1968 chiến dịch Chiến tranh cục bộ",
    "time": "1965–1968",
    "description": "Thất bại chiến lược của Hoa Kỳ"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1968–1973 chiến dịch Việt Nam hóa chiến tranh",
    "time": "1968–1973",
    "description": "Lào • Sunrise • Ấp Bắc • Gò Công • Hiệp Hòa • Chà Là • 34A • Long Định • Quyết Thắng 202 • USNS Card • Nam Đông • An Lão • Bình Giã • Pleiku • Sông Bé • Ba Gia • Đồng Xoài • Ka Nak • Đèo Nhông"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1969 8 tháng 6 thành lập Cộng hòa Miền Nam Việt Nam, thủ đô Tây Ninh 2 tháng 9 Chủ tịch Hồ Chí Minh từ trần",
    "time": "1969 8 tháng 6 2 tháng 9",
    "description": "Cộng hòa miền Nam Việt Nam là một chính thể tại miền Nam Việt Nam, được thành lập bởi Đại hội Quốc dân miền Nam Việt Nam mà nòng cốt là lực lượng Mặt trận Dân tộc Giải phóng miền Nam Việt Nam, Liên minh các Lực lượng Dân tộc, Dân chủ và Hòa bình Việt Nam thành lập ở miền Nam Việt Nam với mục đích quản lý các vùng đất do phía Mặt trận Dân tộc Giải phóng miền Nam kiểm soát tại miền Nam Việt Nam. Đây là nhà nước lâm thời được lập ra nhằm để tăng tính hợp pháp và chính danh của các vùng mà Mặt trận Dân tộc Giải phóng Miền Nam Việt Nam kiểm soát."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1972 18 tháng 12 - 30 tháng 12 Chiến dịch Điện Biên Phủ trên không",
    "time": "1972 18 tháng 12 - 30 tháng 12",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1973 27 tháng 1 Hiệp định Paris, Mỹ rút quân khỏi Việt Nam",
    "time": "1973 27 tháng 1",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1975 26 tháng 4 - 2 tháng 5 Chiến dịch Hồ Chí Minh 30 tháng 4 chính phủ Việt Nam Cộng hòa đầu hàng vô điều kiện Cộng hòa Miền Nam Việt Nam",
    "time": "1975 26 tháng 4 - 2 tháng 5 30 tháng 4",
    "description": "~15.700 chết và bị thương 160.000 bị bắt. Số còn lại đào ngũ hoặc tan rã tại chỗ."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1976 2 tháng 7 thống nhất đất nước, đổi tên nước thành Cộng hòa xã hội chủ nghĩa Việt Nam",
    "time": "1976 2 tháng 7",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1977 20 tháng 9 gia nhập Liên Hợp Quốc",
    "time": "1977 20 tháng 9",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1975–1979 chiến tranh biên giới Tây Nam",
    "time": "1975–1979",
    "description": "Việt Nam Cộng hòa Nhân dân Campuchia (1979–1989)"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1979 chiến tranh biên giới phía Bắc",
    "time": "1979",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1986 Đổi Mới",
    "time": "1986",
    "description": "Đổi Mới là một chương trình cải cách toàn diện bao gồm kinh tế, đặc biệt là đổi mới trong lĩnh vực kinh tế, chính trị và nhiều khía cạnh khác của đời sống xã hội do Đảng Cộng sản Việt Nam, đứng đầu là Tổng Bí thư Nguyễn Văn Linh khởi xướng vào thập niên 1980. Chính sách Đổi mới được chính thức thực hiện từ Đại hội đại biểu Đảng Cộng sản Việt Nam lần VI, năm 1986.[1]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1991 7 tháng 11 bình thường hóa quan hệ với Trung Quốc",
    "time": "1991 7 tháng 11",
    "description": "Quan hệ Việt Nam – Trung Quốc (Quan hệ Việt-Trung, tiếng Trung: 中越關係) là mối quan hệ giữa hai nước láng giềng vì có chung biên giới trên bộ và trên biển, hai nước có chung thể chế chính trị và có quá trình gắn bó tương tác sâu sắc về văn hóa và lịch sử, cũng như các cuộc xung đột qua lại. Một chính trị gia Việt Nam tóm gọn mối quan hệ Việt-Trung trong 6 chữ \"vừa hợp tác, vừa đấu tranh\".[1]"
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1995 11 tháng 7 bình thường hóa quan hệ với Mỹ 28 tháng 7 gia nhập ASEAN",
    "time": "1995 11 tháng 7 28 tháng 7",
    "description": "Sau sự kiện 30 tháng 4 năm 1975 vấn đề bình thường hóa quan hệ ngoại giao Việt Nam - Hoa Kỳ được đặt ra. Tuy nhiên đến hai mươi năm sau, ngày 11 tháng 7 năm 1995, Tổng thống Mỹ Bill Clinton và Thủ tướng Việt Nam Võ Văn Kiệt mới tuyên bố bình thường hóa quan hệ ngoại giao giữa hai quốc gia."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "1998 14 tháng 11 gia nhập APEC",
    "time": "1998 14 tháng 11",
    "description": "Diễn đàn Hợp tác Kinh tế châu Á – Thái Bình Dương (tiếng Anh: Asia-Pacific Economic Cooperation, viết tắt là APEC) là diễn đàn của 21 nền kinh tế thành viên vành đai Thái Bình Dương[1] với mục tiêu tăng cường mối quan hệ về kinh tế và chính trị."
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "2007 11 tháng 1 gia nhập WTO",
    "time": "2007 11 tháng 1",
    "description": ""
  },
  {
    "dynasty": {
      "name": "abcd"
    },
    "name": "2020–2022 Đại dịch COVID-19",
    "time": "2020–2022",
    "description": "Vào ngày 23 tháng 1 năm 2020, trường hợp đầu tiên mắc COVID-19 do virus SARS-CoV-2 gây ra được xác nhận tại Thành phố Hồ Chí Minh, Việt Nam.[3] Xã hội, kinh tế bị tác động bởi đại dịch. Các hoạt động kiểm soát đã diễn ra trong đó có hạn chế tự do di chuyển.[4][5]"
  }
]